Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Son of noble family, awakening is completely and perfectly awakened neither by the body nor by the mind.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ ལུས་ ཀྱིས་ ཀྱང་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་ མི་ རྒྱ་ ། སེམས་ ཀྱིས་ ཀྱང་ མ་ ཡིན་ ནོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The body is inanimate, and the mind is like an illusion.
bo: ལུས་ ནི་ བེམས་པོ་ -འོ་ ། ། སེམས་ ནི་ སྒྱུ་མ་ ལྟ་བུ་ -འོ་ ། །

source: Those who comprehend the body and the mind to be like that may still talk about awakening, using conventional language, but awakening cannot be described as physical or mental, as a phenomenon or not, as genuine or not, or as true or false.
bo: གང་ ལུས་ དང་སེམས་ འདི་ ལྟ་བུ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ དེ་ ནི་ ཐ་སྙད་ བཏགས་ ནས་ བྱང་ཆུབ་ ཅེས་ བྱ་ -འི་ ། བྱང་ཆུབ་ ནི་ ལུས་ སམ་ ། སེམས་ སམ་ ། ཆོས་ སམ་ ། ཆོས་མ་ ཡིན་པ་ -འམ་ ། ཡང་དག་པ་ -འམ་ ། ཡང་དག་པ་ མ་ཡིན་པ་ -འམ་ ། བདེན་པ་ -འམ་ ། བརྫུན་པ་ གང་ གིས་ ཀྱང་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Awakening cannot be described by means of any phenomenon.
bo: བྱང་ཆུབ་ ནི་ ཆོས་ ཐམས་ཅད་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: Awakening does not have a shape that can be described in conventional terms.
bo: བྱང་ཆུབ་ ནི་ གང་ གིས་ ཚིག་ ཏུ་ ཐ་སྙད་ གདགས་པ་ -ར་ འགྱུར་བ་ -འི་ དབྱིབས་ ཅི་ཡང་ མེད་ དེ་ །

source: Just as space has no shape and is indescribable, awakening likewise has no shape and is indescribable.
bo: ཇི་ལྟར་ ནམ་མཁའ་ དབྱིབས་ མེད་ ཅིང་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ ཀྱང་ དབྱིབས་ མེད་ ཅིང་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: In the same way, no phenomena are describable if one has understood them just as they are.
bo: དེ་ལྟར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཡོངས་སུ་ བཙལ་ ན་ ཆོས་ ཐམས་ཅད་ ནི་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ སྟེ་ །

source: There are no words for phenomena.
bo: ཆོས་ ལ་ ཚིག་ མེད་ དོ་ ། །

source: There are no phenomena that correspond to words.
bo: ཚིག་ ལ་ ཡང་ ཆོས་ མེད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend this aspect of the manner of phenomena. They should comprehend it.’
bo: ཆོས་ ཀྱི་ ཚུལ་ གྱི་ རྣམ་པ་ འདི་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is not apprehended and without a foundation.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ གཟུང་ དུ་ མེད་པ་ དང་ ། གཞི་མེད་པ་ -འོ་ ། །

source: In this regard, what is not apprehended? What is without a foundation?
bo: དེ་ ལ་ གཟུང་ དུ་ མེད་པ་ ནི་ གང་ ། གཞི་མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Understanding the eye is not apprehended.
bo: མིག་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Form without objective reference is without a foundation.
bo: གཟུགས་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: Understanding the ear is not apprehended.
bo: རྣ་བ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Sound without objective reference is without a foundation.
bo: སྒྲ་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: Understanding the nose is not apprehended.
bo: སྣ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Smell without objective reference is without a foundation.
bo: དྲི་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: Understanding the tongue is not apprehended.
bo: ལྕེ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Flavor without objective reference is without a foundation.
bo: རོ་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: Understanding the body is not apprehended.
bo: ལུས་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Touch without objective reference is without a foundation.
bo: རེག་བྱ་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: Understanding mental cognition is not apprehended.
bo: ཡིད་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་ དུ་ མེད་པ་ -འོ་ ། །

source: Mental factors without objective references are without a foundation.
bo: ཆོས་ དམིགས་ སུ་ མེད་པ་ ནི་ གཞི་མེད་པ་ -འོ་ ། །

source: In that way, tathāgatas completely and perfectly awaken to awakening that is not apprehended and without a foundation.
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ གཟུང་ དུ་ མེད་པ་ དང་ ། གཞི་མེད་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: “Having attained complete and perfect awakening, the eye is not apprehended, form is not a foundation, and consciousness has nowhere to stand.
bo: མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ནས་ ཀྱང་ མིག་ གཟུང་ དུ་ མེད་ ། གཟུགས་གཞི་ མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: The ear is not apprehended, sounds are not a foundation, and consciousness has nowhere to stand.
bo: རྣ་བ་ གཟུང་ དུ་ མེད་ ། སྒྲ་ གཞི་མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: The nose is not apprehended, smells are not a foundation, and consciousness has nowhere to stand.
bo: སྣ་ གཟུང་ དུ་ མེད་ ། དྲི་ གཞི་མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: The tongue is not apprehended, tastes are not a foundation, and consciousness has nowhere to stand.
bo: ལྕེ་ གཟུང་ དུ་ མེད་ ། རོ་ གཞི་མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: The body is not apprehended, tactile sensations are not a foundation, and consciousness has nowhere to stand.
bo: ལུས་ གཟུང་ དུ་ མེད་ ། རེག་བྱ་ གཞི་མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: The mind is not apprehended, phenomena are not a foundation, and consciousness has nowhere to stand.
bo: ཡིད་ གཟུང་ དུ་ མེད་ ། ཆོས་ གཞི་མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་ དོ་ ། །

source: “Since consciousness has nowhere to stand, one deeply understands the stations of the minds of all sentient beings.
bo: དེ་ རྣམ་པ་ -ར་ ཤེས་པ་ གནས་པ་ མེད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ གནས་ རྣམས་ རབ་ཏུ་ ཤེས་ སོ་ ། །

source: What are the stations of the minds of sentient beings?
bo: སེམས་ཅན་ དག་ གི་ སེམས་ ཀྱི་ གནས་ རྣམས་ གང་ཞེ་ན་ །

source: There are four stations of the minds of sentient beings.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ ནི་ བཞི་པོ་ འདི་དག་ གོ་ ། །

source: What are these four?
bo: བཞི་ གང་ཞེ་ན་ །

source: Form is a station of the minds of sentient beings.
bo: གཟུགས་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ དང་ །

source: Likewise feeling, perception, and formations are stations of the minds of sentient beings.
bo: ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ དག་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ ཏེ་ །

source: But tathāgatas know that even these stations of their minds are nowhere to stand.
bo: སེམས་ ཀྱི་ གནས་ དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ གནས་ མེད་པ་ -ར་ མཁྱེན་ ཏོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend this limit of groundlessness. They should comprehend it.’
bo: གནས་ མེད་པ་ -འི་ མཐའ་ འདི་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is a designation for emptiness.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ འདི་ ནི་ སྟོང་པ་ཉིད་ ཀྱི་ ཚིག་ བླ་དགས་ སོ་ ། །

source: The emptiness of empty awakening is the emptiness of all empty phenomena.
bo: སྟོང་པ་ཉིད་ གང་ གིས་ བྱང་ཆུབ་ སྟོང་པ་ -འི་ སྟོང་པ་ཉིད་ དེ་ -ས་ ཆོས་ ཐམས་ཅད་ སྟོང་ ངོ་ ། །

source: The tathāgatas completely and perfectly awaken by realizing that all those phenomena are in truth emptiness.
bo: སྟོང་པ་ཉིད་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཆོས་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: Theirs is not an awakening brought about by making phenomena empty by means of emptiness.
bo: སྟོང་པ་ཉིད་ ཀྱིས་ སྟོང་པ་ཉིད་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ མ་ ཡིན་ ནོ་ ། །

source: What is called emptiness and what is called awakening are understood to be one and the same.
bo: དེ་ ནི་ འདི་ལྟ་སྟེ་ ། སྟོང་པ་ཉིད་ དང་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ ཚུལ་ གཅིག་པ་ -ར་ ཤེས་པ་ སྟེ་ །

source: There is no division of emptiness and awakening into two categories at all.
bo: དེ་ ལ་ གཉིས་ གང་ གིས་ སྟོང་པ་ཉིད་ དང་ ། བྱང་ཆུབ་ གཉིས་ སུ་ དབྱེ་བ་ -འི་ གཉིས་ ཆུང་ ཟད་ ཀྱང་ མེད་ དོ་ ། །

source: “Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Phenomena are nondual;
bo: ཆོས་ ཐམས་ཅད་ ནི་ གཉིས་ སུ་ མེད་པ་ །

source: they cannot be separated into two.
bo: གཉིས་ སུ་ དབྱེ་ -ར་ མེད་པ་ །

source: They lack attributes, names, and signs.
bo: མཚན་ཉིད་ མེད་པ་ ། མིང་མེད་པ་ ། མཚན་མ་ མེད་པ་ །

source: They are without movement, immovable, and without origination.
bo: རྒྱུ་བ་ མེད་པ་ ། རབ་ཏུ་ རྒྱུ་བ་ མེད་པ་ ། ཀུན་ ཏུ་ འབྱུང་བ་ མེད་པ་ -འོ་ ། །

source: Empty is a designation for what is devoid of clinging and apprehending.
bo: གང་སྟོང་པ་ ཞེས་ བྱ་བ་ དེ་ ནི་ མངོན་པར་ ཞེན་པ་ མེད་ ཅིང་ འཛིན་པ་ མེད་པ་ -འི་ ཚིག་ བླ་དགས་ སོ་ ། །

source: In this regard, ultimately, the phenomena that are referred to as empty are without any objective reference whatsoever, but they are still called empty.
bo: འདི་ ལ་དོན་ དམ་པ་ -ར་ གང་སྟོང་པ་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ གང་ཡང་ དམིགས་ སུ་ མེད་ ཀྱང་ སྟོང་པ་ ཞེས་ ཀྱང་ བརྗོད་ དོ་ ། །

source: Just as we call space space even though space is actually indescribable, we call what is empty empty even though emptiness is actually indescribable.
bo: ཇི་ལྟར་ ནམ་མཁའ་ ལ་ ནམ་མཁའ་ ཞེས་ རྗོད་ ཀྱང་ ནམ་མཁའ་ ནི་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ དེ་བཞིན་ དུ་ སྟོང་པ་ ལ་སྟོང་པ་ ཞེས་ རྗོད་ ཀྱང་ སྟོང་པ་ ནི་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: It is like this. This convention of using names to label what is nameless is applied to all phenomena.
bo: འདི་ལྟ་སྟེ་ ། མིང་མེད་པ་ ལ་ མིང་ དུ་ ཐ་སྙད་ འདོགས་པ་ དེ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་ འཇུག་པ་ -འོ་ ། །

source: A name also does not inhere in the object or in a part of it.
bo: མིང་ དེ་ཡང་ ཡུལ་ ན་ གནས་པ་ མ་ ཡིན་ །

source: Just as names do not inhere in objects or in their parts, in the same way, whatever phenomenon described by a given name also does not inhere in the object or in part of it.
bo: ཕྱོགས་ ན་ གནས་པ་ མ་ ཡིན་ ནོ་ ། ། ཇི་ལྟར་ མིང་ ཡུལ་ ན་ གནས་པ་ མ་ ཡིན་ ། ཕྱོགས་ ན་ གནས་པ་ མ་ཡིན་པ་ དེ་བཞིན་ དུ་ མིང་ གང་ གིས་ ཆོས་ གང་ བརྗོད་པ་ -འི་ ཆོས་ དེ་ཡང་ ཡུལ་ ན་ གནས་པ་ མ་ ཡིན་ ། ཕྱོགས་ ན་ གནས་པ་ མ་ ཡིན་ ནོ་ ། །

source: “In that way tathāgatas understand all these phenomena.
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ དེ་དག་ ཐམས་ཅད་ མཁྱེན་ ཏེ་ །

source: They understand them to be primordially unborn, unceasing, without attributes, devoid of mind, mental activity, and consciousness, and without letters or sounds.
bo: གཟོད་མ་ ནས་ མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ དང་ ། མཚན་ཉིད་ མེད་པ་ དང་ ། སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ དང་ ། ཡི་གེ་ མེད་པ་ དང་ ། སྒྲ་མེད་པ་ -ར་ ཤེས་ སོ་ ། །

source: Insofar as they understand them, they are liberated.
bo: ཇི་ལྟར་ ཤེས་པ་ དེ་བཞིན་ དུ་ རྣམ་པ་ -ར་ གྲོལ་ ཏེ་ །

source: There is no bondage.
bo: བཅིངས་པ་ ཡང་ མེད་ །

source: There is also no liberation.
bo: གྲོལ་བ་ ཡང་ མེད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend this sameness. They should comprehend it.’
bo: མཉམ་པ་ཉིད་ འདི་ ཡང་ བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ དག་ གིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is similar to space.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ ནམ་མཁའ་ དང་ མཉམ་ སྟེ་ །

source: Space itself is never the same, but it is also never not the same.
bo: ནམ་མཁའ་ ནི་ མཉམ་པ་ -འང་ མ་ ཡིན་ ། མི་མཉམ་པ་ -འང་ མ་ ཡིན་ ནོ་ ། །

source: Awakening too is never the same, but it is also never not the same.
bo: བྱང་ཆུབ་ ཀྱང་ མཉམ་པ་ -འང་ མ་ ཡིན་ ། མི་མཉམ་པ་ -འང་ མ་ ཡིན་ ནོ་ ། །

source: Since phenomena do not truly exist, one cannot say whether they are the same or not the same.
bo: ཆོས་ གང་ ལ་ ཡང་དག་པ་ -ར་ ཡོངས་སུ་ གྲུབ་པ་ མེད་པ་ དེ་ མཉམ་པ་ -འམ་ མི་མཉམ་པ་ -ར་ བརྗོད་པ་ མ་ ཡིན་ ནོ་ ། །

source: This is what tathāgatas realize when they fully awaken to the fact that all phenomena are not the same and are not not the same.
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ -འང་ མ་ ཡིན་ ། མི་མཉམ་པ་ -འང་ མ་ཡིན་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: They fully awaken without making even the slightest phenomenon the same or not the same.
bo: ཇི་ལྟར་ ཆོས་ ཆུང་ ཟད་ ཙམ་ ཡང་ མཉམ་པ་ -ར་ ཡང་ མི་ བྱེད་ ། མི་མཉམ་པ་ -ར་ ཡང་ མི་ བྱེད་པ་ དེ་ལྟར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: “They understand with correct wisdom exactly what these phenomena are like.
bo: ཆོས་ འདི་དག་ ཅི་འདྲ་བ་ དེ་ འདྲ་བ་ -ར་ ཡང་དག་པ་ -འི་ ཡེ་ཤེས་ ཀྱིས་ མཁྱེན་ ཏོ་ ། །

source: What is correct wisdom?
bo: ཡང་དག་པ་ -འི་ ཡེ་ཤེས་ ཀྱང་ གང་ཞེ་ན་ །

source: It is the understanding that all phenomena are without root, that they are unborn and unceasing.
bo: འདི་ལྟ་སྟེ་ ། ཆོས་ ཐམས་ཅད་ ནི་ རྩ་བ་ མེད་པ་ ། མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ སྟེ་ །

source: They arise out of the unarisen. Having arisen, they pass away.
bo: དེ་དག་ ནི་ མ་བྱུང་བ་ ལས་ འབྱུང་བ་ ། བྱུང་ ནས་ ཀྱང་ འབྲལ་བ་ -འོ་ ། །

source: They arise without a creator, and they pass away without a creator.
bo: དེ་དག་ ནི་ བདག་པོ་ མེད་པ་ -ར་ འབྱུང་བ་ ། བདག་པོ་ མེད་པ་ -ར་ འབྲལ་བ་ -འོ་ ། །

source: “In that way, though phenomena come to be through arising and perishing, there is no coming to be whatsoever.
bo: དེ་ལྟར་ འབྱུང་བ་ དང་ འཇིག་པ་ ལ་ བརྟེན་ ནས་ འཇུག་ ཀྱང་ འདི་ ལ་ འཇུག་པ་ གང་ཡང་ མེད་ དེ་ །

source: It is said that ‘the tathāgatas teach the Dharma in order to cut off the pathways of existence.’
bo: ལམ་ བཅད་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་སྟོན་ ཏོ་ ཞེས་ ཀྱང་ བརྗོད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend how to cut off the pathways of existence. They should comprehend it.’
bo: ལམ་ ཆད་པ་ དེ་ཡང་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is a real ground.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ དེ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ སོ་ ། །

source: What is a real ground?
bo: དེ་ ལ་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ གང་ཞེ་ན་ །

source: As is awakening, so is form, which does not transcend suchness.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ གཟུགས་ ཀྱང་ དེ་བཞིན་ ཏེ་ ། དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: As is awakening, so are feeling, perception, formations, and consciousness, which do not transcend suchness.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ ཡང་ དེ་བཞིན་ ཏེ་ ། དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: As is awakening, so are the elements of earth, water, fire, and wind, which do not transcend suchness.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ ། ས་ -འི་ ཁམས་ དང་ ། ཆུ་ -འི་ ཁམས་ དང་ ། མེ་ -འི་ ཁམས་ དང་ ། རླུང་ གི་ ཁམས་ ཀྱང་ དེ་བཞིན་ ཏེ་ ། དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: As is awakening, so are the elements of eye, form, and visual consciousness, which do not transcend suchness.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ མིག་ གི་ ཁམས་ དང་ ། གཟུགས་ ཀྱི་ ཁམས་ དང་ ། མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ ཀྱང་ དེ་བཞིན་ ཏེ་ ། དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: As is awakening, so are the elements of ear, sound, and auditory consciousness, which do not transcend suchness.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ རྣ་བ་ -འི་ ཁམས་ དང་ ། སྒྲ་ -འི་ ཁམས་ དང་ ། རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: As is awakening, so are the elements of nose, smell, and olfactory consciousness, which do not transcend suchness.
bo: སྣ་ -འི་ ཁམས་ དང་ ། དྲི་ -འི་ ཁམས་ དང་ ། སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: As is awakening, so are the elements of tongue, taste, and gustatory consciousness, which do not transcend suchness.
bo: ལྕེ་ -འི་ ཁམས་ དང་ ། རོ་ -འི་ ཁམས་ དང་ ། ལྕེ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: As is awakening, so are the elements of body, tactile sensation, and tactile consciousness, which do not transcend suchness.
bo: ལུས་ ཀྱི་ ཁམས་ དང་ ། རེག་བྱ་ -འི་ ཁམས་ དང་ ། ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: As is awakening, so are the elements of mind, phenomena, and mental consciousness, which do not transcend suchness.
bo: ཡིད་ ཀྱི་ ཁམས་ དང་ ། ཆོས་ ཀྱི་ ཁམས་ དང་ ། ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ ཀྱང་ དེ་བཞིན་ ཏེ་ ། དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: It is just these that are labeled as phenomena.
bo: ཆོས་ སུ་ བཏགས་པ་ ནི་ འདི་དག་ ཏུ་ ཟད་ དེ་ །

source: In this regard, they are labeled as aggregates, elements, and sense fields.
bo: འདི་ལྟར་ ཕུང་པོ་ དང་ ། ཁམས་ དང་ ། སྐྱེ་མཆེད་ དུ་ བཏགས་པ་ -འོ་ ། །

source: “It is to these as they really are that the tathāgatas are completely and perfectly awakened, completely and perfectly awakened in an unmistaken manner.
bo: དེ་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། ། ཕྱིན་ ཅི་ མ་ ལོག་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: As these were before, so they are later, and so they are in the meantime.
bo: དེ་དག་ ནི་ སྔོན་ གྱི་ ཇི་ལྟ་ བར་ ཕྱིས་ ཀྱང་ དེ་བཞིན་ བར་ དུ་ ཡང་ དེ་བཞིན་ ཏེ་ །

source: They do not arise in the beginning, they do not pass on in the end, and they are devoid in the meantime.
bo: སྔོན་ གྱི་ མཐའ་ -ར་ ཡང་ མ་ སྐྱེས་ ། ཕྱི་མ་ -འི་ མཐའ་ -ར་ ཡང་ མི་ འཕོ་ ། བར་ དུ་ ཡང་ དབེན་པ་ དག་ གོ་ ། །

source: This is a real ground.
bo: དེ་ལྟར་ ན་ འདི་ ནི་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ ཡིན་ ནོ་ ། །

source: As one is, so are they all. As they all are, so is one.
bo: གཅིག་ ཇི་ལྟ་ བར་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ ། ཐམས་ཅད་ ཇི་ལྟ་ བར་ གཅིག་ ཀྱང་ དེ་བཞིན་ ཏེ་ །

source: The tathāgatas do not objectify the way things are in terms of one or many.
bo: ཇི་ལྟ་བ་ བཞིན་ ལ་ ནི་ གཅིག་པ་ -འམ་ མང་བ་ -ར་ མི་ དམིགས་ སོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend the real ground. They should comprehend it.’
bo: ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ འདི་ འང་ བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening consists in having penetrated the absence of aspects through penetrating the aspects.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ རྣམ་པ་ ལ་ འཇུག་པ་ -ས་ རྣམ་པ་ མེད་པ་ ལ་ ཞུགས་པ་ -འོ་ ། །

source: In this regard, what are the aspects? What is the absence of aspects?
bo: དེ་ ལ་ རྣམ་པ་ ནི་ གང་ ། རྣམ་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Aspects refers to taking up all virtuous factors.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ རྩོམ་པ་ -འོ་ ། །

source: Absence of aspects refers to not objectifying any factor.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ མི་ དམིགས་པ་ -འོ་ ། །

source: Aspects refers to the ground of the mind that is groundless.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ གནས་པ་ མེད་པ་ -འི་ སེམས་ ཀྱི་ གནས་ སོ་ ། །

source: Absence of aspects refers to the gate of liberation, a meditative absorption without signs.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ མཚན་མ་ མེད་པ་ -འི་ ཏིང་ངེ་འཛིན་ གྱི་ རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་ -འོ་ ། །

source: Aspects refers to thinking about, evaluating, enumerating, and discriminating phenomena.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ རྣམས་ ལ་ སེམས་པ་ དང་ ། འཇལ་བ་ དང་ ། བགྲང་བ་ དང་ ། སོ་སོ་ -ར་ རྟོག་པ་ -འོ་ ། །

source: Absence of aspects refers to the complete transcendence of evaluation.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ འཇལ་བ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འོ་ ། །

source: What is the complete transcendence of evaluation?
bo: འཇལ་བ་ ལས་ ཤིན་ཏུ་ འདས་པ་ གང་ཞེ་ན་ །

source: It is that in which there is no activity of consciousness.
bo: གང་ ལ་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ལས་ མེད་པ་ -འོ་ ། །

source: Aspects refers to discriminating conditioned things.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ འདུས་བྱས་ ལ་སོ་ སོ་ -ར་ རྟོག་པ་ -འོ་ ། །

source: Absence of aspects refers to realizing the unconditioned.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ འདུས་མ་བྱས་ ལ་ མངོན་སུམ་ དུ་ བྱེད་པ་ -འོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend penetrating the aspects and the absence of aspects. They should comprehend it.’
bo: རྣམ་པ་ དང་ རྣམ་པ་ མེད་པ་ ལ་ འཇུག་པ་ འདི་ ཡང་ བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is the absence of contamination and the absence of appropriation.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ ཟག་པ་ མེད་པ་ དང་ ། ཉེ་བར་ ལེན་པ་ མེད་པ་ -འོ་ ། །

source: In this regard, what is the absence of contamination? What is the absence of appropriation?
bo: དེ་ ལ་ ཟག་པ་ མེད་པ་ ནི་ གང་ ། ཉེ་བར་ ལེན་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Absence of contamination means freedom from the four contaminants:
bo: ཟག་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཟག་པ་ བཞི་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཏེ་ །

source: freedom from the contaminant of desire, freedom from the contaminant of becoming, freedom from the contaminant of ignorance, and freedom from the contaminant of views.
bo: འདོད་པ་ -འི་ ཟག་པ་ དང་ བྲལ་བ་ དང་ ། སྲིད་པ་ -འི་ ཟག་པ་ དང་ བྲལ་བ་ དང་ ། མ་རིག་པ་ -འི་ ཟག་པ་ དང་ བྲལ་བ་ དང་ ། ལྟ་བ་ -འི་ ཟག་པ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ རོ་ ། །

source: Absence of appropriation refers to freedom from the four appropriations:
bo: ཉེ་བར་ ལེན་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཉེ་བར་ ལེན་པ་ བཞི་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཏེ་ །

source: freedom from the appropriation of desire, freedom from the appropriation of views, freedom from the appropriation of asserting a self, and freedom from the appropriation of belief in the supremacy of one’s morality and asceticism.
bo: འདི་ལྟར་ འདོད་པ་ -འི་ ཉེ་བར་ ལེན་པ་ དང་ བྲལ་བ་ དང་ ། ལྟ་བ་ -འི་ ཉེ་བར་ ལེན་པ་ དང་ བྲལ་བ་ དང་ ། བདག་ ཏུ་ སྨྲ་བ་ -འི་ ཉེ་བར་ ལེན་པ་ དང་ བྲལ་བ་ དང་ ། ཚུལ་ཁྲིམས་ དང་ བརྟུལ་ཞུགས་ མཆོག་ ཏུ་ འཛིན་པ་ -འི་ ཉེ་བར་ ལེན་པ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ རོ་ ། །

source: These four appropriations are darkened by ignorance and approached through craving.
bo: དེ་ ལ་ཉེ་ བར་ ལེན་པ་ བཞི་པོ་ འདི་དག་ ཐམས་ཅད་ ཀྱང་ མ་རིག་པ་ -ས་ མུན་པ་ -ར་ བྱས་ ཤིང་ སྲེད་པ་ -ས་ བསྙེན་ ཏེ་ །

source: Thinking ‘I am,’ they are appropriated through clinging.
bo: བདག་ གོ་ སྙམ་ དུ་ མངོན་པར་ ཞེན་པ་ -ས་ ཉེ་བར་ ལེན་པ་ དག་ གོ་ ། །

source: The tathāgatas understand the I to be the root of appropriation, and they realize that purification of the self is the purification of sentient beings.
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བདག་ ཉེ་བར་ ལེན་པ་ -འི་ རྩ་བ་ ཡོངས་སུ་ ཤེས་ ནས་ ། བདག་ རྣམ་པ་ -ར་ དག་པ་ -ས་ སེམས་ཅན་ རྣམ་པ་ -ར་ དག་པ་ -ར་ རྟོགས་ སོ་ ། །

source: The purification of the self and the purification of all sentient beings are an inseparable nonduality.
bo: བདག་ རྣམ་པ་ -ར་ དག་པ་ གང་ཡིན་པ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ རྣམ་པ་ -ར་ དག་པ་ གང་ཡིན་པ་ དེ་ གཉིས་ སུ་ མེད་ ཅིང་ གཉིས་ སུ་ དབྱེ་ -ར་ མེད་ དོ་ ། །

source: Nonduality refers to nonarising.
bo: གཉིས་ སུ་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ སྐྱེ་བ་ མེད་ དོ་ ། །

source: Due to nonarising and noncessation, mind, mental activity, and consciousness do not operate.
bo: སྐྱེ་བ་ དང་ འགག་པ་ མེད་པ་ -ས་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ རྣམས་ མི་ འཇུག་ གོ་ ། །

source: Where mind, mental activity, and consciousness do not operate, there is absolutely none of the false imagining of incorrect mental activity.
bo: གང་ ལ་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ མི་ འཇུག་པ་ དེ་ ལ་ ཡོངས་སུ་ རྟོག་པ་ གང་ གིས་ ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ -ར་ འགྱུར་བ་ -འི་ ཡོངས་སུ་ རྟོག་པ་ གང་ཡང་ མེད་ དོ་ ། །

source: “Someone with correct mental activity does not activate ignorance.
bo: དེ་ -ར་ ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ དང་ ལྡན་པ་ -ས་ མ་རིག་པ་ ཀུན་ ནས་ མི་ སློང་ ངོ་ ། །

source: When ignorance does not arise, the twelve links of becoming do not arise.
bo: གང་ མ་རིག་པ་ ཀུན་ ནས་ མི་ ལྡང་བ་ དེ་སྲིད་པ་ -འི་ ཡན་ལག་ བཅུ་གཉིས་ ཀུན་ ནས་ མི་ ལྡང་ ངོ་ ། །

source: When the twelve links of becoming do not arise, there is no birth.
bo: གང་ སྲིད་པ་ -འི་ ཡན་ལག་ བཅུ་གཉིས་ ཀུན་ ནས་ མི་ ལྡང་བ་ དེ་ མི་ སྐྱེ་བ་ -འོ་ ། །

source: That which is unborn is certain.
bo: གང་ མི་ སྐྱེ་བ་ དེ་ ངེས་པར་ གྱུར་པ་ -འོ་ ། །

source: That which is certain is the definitive meaning.
bo: གང་ ངེས་པར་ གྱུར་པ་ དེ་ ངེས་པ་ -འི་ དོན་ ཏོ་ ། །
