Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: At the very moment that the bodhisattva Māra­pramardaka attained that absorption, all the billion demons throughout the trichiliocosm, surrounded by their armies and retinues of servants, disappeared very swiftly and immediately from their individual residences.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བདུད་ རབ་ཏུ་ འཇོམས་པ་ -ས་ བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཇོམས་པ་ -འི་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ སྙོམས་པར་ ཞུགས་ མ་ ཐག་ ཏུ་ ། དེ་ནས་ དེ་ -འི་ ཚེ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ བདུད་ བྱེ་བ་ ཕྲག་ བརྒྱ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ དཔུང་ དང་ བཅས་ ། གཡོག་འཁོར་ དང་ བཅས་ ཏེ་ མྱུར་བ་ མྱུར་བ་ -ར་ རིངས་ ཐབས་ སུ་ རང་རང་ གི་ བདུད་ ཀྱི་ གནས་ ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ཏེ་ །

source: Appearing before the Blessed One in the pavilion Jeweled Array, they prostrated themselves at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འཁོད་ ནས་ ། དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They offered the Blessed One many hundreds of thousands of divine gifts, and with their palms respectfully and reverently joined they asked the Blessed One,
bo: ལྷ་ -འི་ མཆོད་པ་ རྣམ་པ་ བརྒྱ་ སྟོང་ཕྲག་ དུ་མ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་ནས་ གུས་པ་ དང་ བཅས་ ཤིང་ ཞེ་ས་ དང་ བཅས་པ་ -ར་ ཐལ་མོ་ སྦྱར་ ཏེ་ ། བཅོམ་ལྡན་འདས་ ལ་ གསོལ་བ་ བཏབ་ ནས་ །

source: “If we beseech you, Blessed One, ‘Please explain the Dharma!
bo: བཅོམ་ལྡན་འདས་ བདག་ཅག་ གསོལ་བ་ འཚལ་ ན་ བཅོམ་ལྡན་འདས་ ཆོས་ བཤད་ དུ་ གསོལ་ །

source: Sugata, please explain the Dharma!’ then, through the blessing of the bodhisattva Māra­pramardaka, we will discard any demonic deeds and henceforth will not perform deeds that confuse sentient beings.
bo: བདེ་བ་ -ར་ གཤེགས་པ་ ཆོས་ བཤད་ དུ་ གསོལ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ བདུད་ རབ་ཏུ་ འཇོམས་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ བདག་ཅག་ བདུད་ ཀྱི་ སུག་ལས་ འདོར་ ཞིང་ སླན་ཆད་ སེམས་ཅན་ རྣམས་ ལ་ མིག་ གིས་ མི་ རྩོལ་བ་ -ར་ འགྱུར་བ་ -འི་ ལས་མི་ བགྱིད་ དོ་ ། །

source: O Blessed One! Please grant us relief so that we may listen to the Dharma in your presence.”
bo: བཅོམ་ལྡན་འདས་ བདག་ཅག་ ལ་ དབུགས་དབྱུང་བ་ སྩོལ་ ཅིག་ དང་ ། བཅོམ་ལྡན་འདས་ ཀྱི་ ཐད་ དུ་ མཆིས་ ཏེ་ ། བདག་ཅག་ ཆོས་ ཉན་པ་ -ར་ བགྱིད་ དོ་ ། །

source: Thereupon, in order to grant relief to those demons, the Blessed One said,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བདུད་ དེ་དག་ དབུགས་དབྱུང་བ་ -འི་ ཕྱིར་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Friends, very well, it is very good.
bo: གྲོགས་པོ་ དག་ ལེགས་ སོ་ ལེགས་ སོ་ ། །

source: Give up your demonic deeds and beseech the Tathāgata to teach the Dharma!
bo: གང་ གི་ ཕྱིར་ ཁྱེད་ བདུད་ ཀྱི་ ལས་ ཀྱང་ འོར་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཆོས་ བཤད་པ་ -ར་ གསོལ་བ་ ཡང་ ཐོབ་ ཤིག་ དང་ །

source: This will indeed become the cause for leaving behind all the ways of Māra.
bo: དེ་ཉིད་ ཁྱེད་ ཀྱི་ བདུད་ ཀྱི་ ལམ་ ཐམས་ཅད་ ལས་ འདའ་བ་ -འི་ རྒྱུ་ -ར་ འགྱུར་ རོ་ ། །

source: Why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: It will do so because it generates the power that produces the roots of virtue for buddhahood.
bo: སངས་རྒྱས་ ལ་ དགེ་བ་ -འི་ རྩ་བ་ བསྐྲུན་པ་ -འི་ སྟོབས་ བསྐྱེད་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Friends, just as complete darkness that has prevailed for many years can be eliminated by a single lamp,
bo: གྲོགས་པོ་ དག་ འདི་ལྟ་སྟེ་ ། དཔེར་ན་ མུན་པ་ མུན་ནག་ ལོ་ དུ་མ་ -ར་ བསགས་པ་ ནི་ མར་མེ་ གཅིག་ གིས་ མེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: in the same way, my friends, the complete darkness of the afflictive emotions that has prevailed for a hundred eons can be eliminated by a single generation of the power of wisdom.
bo: གྲོགས་པོ་ དག་ དེ་བཞིན་ དུ་ ཉོན་མོངས་པ་ -འི་ མུན་པ་ མུན་ནག་ བསྐལ་པ་ བརྒྱ་ -ར་ བསགས་པ་ ཡང་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ བསྐྱེད་པ་ གཅིག་ གིས་ མེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Friends, just as the moon, the sun, or a large precious jewel can dispel all darkness, in the same way, my friends, a single virtuous thought endowed with insight can eliminate all the darkness of unknowing.
bo: གྲོགས་པོ་ དག་ འདི་ལྟ་སྟེ་ ། དཔེར་ན་ ཟླ་བ་ -འི་ དཀྱིལ་འཁོར་ གཅིག་ དང་ ། ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གཅིག་ དང་ ། ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ གཅིག་ གིས་ མུན་པ་ མུན་ནག་ ཐམས་ཅད་ སེལ་ ཏོ་ ། །

source: Friends, that is why, through this root of virtue, you will gradually remove all the darkness of unknowing and attain the great illumination of the Dharma.”
bo: གྲོགས་པོ་ དག་ དེ་བཞིན་ དུ་ དགེ་བ་ -འི་ སེམས་ ལྷག་མཐོང་ དང་ ལྡན་པ་ གཅིག་ གིས་ མི་ ཤེས་པ་ -འི་ མུན་པ་ མུན་ནག་ ཐམས་ཅད་ སེལ་ ཏོ་ ། ། གྲོགས་པོ་ དག་ དེ་ -འི་ ཕྱིར་ ཁྱེད་ དགེ་བ་ -འི་ རྩ་བ་ འདི་ -ས་ རིམ་གྱིས་ མི་ ཤེས་པ་ -འི་ མུན་པ་ མུན་ནག་ ཐམས་ཅད་ བསལ་ ནས་ ཆོས་ ཀྱི་ སྣང་བ་ ཆེན་པོ་ ཐོབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: At this point, the bodhisattva Dharmeśvara­rāja, who was present among the members of the retinue, said,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་པ་ -ར་ གྱུར་ ཏེ་ འདུག་པ་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Blessed One, the buddha domain blessed and revealed by the Tathāgata is inconceivable.
bo: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཡུལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱིན་ གྱིས་ བརླབས་པ་ དང་ ། ཀུན་ ཏུ་ བསྟན་པ་ འདི་ ནི་ བསམ་ གྱིས་ མི་ ཁྱབ་བོ་ ། །

source: I have no doubt that the Tathāgata will agree to teach the Dharma discourse of the Great Assembly chapter called The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.
bo: དེང་ ནི་ དེ་བཞིན་ གཤེགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ཞེས་ བགྱི་བ་ འདུས་པ་ ཆེན་པོ་ -འི་ ལེའུ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ བཤད་པ་ -ར་ བཞེད་པ་ -ར་ ཐེ་ཚོམ་ མ་ མཆིས་ སོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་སླད་དུ་ ཞེ་ན་ །

source: Blessed One, this assembly of outstanding bodhisattvas is great.
bo: བཅོམ་ལྡན་འདས་ ཨེ་མ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ འདུས་པ་ འདི་ ནི་ ཆེ་ སྟེ་ །

source: “Blessed One, they have donned the inconceivable bodhisattva armor.
bo: བཅོམ་ལྡན་འདས་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འི་ གོ་ཆ་ བགོས་པ་ །

source: They sport with the great wisdom of the superknowledges.
bo: མངོན་པར་ ཤེས་པ་ -འི་ ཡེ་ཤེས་ ཆེན་པོ་ -ས་ རྣམ་པ་ -ར་ རོལ་པ་ །

source: They resound in the ten directions.
bo: ཕྱོགས་ བཅུར་ སྒྲ་ བསྒྲགས་པ་ སེམས་ ཤིན་ཏུ་ བྱང་བ་ -ར་ བགྱིས་ ཏེ་

source: They are aware that stains do not exist when the mind has become purified.
bo: དྲི་མ་ མ་ མཆིས་པ་ -ར་ རིག་པ་ དང་ །

source: They are illuminated by liberation.
bo: རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ སྣང་བ་ -ར་ གྱུར་པ་ །

source: They are praised and commended by buddhas.
bo: སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ བསྟོད་ ཅིང་ བསྔགས་པ་ །

source: They attain sovereign mastery over all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ལ་ དབང་ཕྱུག་ གིས་ དབང་ སྒྱུར་བ་ །

source: They bring all perfections to perfection.
bo: ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཐམས་ཅད་ ཀྱི་ ཕ་རོལ་ ཏུ་ སོན་པ་ །

source: They emerge through all sorts of skillful methods.
bo: ཐབས་ ལ་ མཁས་པ་ ཐམས་ཅད་ ལས་ ངེས་པར་ སྐྱེས་པ་ །

source: They dispel all demonic deeds, hostilities, and afflictive emotions.
bo: བདུད་ ཀྱི་ ལས་ དང་ རྩོད་པ་ དང་ ། ཉོན་མོངས་པ་ ཐམས་ཅད་ བསལ་བ་ །

source: They tame all hosts of opponents and evil forces.
bo: ཕས་ ཀྱི་ རྒོལ་བ་ དང་ ། ངན་པ་ -འི་ ཚོགས་ཅན་ གྱི་ ཚོགས་ ཐམས་ཅད་ རབ་ཏུ་ འདུལ་བ་ །

source: They know how to analyze and teach all words.
bo: ཚིག་ ཐམས་ཅད་ རབ་ཏུ་ དབྱེ་བ་ བསྟན་པ་ ཤེས་པ་ ལ་ མཁས་པ་ །

source: They attain perfect wisdom without attachment.
bo: ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཆགས་པ་ མ་ མཆིས་པ་ -འི་ ཕ་རོལ་ ཏུ་ སོན་པ་ །

source: They have obtained mindfulness, intelligence, realization, modesty, devotion, retention, and wisdom.
bo: དྲན་པ་ དང་ ། བློ་གྲོས་ དང་ ། རྟོགས་པ་ དང་ ། ཁྲེལ་ཡོད་པ་ དང་ ། མོས་པ་ དང་ ། གཟུངས་ དང་ ། ཡེ་ཤེས་ རབ་ཏུ་ ཐོབ་པ་ །

source: They have unobstructed blessing and uninterrupted eloquence.
bo: བྱིན་ གྱི་ རླབས་ ཐོགས་པ་ མ་ མཆིས་ ཤིང་ སྤོབས་པ་ རྒྱུན་ མི་འཆད་པ་ ། །

source: They know how to distinguish the inferior and superior faculties of all beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དབང་པོ་ -ས་ མཆོག་ དང་ ། མཆོག་མ་ ལགས་པ་ ཤེས་པ་ ལ་ མཁས་པ་ །

source: They teach the Dharma in accordance with the predispositions of all beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ མོས་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཆོས་སྟོན་པ་ །

source: They teach the flawless Dharma without mistake.
bo: འཁྲུལ་པ་ མ་ མཆིས་པ་ -ར་ ཁ་ན་མ་ཐོ་ བ་མ་ མཆིས་པ་ -འི་ ཆོས་སྟོན་པ་ །

source: They are skilled in the languages and dialects of all beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སྒྲ་ དང་ སྐད་ ལ་ མཁས་པ་ །

source: They are endowed with the voices of kiṃnaras, kalaviṅka birds, and cranes and the melodious voice of Brahmā.
bo: མི་ འམ་ ཅི་ དང་ ། བྱ་ ཀ་ལ་པིང་ཀ་ དང་ ། ཁྲུང་ ཁྲུང་ གི་ སྒྲ་ དང་ ། ཚངས་པ་ -འི་ སྒྲ་དབྱངས་ ཅན་ །

source: “They establish all beings in nirvāṇa by acting as their spiritual friends.
bo: ཤིན་ཏུ་ བཤེས་གཉེན་ བགྱིས་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ ལ་ འགོད་པ་ །

source: They are motivated by great benevolence and vast compassion.
bo: བྱམས་པ་ ཆེན་པོ་ དང་ ། སྙིང་རྗེ་ ཆེན་པོ་ -འི་ ལྷག་པ་ -འི་ བསམ་པ་ ཅན་ །

source: They are stable, settled, and unwavering. They act on their words.
bo: བརྟན་ ཞིང་ ཤིན་ཏུ་ གནས་ ལ་ མི་ གཡོ་ ཞིང་ ཇི་སྐད་ སྨྲས་པ་ དེ་བཞིན་ དུ་ བགྱིད་པ་ །

source: They hoist the Dharma banner.
bo: ཆོས་ ཀྱི་ རྒྱལ་མཚན་ ཡང་དག་པ་ -ར་ བསྒྲེང་བ་ -ར་ བགྱིད་པ་ །

source: They are firm like a vajra and indestructible like the ring of mountains.
bo: རྡོ་རྗེ་ ལྟར་ སྲ་ ཞིང་ མི་ ཤིགས་པ་ -འི་ ཁོར་ཡུག་ ལྟ་བུ་ །

source: They make aspiration prayers free of any wishes.
bo: སྨོན་པ་ མ་ མཆིས་པ་ -འི་ སྨོན་ལམ་ དང་ ལྡན་པ་ །

source: They are established in profound dependent arising, which is difficult to see and comprehend.
bo: རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ ཟབ་མོ་ བལྟ་ དཀའ་ ཞིང་ རྟོགས་པ་ -ར་ དཀའ་བ་ ལ་ ཞུགས་པ་ །

source: They have cut off the two extremes of eternalism and nihilism, all views, and the karmic traces.
bo: ཆད་པ་ དང་ ། རྟག་པ་ -འི་ མཐའ་ གཉི་ག་ དང་ ། ལྟ་བ་ -ར་ གྱུར་པ་ ཐམས་ཅད་ དང་ ། བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ཡང་དག་ བཅད་པ་ །

source: They command a following that befits a great king.
bo: ཚོགས་ཅན་ ཆེན་པོ་ -འི་ ཚོགས་ ཀྱི་ རྒྱལ་པོ་ ཡོངས་སུ་ འགུགས་པ་ །

source: They are great leaders who have for countless eons accomplished merit through the Jewel of the Dharma.
bo: དེད་དཔོན་ ཆེན་པོ་ བསྐལ་པ་ གྲངས་མེད་པ་ -ར་ ཆོས་ དཀོན་མཆོག་ གིས་ བསོད་ནམས་ ཡང་དག་པ་ -ར་ བསྒྲུབས་པ་ །

source: They are great kings of physicians who cure the incorporeal disease of the afflictive emotions of all sentient beings.
bo: སྨན་པ་ -འི་ རྒྱལ་པོ་ ཆེན་པོ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉོན་མོངས་པ་ གཟུགས་ཅན་ མ་ ལགས་པ་ -འི་ ནད་གསོ་ བར་ བགྱིད་པ་ །

source: They are without fear of the resounding of the great lion’s roar, of all types nonsequential and inverted progression, and of the mystery of the Tathāgata.
bo: སེང་གེ་ -འི་ སྒྲ་ ཆེན་པོ་ སྒྲོགས་པ་ ། སྣྲེལ་ ཞི་ -འི་ རྒྱུད་ དང་ ། སྤྱིའུ་ཚུགས་ ཀྱི་ རྒྱུད་ ཐམས་ཅད་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ གསང་བ་ ལ་ མི་ སྐྲག་པ་ །

source: Their bodies will be well adorned by the excellent marks and signs.
bo: མཚན་ དང་ དཔེ་བྱད་ བཟང་པོ་ -ས་ ལུས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ །

source: They make unstinting offerings.
bo: གཏན་པ་ མེད་པ་ -འི་ མཆོད་སྦྱིན་ བགྱིད་པ་ །

source: They are courageous in every respect.
bo: ཐམས་ཅད་ ལ་ སེམས་དཔའ་བ་ །

source: They defeat the army of all afflictive emotions and the four māras.
bo: བདུད་ བཞི་ དང་ ། ཉོན་མོངས་པ་ -འི་ གཡུལ་ འདུལ་བ་ །

source: They are like ferrymen.
bo: མཉན་པ་ ལྟ་བུ་ -ར་ གྱུར་པ་ །

source: They thoroughly cultivate the spiritual faculties, the strengths, the factors of awakening, the concentrations, the liberations, and entering the absorptions.
bo: དབང་པོ་ དང་ ། སྟོབས་ དང་ ། བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། བསམ་གཏན་ དང་ ། རྣམ་པ་ -ར་ ཐར་པ་ དང་ ། ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ འཇུག་པ་ ། ཤིན་ཏུ་ ཡོངས་སུ་ སྦྱང་བ་ བགྱིས་པ་ །

source: “They exert themselves to fully liberate all sentient beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ རབ་ཏུ་ སྒྲོལ་བ་ ལ་ བརྩོན་པ་ །

source: They are like mountains.
bo: རི་ ལྟ་བུ་ -ར་ གྱུར་པ་ །

source: They turn away from the eight worldly dharmas: gain, loss, fame, ill repute, blame, praise, joy, and suffering.
bo: འཇིག་རྟེན་ གྱི་ ཆོས་ བརྒྱད་པོ་ རྙེད་པ་ དང་ ། མ་ རྙེད་པ་ དང་ ། གྲགས་པ་ དང་ ། མ་ གྲགས་པ་ དང་ ། སྨད་པ་ དང་ ། བསྟོད་པ་ དང་ ། བདེ་བ་ དང་ ། སྡུག་བསྔལ་ ལས་ལོག་པ་ །

source: They are settled in the joyous, delightful, and rapturous Dharma.
bo: དགའ་བ་ དང་ ། དང་བ་ དང་ ། མཆོག་ ཏུ་ དགའ་བ་ -འི་ ཆོས་ ལ་ སེམས་ ཞུགས་པ་ །

source: They bask in the radiance of the Jewel of the Dharma.
bo: ཆོས་ དཀོན་མཆོག་ གི་ འོད་ཟེར་ དང་ ལྡན་པ་ །

source: They achieve contentment through wisdom.
bo: ཤེས་རབ་ ཀྱིས་ ངོམས་ ནས་ ངོམས་པ་ -ར་ བགྱིད་པ་ །

source: Like a lotus, they are unstained by any conditioned phenomena.
bo: པདྨ་ ལྟ་བུ་ འདུས་བྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཀྱིས་ མི་ གོས་པ་ །

source: They have pure halos that dim the light of the moon, the sun, Śakra, and Brahmā.
bo: འོད་ ཀྱི་ དཀྱིལ་འཁོར་ རྣམ་པ་ -ར་ དག་པ་ ། ཟླ་བ་ དང་ ། ཉི་མ་ དང་ ། བརྒྱ་བྱིན་ དང་ ། ཚངས་པ་ -འི་ འོད་ མོག་མོག་པོ་ -ར་ བགྱིད་པ་ །

source: They attain the ocean mudrā absorption.
bo: རྒྱ་མཚོ་ -འི་ ཕྱག་རྒྱ་ -འི་ ཏིང་ངེ་འཛིན་ རབ་ཏུ་ ཐོབ་པ་ །

source: They engage in all aspects of the Jewel of the Dharma.
bo: ཆོས་ དཀོན་མཆོག་ ཐམས་ཅད་ ལ་ ཡང་དག་པ་ -ར་ གཞོལ་བ་ །

source: They do not interrupt the lineage of the Three Jewels.
bo: དཀོན་མཆོག་ གསུམ་ གྱི་ གདུང་ མི་ གཅོད་པ་ །

source: They mature all beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བགྱི་བ་ དང་ །

source: They perform subduing rituals.
bo: འདུལ་བ་ -འི་ ཆོ་ག་ འཚལ་བ་ །

source: They maintain the treasury of all the jewels of the Buddhadharma.
bo: སངས་རྒྱས་ ཀྱི་ ཆོས་ དཀོན་མཆོག་ ཐམས་ཅད་ ཀྱི་ མཛོད་ ཡང་དག་པ་ -ར་ འཛིན་པ་ །

source: They are limitlessly praised.
bo: བསྔགས་པ་ མཐའ་ཡས་པ་ དང་ ཡང་དག་པ་ -ར་ ལྡན་པ་ །

source: They accumulate infinite merit.
bo: བསོད་ནམས་ ཚད་མ་ མཆིས་པ་ བསགས་པ་ །

source: They approach the wisdom of omniscience, which is excellent in every respect.
bo: རྣམ་པ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ དང་ ལྡན་པ་ -འི་ ཐམས་ཅད་ མཁྱེན་པ་ -འི་ ཡེ་ཤེས་ ལ་ཉེ་ བར་ གྱུར་པ་ །

source: Such is this assembly, which could be praised until the end of time.
bo: ཕྱི་མ་ -འི་ མཐའ་ -འི་ མུ་ -འི་ བསྐལ་པ་ -ར་ བསྔགས་པ་ མཐའ་ -ར་ མི་ ཕྱིན་པ་ འདི་ ལྟ་བུ་ རྣམས་ ཀྱི་ འདུས་པ་ ལགས་སོ་ ། །

source: “This being so, Blessed One, I had the thought that you would agree to teach the Dharma discourse of the Great Assembly chapter called The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.
bo: བཅོམ་ལྡན་འདས་ དེ་ ལ་ བདག་ འདི་ སྙམ་ དུ་ ། བཅོམ་ལྡན་འདས་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ཞེས་ བགྱི་བ་ འདུས་པ་ ཆེན་པོ་ -འི་ ལེའུ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ བཤད་པ་ -ར་ བཞེད་པ་ སྙམ་ བགྱིད་ དོ་ ། །

source: “Blessed One, it is wonderful that the appearance of a present buddha benefits and appeases all sentient beings, generates the roots of virtue of future bodhisattvas, purifies the intentions of the bodhisattvas who have generated the first thought of awakening, uniquely engages bodhisattvas who have entered the bodhisattva way of life, empowers in the Buddhadharma bodhisattvas who are irreversible from awakening, does not let go to waste the causes and fruits of bodhisattvas who are kept back by one last birth, prepares conditions for sentient beings who are established on the path, causes the practice of great compassion for sentient beings who are not established on the path, and causes sentient beings who are definitely on a wrong path to be placed upon the true path. To sentient beings who aspire to the three vehicles, a buddha teaches their arrangements.
bo: བཅོམ་ལྡན་འདས་ ཇི་ཙམ་ དུ་ སངས་རྒྱས་ འབྱུང་བ་ ནི་ ཕན་ འདོགས་པ་ -ར་ འགྱུར་བ་ ། སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ འགྱུར་བ་ ། མ་འོངས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ ཡང་དག་པ་ -ར་ སྐྱེད་པ་ ། སེམས་ དང་པོ་ བསྐྱེད་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བསམ་པ་ ཡོངས་སུ་ སྦྱོང་བ་ ། སྤྱོད་པ་ ལ་ ཞུགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ གཅིག་ ལ་ འཇུག་པ་ ། ཕྱིར་ མི་ ལྡོག་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ལ་ དབང་ བསྐུར་བ་ ། སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ རྒྱུ་ དང་ འབྲས་བུ་ ཆུད་ མི་ ཟ་བ་ ། ངེས་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལ་ རྐྱེན་ ཉེ་བར་ སྒྲུབ་པ་ ། མ་ངེས་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལ་ སྙིང་རྗེ་ ཆེན་པོ་ ཉེ་བར་ སྒྲུབ་པ་ ། ལོག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལམ་ ལ་ འཛུད་པ་ ། ཐེག་པ་ གསུམ་ ལ་མོ་ -ས་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལ་ རྣམ་པ་ -ར་ དགོད་པ་ སྟོན་པ་ སྟེ་ ངོ་མཚར་ ཏོ་ ། །

source: “The appearance of a buddha is an ornament of the world of gods, humans, and asuras, because when a buddha emerges, wonderful and marvelous Dharma teachings such as this will emerge in the world!
bo: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ འབྱུང་བ་ ནི་ ལྷ་ དང་ ། མི་ དང་ ། ལྷ་མ་ ཡིན་ དུ་ བཅས་པ་ -འི་ འཇིག་རྟེན་ གྱི་ རྒྱན་ ལགས་སོ་ ། ། དེ་ ཅིའི་སླད་དུ་ ཞེ་ན་ ། བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ བྱུང་བ་ -ར་ གྱུར་ ན་ ངོ་མཚར་ རྨད་ དུ་ བྱུང་བ་ -འི་ ཆོས་ འདི་ ལྟ་བུ་ འདི་དག་ འཇིག་རྟེན་ དུ་ འབྱུང་བ་ -ར་ འགྱུར་ རོ་ ། །

source: “Blessed One, such a display of blessings through a single instance of generating the thought of awakening, in this pavilion by these noble beings, is beyond the capacity of śrāvakas and pratyekabuddhas to teach, even for a hundred thousand eons.
bo: བཅོམ་ལྡན་འདས་ སྐྱེས་བུ་ དམ་པ་ འདི་དག་ གིས་ འཁོར་ གྱི་ ཁྱམས་ འདི་ -ར་ སེམས་བསྐྱེད་པ་ གཅིག་ གིས་ བཀོད་པ་ གང་ བྱིན་ གྱིས་ བརླབས་པ་ འདི་ ནི་ ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ བསྐལ་པ་ བརྒྱ་ ཕྲག་ སྟོང་ དུ་ ཡང་ སྟོན་པ་ -འི་ རྔོ་ མི་ ཐོགས་ སོ་ ། །

source: “This being so, I had the thought that it would be utterly astonishing were any beings, even after witnessing an amazing, miraculous, magical display such as this, to aspire for the vehicle of śrāvakas or vehicle of pratyekabuddhas with misguided understanding.
bo: བཅོམ་ལྡན་འདས་ དེ་ ལ་ བདག་ འདི་ སྙམ་ བགྱིད་ དེ་ ། ཨེ་མ་ ཇི་ཙམ་ དུ་ གང་ རྫུ་འཕྲུལ་ གྱིས་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ -འི་ ཆོ་འཕྲུལ་ འདི་ ལྟ་བུ་ འདི་ མཐོང་ ཡང་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -འམ་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ རེ་བ་ སྐྱེད་པ་ -འི་ སེམས་ཅན་ ཤེས་རབ་ འཆལ་པ་ ཅན་ དེ་དག་ ནི་ ངོ་མཚར་ ཆེ་བ་ སྙམ་ བགྱིད་ དོ་ ། །

source: Why is that so?
bo: དེ་ ཅིའི་སླད་དུ་ ཞེ་ན་ །

source: Blessed One, the very first generation of the thought of awakening of a bodhisattva overpowers all śrāvakas and pratyekabuddhas.
bo: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ དང་པོ་ བསྐྱེད་པ་ ཉིད་ ཀྱིས་ ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཟིལ་ གྱིས་ ནོན་པ་ -འི་ སླད་ དུའོ་ ། །

source: When someone discards the Great Vehicle and thinks, ‘I will follow the vehicle of the śrāvakas or pratyekabuddhas,’ it is for me comparable to a person with misguided insight who discards a precious gem of beryl and thinks, ‘I prefer a semiprecious stone.’
bo: བཅོམ་ལྡན་འདས་ འདི་ལྟ་སྟེ་ ། དཔེར་ན་ ཤེས་རབ་ འཆལ་པ་ -འི་ རང་བཞིན་ ཅན་ གྱི་ མི་ལ་ ལ་ ཞིག་ ནོར་བུ་ རིན་པོ་ཆེ་ བཻ་ དཱུརྱ་ བོར་ ནས་ ནོར་བུ་ མཆིང་བུ་ ལ་ དམིགས་པ་ སྙམ་ དུ་ སེམས་པ་ དང་ ། བཅོམ་ལྡན་འདས་ གང་དག་ ཐེག་པ་ ཆེན་པོ་ བོར་ ནས་ ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ དམིགས་པ་ -ར་ བགྱི་བ་ སྙམ་ དུ་ སེམས་པ་ -འི་ སེམས་ཅན་ དག་ ནི་ འདྲ་བ་ ཉིད་ དུ་ བདག་ ལ་ གདའ་ -འོ་ ། །

source: Blessed One, those sons or daughters of noble family who have generated the thought of supreme perfect awakening with determination and all others who do so will, within a short while, attain such a teaching.”
bo: བཅོམ་ལྡན་འདས་ རིགས་ ཀྱི་ བུ་ -འམ་ ། རིགས་ ཀྱི་ བུ་མོ་ གང་དག་ ལྷག་པ་ -འི་ བསམ་པ་ -ས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ ། སྐྱེད་པ་ -ར་ འགྱུར་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ རིང་པོ་ -ར་ མི་ ཐོགས་པ་ -ར་ ཆོས་ འདི་ ལྟ་བུ་ དང་ ལྡན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: When the bodhisattva Dharmeśvara­rāja had given this account, an immensely vast number of creatures among the retinue of many different beings, including gods and humans, generated the thought of supreme perfect awakening.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ ། ལྷ་ དང་ མི་ -ར་ བཅས་པ་ -འི་ སྐྱེ་དགུ་ -འི་ འཁོར་ དེ་ལས་ སྲོག་ཆགས་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ཕྲག་ སུམ་ཅུ་ -ས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དོ་ ། །

source: This concludes the Assembly chapter “Array of Ornaments.”
bo: རྒྱན་ བཀོད་པ་ ཞེས་ བྱ་བ་ འདུས་པ་ -འི་ ལེའུ་ -འོ་ །། །།

source: After the Blessed One had surveyed the great assembly of bodhisattvas, he knew and rejoiced that the bodhisattvas who had assembled were holders of the treasure of the Tathāgata’s Dharma striving for righteousness.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ འདུས་པ་ ཆེན་པོ་ དེ་ གཟིགས་ ནས་ ། ཨེ་མ་ བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ་ འདི་དག་ ནི་ ཆོས་ དོན་ དུ་ གཉེར་བ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཆོས་ ཀྱི་ མཛོད་འཛིན་པ་ -ར་ མཁྱེན་ ནས་

source: In order for the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life to be explained, a light known as fearless eloquence, the mark of a great being, emerged from the crown of his head.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ ། སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ -འི་ ལེའུ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ རབ་ཏུ་ བཤད་པ་ -འི་ ཕྱིར་ ། མི་ འཇིགས་པ་ -ས་ སྤོབས་པ་ ཞེས་ བྱ་བ་ -འི་ འོད་ཟེར་ སྐྱེས་བུ་ ཆེན་པོ་ -འི་ མཚན་ སྤྱི་གཙུག་ ནས་ བྱུང་ ངོ་ ། །

source: As soon as this light emerged, the Blessed One caused it to encircle the entire bodhisattva assembly seven times.
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ འོད་ཟེར་ དེ་ ཕྱུང་ མ་ ཐག་ ཏུ་ དེ་ནས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ལ་ ལན་ བདུན་ བསྐོར་བ་ བྱས་ ཏེ་ །

source: He then caused it to encircle the body of the bodhisattva Dhāraṇīśvara­rāja a hundred times, after which it disappeared into the crown of the head of the bodhisattva Dhāraṇīśvara­rāja.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -འི་ ལུས་ ལ་ ལན་ བརྒྱ་ -ར་ བསྐོར་བ་ བྱས་ ནས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -འི་ སྤྱི་གཙུག་ ཏུ་ མི་སྣང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: The instant the light touched Dhāraṇīśvara­rāja, by the power of the Buddha the bodhisattva Dhāraṇīśvara­rāja eclipsed the radiance, lion thrones, and bodies of the entire bodhisattva assembly a hundred times.
bo: འོད་ དེ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ རེག་ མ་ ཐག་ ཏུ་ ། དེ་ནས་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ཀྱི་ འོད་ དང་ ། སེང་གེ་ -འི་ ཁྲི་ དང་ ། ལུས་ བརྒྱ་ འགྱུར་ དུ་ ཟིལ་ གྱིས་ མནན་ ནས་

source: He was brilliant, majestic, and resplendent.
bo: ལམ་ མེ་ ། ལྷང་ངེ་ ། ལྷན་ནེ་ -འོ་ ། །

source: At this point, the bodhisattva Dhāraṇīśvara­rāja became aware of the blessing of the Tathāgata and rose from his seat.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བྱིན་ གྱི་ རླབས་ རིག་ ནས་ སྟན་ ལས་ ལངས་ ཏེ་ །

source: He draped his upper garment over one shoulder and placed his right knee on the ground.
bo: བླ་གོས་ ཕྲག་པ་ གཅིག་ ལ་ གཟར་ ནས་ པུས་མོ་ གཡས་པ་ -འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ་ །

source: He proceeded to bow, with his palms joined, in the direction of the Blessed One and conjure up a precious parasol known as ornament of the Tathāgata in the space directly above the crown of the Blessed One’s head.
bo: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ དབུ་ -འི་ གཙུག་ གི་ དྲང་ཐད་ ཀྱི་ སྟེང་ གི་ བར་སྣང་ ལ་ རིན་པོ་ཆེ་ -འི་ གདུགས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ རྒྱན་ ཅེས་བྱ་བ་

source: With a handle of lapis, a cover of gold, a jeweled parrot at the center, and spokes of precious sapphire, it had garlands of pearls hanging down as pendants and was decorated with tassels of divine silk.
bo: ཡུ་བ་ ནི་ བཻ་ དཱུརྱ་ ། གཡོགས་མ་ ནི་ གསེར་ ། སྙིང་པོ་ ནི་ རིན་པོ་ཆེ་ ནེ་ ཚོ་ འམ་ ཅི་ ། རྩིབས་ ནི་ ཨན་ ད་ རྙིལ་ ལས་ བྱས་པ་ ། མུ་ཏིག་ གི་ དོ་ཤལ་ རབ་ཏུ་ སྤྱངས་པ་ ། དར་ གྱི་ ལྡ་ལྡི་ -ས་ མཛེས་པ་ -ར་ བྱས་པ་ །

source: It resounded with filigrees of chimes, was upheld by the bodies of bodhisattvas, and was as vast as the trichiliocosm.
bo: དྲིལ་བུ་ གཡེར་ ཀ་ -འི་ དྲ་བ་ འཁྲོལ་བ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལུས་ ཀྱིས་ བཟུང་བ་ ། རྒྱ་ -ར་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ ཚད་ ཙམ་ ཞིག་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: After he had conjured up such a precious parasol as an act of worshiping the Tathāgata, Dhāraṇīśvara­rāja brought down a rain of flowers.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ རིན་པོ་ཆེ་ -འི་ གདུགས་ དེ་ལྟ་ བུ་ བྱིན་ གྱིས་ བརླབས་ ནས་ མེ་ཏོག་ གི་ ཆ་ -ར་ ཡང་ ཕབ་ སྟེ་ །
