Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: The Noble Great Vehicle Sūtra The Teaching on the Great Compassion of the Tathāgata
bo: འཕགས་པ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ ངེས་པར་ བསྟན་པ་ ཞེས་ བྱ་བ་ ཐེག་པ་ ཆེན་པོ་ -འི་ མདོ་ །

source: Homage to all buddhas and bodhisattvas.
bo: སངས་རྒྱས་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Thus did I hear at one time.
bo: འདི་སྐད་ བདག་ གིས་ ཐོས་པ་ -འི་ དུས་ གཅིག་ ན་ །

source: The Blessed One was dwelling on Vulture Peak, near Rājagṛha, a sacred site blessed by tathāgatas, a great stūpa where previous victors dwelled.
bo: བཅོམ་ལྡན་འདས་ རྒྱལ་པོ་ -འི་ ཁབ་ ན་ བྱ་རྒོད་ ཀྱི་ ཕུང་པོ་ -འི་ རི་ ། སྔོན་ རྒྱལ་བ་ བཞུགས་ བཞུགས་པ་ -འི་ མཆོད་རྟེན་ ཆེན་པོ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ བརླབས་པ་ ས་ -འི་ སྙིང་པོ་ །

source: It is a Dharma seat praised by bodhisattvas and a place worshiped by gods, nāgas, yakṣas, gandharvas, and asuras that inspires toward roots of virtue.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -ས་ མངོན་པར་ བསྟོད་པ་ ། ཆོས་ ཀྱི་ གདན་ ལྷ་ དང་ ། ཀླུ་ དང་ ། གནོད་སྦྱིན་ དང་ ། དྲི་ཟ་ དང་ ། ལྷ་མ་ ཡིན་ གྱིས་ ཕྱག་ བྱས་པ་ -འི་ ས་ཕྱོགས་ ། དགེ་བ་ -འི་ རྩ་བ་ ཡང་དག་པ་ -ར་ སྐུལ་བ་ །

source: It is a site where tathāgatas appear and where gateways to the Dharma are promulgated, where bodhisattvas appear and where infinite qualities spring forth.
bo: དེ་བཞིན་ གཤེགས་པ་ འབྱུང་བ་ ཆོས་ ཀྱི་ སྒོ་ མངོན་པར་ བརྗོད་པ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འབྱུང་བ་ ། ཡོན་ཏན་ ཚད་ མེད་པ་ ལས་ ཡང་དག་པ་ -ར་ བྱུང་བ་ །

source: In the tathāgata domain, the Blessed One had fully realized the sameness of all phenomena.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱོད་ཡུལ་ ན་ ། བཅོམ་ལྡན་འདས་ ཆོས་ ཐམས་ཅད་ ཀྱི་ མཉམ་པ་ཉིད་ ནི་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ །

source: He had turned the wheel of the Dharma and now commanded a vast host of well-trained disciples.
bo: ཆོས་ ཀྱི་ འཁོར་ལོ་ ནི་ ཤིན་ཏུ་ བསྐོར་ ། སློབ་མ་ ཤིན་ཏུ་ དུལ་བ་ མཐའ་ཡས་པ་ -འི་ ཚོགས་ ནི་ མངའ་ །

source: He had achieved mastery over all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ལ་ མངའ་དབང་ ནི་ བརྙེས་ །

source: He knew well how to fulfill the intentions of all beings, he had discovered how to bring their faculties to the highest perfection, and he had become skillful in terminating their karmic traces.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ སྒྲུབ་པ་ ནི་ ལེགས་པ་ -ར་ མཁྱེན་ ། དབང་པོ་ དམ་པ་ -འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ བརྙེས་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ལེགས་པ་ -ར་ འཇོམས་པ་ ལ་ ནི་ མཁས་ །

source: In his spontaneous and uninterrupted buddha activity, he resided in the company of a large saṅgha of sixty thousand monks.
bo: སངས་རྒྱས་ ཀྱི་ མཛད་པ་ ལྷུན་ གྱིས་ གྲུབ་པ་ ནི་ རྒྱུན་ མི་ འཆད་ ཅིང་ དགེ་སློང་ སྟོང་ཕྲག་ དྲུག་ཅུ་ -འི་ དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ དང་ ཐབས་ཅིག་ ཏུ་ བཞུགས་ ཏེ་ །

source: All of these monks were of noble lineage, mighty elephants who had done their duties and performed their tasks. They had laid down the burden of existence and attained their own goals for themselves. They had brought their entanglement in existence to an end.
bo: ཐམས་ཅད་ ཀྱང་ ཅང་ཤེས་པ་ ། གླང་པོ་ ཆེན་པོ་ ། བྱ་བ་ བྱས་པ་ ། བྱེད་པ་ བྱས་པ་ ། ཁུར་ བོར་བ་ ། བདག་ གི་ དོན་ རྗེས་སུ་ ཐོབ་པ་ ། སྲིད་པ་ -ར་ ཀུན་ ཏུ་ སྦྱོར་བ་ ཡོངས་སུ་ ཟད་པ་ །

source: Their minds were liberated through perfect knowledge and insight, and they had brought the karmic traces of afflictive emotions to an end.
bo: ཡང་དག་པ་ -འི་ ཤེས་པ་ -ས་ སེམས་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ ། ཤེས་རབ་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ ། ཉོན་མོངས་པ་ -འི་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་པ་ །

source: These sons of the Dharma king, the Tathāgata, were skillfully established in the profound Dharma.
bo: དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ རྒྱལ་པོ་ -འི་ སྲས་ ། ཆོས་ ཟབ་མོ་ ལ་ གནས་པ་ -ར་ མཁས་པ་ །

source: They were emancipated through the teaching on non-objectification.
bo: དམིགས་པ་ མེད་པ་ -འི་ ཆོས་ ཀྱིས་ ངེས་པར་ བྱུང་བ་ །

source: They had exquisite and elegant comportments, were great objects of veneration, and were fully grounded in the tathāgata word.
bo: སྤྱོད་ལམ་ མཛེས་པ་ ཕུན་སུམ་ ཚོགས་པ་ ། སྦྱིན་པ་ -འི་ གནས་ཆེན་པོ་ -ར་ གྱུར་པ་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ བཀའ་ ལ་ ཤིན་ཏུ་ ཞུགས་པ་ ཤ་སྟག་ གོ་ ། །

source: Furthermore, the Blessed One resided in the company of a vast saṅgha of bodhisattvas.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ དགེ་འདུན་ དཔག་ ཏུ་ མེད་པ་ དང་ ཡང་ ཐབས་ཅིག་ སྟེ་ །

source: These bodhisattva mahāsattvas were all-knowing and had achieved perfection through dispassionate conduct.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཐམས་ཅད་ མཁྱེན་པ་ ཆགས་པ་ མེད་པ་ -འི་ སྤྱོད་ཡུལ་ གྱིས་ ངེས་པར་ བྱུང་བ་ །

source: From a Dharma cloud of great benevolence and vast compassion, these bodhisattvas sent forth the lightning of special insight, knowledge, and liberation and rained down showers of divine nectar, through which they pleased all beings.
bo: བྱམས་པ་ ཆེན་པོ་ དང་ ། སྙིང་རྗེ་ ཆེན་པོ་ -འི་ ཆོས་ ཀྱི་ སྤྲིན་ ལས་ ལྷག་མཐོང་ དང་ ། རིག་པ་ དང་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ གློག་ ཕྱུང་ ཞིང་ བདུད་རྩི་ -འི་ ཆུ་ -འི་ རྒྱུན་ གྱི་ ཆ་ -ར་ འབེབས་པ་ -ས་ འགྲོ་བ་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ །

source: With a disposition that encompasses everyone, like the earth, they felt affection for all sentient beings and lacked hostility.
bo: སེམས་ཅན་ ཐམས་ཅད་ ལ་ སེམས་ ས་ དང་ མཉམ་པ་ རྗེས་སུ་ ཆགས་པ་ དང་ ། ཁོང་ཁྲོ་བ་ དང་ བྲལ་བ་ །

source: They increased the crops of the diverse factors of awakening.
bo: བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ སྣ་ཚོགས་ ཀྱི་ ལོ་ཐོག་ ཡང་དག་པ་ -ར་ འཕེལ་བ་ -ར་ བྱེད་པ་ །

source: By sending out rays of insight brighter than the sun, they revealed that they had achieved the path of clearing away the darkness of ignorance.
bo: ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ བས་ ལྷག་པ་ -འི་ ཤེས་རབ་ ཀྱི་ འོད་ཟེར་ རབ་ཏུ་ གཏོང་བ་ -ས་ གཏི་མུག་ གི་ མུན་པ་ སེལ་བ་ -འི་ ལམ་ གྱི་ སྣང་བ་ ཐོབ་པ་ ཀུན་ ཏུ་ སྟོན་པ་ དང་ །

source: They opened sentient beings like lotus flowers, brought the roots of virtue to maturity, and dried up the rivers of craving.
bo: སེམས་ཅན་ གྱི་ པད་མ་ ཁ་ འབྱེད་པ་ དང་ ། དགེ་བ་ -འི་ རྩ་བ་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ དང་ ། སྲེད་པ་ -འི་ ཆུ་ སྐེམས་པ་ དང་ །

source: Focused on the task of knowledge, they were driven by the mighty higher knowledges and tranquil abiding.
bo: ཤེས་པ་ -འི་ ལས་ ཀྱི་ མཐའ་ ལ་ རབ་ཏུ་ འཇོག་པ་ ལ་ མངོན་པར་ ཤེས་པ་ ཆེན་པོ་ དང་ ། ཞི་གནས་ ཀྱིས་ རྒྱུ་བ་ །

source: Like the moon, they displayed a waxing and waning in brightness, since their disposition embraced all beings, and they were skilled in the means to pacify and appease them;
bo: ཟླ་བ་ ལྟ་བུ་ -ར་ འགྲོ་བ་ ཐམས་ཅད་ ལ་ སེམས་ མཉམ་པ་ -ས་ མངོན་པར་ ཞི་བ་ -ར་ བྱ་བ་ -འི་ བསམ་པ་ ཚིམ་པ་ -ར་ བྱ་བ་ -འི་ ཐབས་ ལ་ མཁས་པ་ -ས་ འགྲིབ་པ་ དང་ འཕེལ་བ་ ཀུན་ ཏུ་ སྟོན་པ་ །

source: with their noble intentions like Mount Meru, the jewels of the Brahmā abodes were firmly established.
bo: རི་རབ་ ལྟ་བུ་ -འི་ ལྷག་པ་ -འི་ བསམ་པ་ -ས་ ཚངས་པ་ -འི་ གནས་པ་ -འི་ རིན་པོ་ཆེ་ ཤིན་ཏུ་ བརྟན་ ཏེ

source: They illuminated and displayed all buddhafields, which were superior in quality to our world and never buffeted by gusts of wind from any of the four directions.
bo: ངོས་ བཞི་ ནས་ ཡུལ་ གྱི་ རླུང་ ཐམས་ཅད་ ཀྱིས་ མི་ སྒུལ་ ཅིང་ འཇིག་རྟེན་ གྱི་ ཆོས་ ལས་ མངོན་པར་ འཕགས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ ཀུན་ ཏུ་ བསྟན་པ་ སྣང་བ་ -ར་ གྱུར་པ་ །

source: Like a great ocean, they were vast containers of retention and mindfulness, filled with the water of Dharma, and their precious bodhisattva conduct nourished all beings.
bo: རྒྱ་མཚོ་ ཆེན་པོ་ ལྟར་ གཟུངས་ དང་ དྲན་པ་ -འི་ སྣོད་ རྒྱ་ཆེན་པོ་ ཆོས་ ཀྱི་ ཆུས་ ཡོངས་སུ་ གང་བ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ རིན་པོ་ཆེ་ -ས་ འགྲོ་བ་ ཐམས་ཅད་ ཉེ་བར་ འཚོ་བ་ །

source: Like the king of beasts, they had the legs of truth, a full tail of loving kindness, and eyes of tranquil abiding and special insight, and, since they were unintimidated by the profound Dharma, they subdued all adversaries.
bo: རི་ དགའ་ -ས་ ཀྱི་ རྒྱལ་པོ་ ལྟར་ བདེན་པ་ -འི་ རྐང་པ་ དང་ ། བྱམས་པ་ རབ་ཏུ་ འཕེལ་བ་ -འི་ མཇུག་མ་ དང་ ། ཞི་གནས་ དང་ ལྷག་མཐོང་ གི་ མིག་ དང་ ལྡན་ ཞིང་ ཆོས་ ཟབ་མོ་ ལ་ སྐྲག་པ་ མེད་པ་ -ས་ ཕ་རོལ་ རྒོལ་བ་ ཐམས་ཅད་ འཇོམས་པ་ །

source: Their bodhisattva conduct remained undisrupted for countless eons, so they were endowed with all qualities.
bo: བསྐལ་པ་ བརྒྱ་ སྟོང་ཕྲག་ དཔག་ ཏུ་ མེད་ ཅིང་ མཐའ་ ཡས་ ཐུག་པ་ མེད་པ་ -ར་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ རྒྱུན་ མ་ བཅད་པ་ -ས་ ཡོན་ཏན་ ཐམས་ཅད་ དང་ ལྡན་པ་ ཤ་སྟག་ དང་ ཐབས་ཅིག་པ་ ལ་ འདི་ལྟ་སྟེ་ །

source: including the bodhisattva mahāsattva All-Illumining and Unobstructed Gaze,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཀུན་ ནས་ སྣང་ ཞིང་ སྒྲིབ་པ་ མེད་པ་ -ར་ ལྟ་བ་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva All-Revealing Continuous Display of All Buddhafields,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཞིང་ ཐམས་ཅད་ ཀྱི་ རྒྱུན་ བཀོད་པ་ ཀུན་ ཏུ་ སྟོན་པ་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva Intelligence in Conduct Stemming from the Tathāgata Lineage,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ རིགས་ ལས་ བྱུང་བ་ -འི་ སྤྱོད་པ་ -འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva All-Revealing Unperturbed Subjugation through All Conduct,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྤྱོད་ལམ་ ཐམས་ཅད་ ཀྱིས་ འདུལ་བ་ མི་ འཁྲུགས་པ་ ཀུན་ ཏུ་ སྟོན་པ་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva Topping the Victory Banner of Endless Courage with Miraculous Melodies,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྤོབས་པ་ མཐའ་ཡས་པ་ -འི་ ཏོག་ གི་ རྒྱལ་མཚན་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ -འི་ དབྱངས་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva Brilliant Light Rays of the Collection of Fine Gold,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གསེར་ བཟང་པོ་ རྣམ་པ་ -ར་ བསགས་པ་ -འི་ འོད་ ཀྱི་ གཟི་བརྗིད་ ཀྱི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ དང་ །

source: the bodhisattva mahāsattva Eloquence in Language via Insight,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཤེས་རབ་ ཀྱིས་ རྣམ་པ་ -ར་ ངེས་པ་ -འི་ ཚིག་ ལ་ སྤོབས་པ་ ཞེས་ བྱ་བ་ དང་ །

source: and the bodhisattva mahāsattva Gathering of Stable and Immeasurable Merit and Insight.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསོད་ནམས་ དང་ ཡེ་ཤེས་ ཀྱི་ ཚོགས་ དཔག་ ཏུ་ མེད་པ་ -ས་ བརྟན་པ་ -ས་ བསགས་པ་ ཞེས་ བྱ་བ་ དང་ །

source: Thus the Blessed One dwelled in the company of countless bodhisattva mahāsattvas
bo: དེ་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ དང་ ཐབས་ཅིག་ གོ་ ། །

source: The Blessed One proceeded to teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འདུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་པ་ -ར་ རབ་ཏུ་ སྟོན་ ཏོ་ ། །

source: Sixteen years had passed since the Blessed One had become fully awakened, and he knew that the sacred conduct had unfolded.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ནས་ ལོ་ བཅུ་དྲུག་ བཞེས་ ཏེ་ ། ཚངས་པ་ -ར་ སྤྱོད་པ་ རྒྱས་པ་ -ར་ གྱུར་པ་ -ར་ མཁྱེན་ །

source: He beheld the great assembly of bodhisattvas.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ་ ཆེན་པོ་ དེ་ཡང་ གཟིགས་ ཤིང་ མཁྱེན་ ཏེ་ །

source: Once he had understood these assembled bodhisattvas to be holders of the treasury of tathāgata Dharma, he thought,
bo: ཀྱེ་མ་ བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ་ འདི་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཆོས་ ཀྱི་ མཛོད་འཛིན་པ་ -ར་ མཁྱེན་ ནས་ འདི་ སྙམ་ དུ་

source: “Because I care deeply for the bodhisattvas, I shall teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life, drawing on the magic and miraculous displays of tathāgatas, in order to lead the bodhisattva mahāsattvas to the domain of the Tathāgata.”
bo: གང་ གི་ ཕྱིར་ ངས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱ་ ཆེ་ -ར་ རྗེས་སུ་ ཡོངས་སུ་ གཟུང་བ་ དང་ ། འདི་ལྟ་སྟེ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡུལ་ ལ་ གཟུད་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ཆེན་པོ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ ཆོ་འཕྲུལ་ ཆེན་པོ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་པ་ -ར་ བསྟན་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ དགོངས་ སོ་ ། །

source: Then the Blessed One attained the tathāgata absorption called display of the emanation of the buddha domain exactly as it is.
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ སངས་རྒྱས་ ཀྱི་ ཡུལ་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཡང་དག་པ་ -ར་ སྟོན་པ་ ཞེས་ བྱ་བ་ ལ་ སྙོམས་པར་ ཞུགས་ སོ་ ། །

source: As soon as he had attained that absorption, by his buddha power a pavilion, a veritable buddha abode, appeared in the atmosphere between the desire realm and the form realm. This occurred due to the roots of virtue of the Tathāgata.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ སངས་རྒྱས་ ཀྱི་ ཡུལ་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཡང་དག་པ་ -ར་ སྟོན་པ་ ཞེས་ བྱ་བ་ དེ་ ལ་ སྙོམས་པར་ ཞུགས་ མ་ ཐག་ ཏུ་ དེ་ནས་ དེ་ -འི་ ཚེ་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ སྟེང་ གི་ བར་སྣང་ ལ་ འདོད་པ་ -འི་ ཁམས་ དང་ ། གཟུགས་ ཀྱི་ ཁམས་ ཀྱི་ བར་ དུ་ འཁོར་ གྱི་ ཁྱམས་ ། སངས་རྒྱས་ ཀྱི་ གནས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དགེ་བ་ -འི་ རྩ་བ་ -ས་ མངོན་པར་ གྲུབ་པ་ །

source: It purified the thinking of bodhisattvas, illuminated the realms of the worlds of the ten directions, fulfilled the aspirations of countless sentient beings, eclipsed the palaces of the gods, and inspired bodhisattvas everywhere.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསམ་པ་ ཡོངས་སུ་ སྦྱོང་བ་ ། ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ -ར་ བྱེད་པ་ ། སེམས་ཅན་ ཚད་ མེད་པ་ -འི་ བསམ་པ་ ཚིམ་པ་ -ར་ བྱེད་པ་ ། ལྷ་ -འི་ གཞལ་མེད་ ཁང་ ཐམས་ཅད་ ཟིལ་ གྱིས་ གནོན་པ་ ། ཕྱོགས་ བཅུ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡང་དག་པ་ -ར་ སྐུལ་བ་ །

source: This pavilion had a foundation shaped like a white beryl.
bo: གཞི་ བཻ་ དཱུརྱ་ དཀར་པོ་ -འི་ དབྱིབས་ དང་ །

source: It comprised mansions made of gold extracted from the Jambu River, archways of red gems, portals of emeralds, terraces constructed of jewels, and altars crafted from radiant gems.
bo: འཛམ་བུ་ -འི་ གླིང་ གི་ གསེར་ གྱི་ ཁང་པ་ དག་ དང་ ། དཔལ་ གྱི་ སྙིང་པོ་ -འི་ རྟ་བབས་ དག་ དང་ ། རིན་པོ་ཆེ་ རྡོ་ -འི་ སྙིང་པོ་ -འི་ སྒོ་ཁང་ དག་ དང་ ། ནོར་བུ་ རིན་པོ་ཆེ་ སྙིང་པོ་ -འི་ ཁ་ཁྱེར་ དག་ དང་ ། རིན་པོ་ཆེ་ དྲི་མ་ མེད་པ་ -འི་ འོད་ ཀྱི་ སྟེགས་བུ་ དག་ དང་ །

source: Its upper stories consisted of brightly glowing precious stones with coverings of all kinds of jewels and adorned with dangling pearl rosaries, parasols, victory banners, raised standards, and fluttering silk tassels. It was praised and as vast as the extent of the trichiliocosm.
bo: རིན་པོ་ཆེ་ ཀུན་ ནས་ འོད་ ཀྱི་ ཁང་པ་ བརྩེགས་པ་ དག་ དང་ ། རིན་པོ་ཆེ་ ཐམས་ཅད་ ཀྱིས་ དགབ་པ་ དང་ ། མུ་ཏིག་ གི་ རྒྱན་ ཕྲེང་ རབ་ཏུ་ སྤྱངས་པ་ དང་ ། གདུགས་ དང་ ། རྒྱལ་མཚན་ དང་ ། བ་དན་ སྒྲེང་བ་ དང་ ། ལྷ་ -འི་ དར་ གྱི་ ལྡ་ལྡི་ མངོན་པར་ སྤྱངས་པ་ -ས་ བསྔགས་པ་ བསྟན་པ་ དཔག་ ཏུ་ མེད་ ཅིང་ ཐུག་པ་ མེད་པ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ ཚད་ ཙམ་ ཞིག་ བྱུང་ སྟེ

source: The pavilion was anointed with rare and precious sandalwood.
bo: འཁོར་ གྱི་ ཁྱམས་ དེ་ཡང་ ཙན་དན་ སྦྲུལ་ གྱི་ སྙིང་པོ་ -ས་ བསྐུས་པ་ །

source: It was perfumed with the enchanting fragrance of superior sandalwood. It was scented by the noble essence of aloeswood, the best of fragrances.
bo: ཙན་དན་ དུས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འི་ དྲི་ ཡིད་ དུ་ འོང་བ་ དང་ ལྡན་པ་ ། དྲི་ -འི་ མཆོག་ ཨ་ ག་ རུ་ དམ་པ་ -འི་ སྙིང་པོ་ -ས་ བདུགས་པ་ །

source: It was strewn with precious flowers and nāga pearls.
bo: ཀླུ་ -འི་ མུ་ཏིག་ དང་ རིན་པོ་ཆེ་ -འི་ མེ་ཏོག་ གིས་ རྣམ་པ་ -ར་ སྤྲས་པ་ །

source: It was adorned with flower arrangements of scattered flower petals, fine trees, and gorgeous ornaments.
bo: མེ་ཏོག་སིལ་མ་ བཀྲམ་པ་ ། རིན་པོ་ཆེ་ -འི་ ཤིང་ དང་ ། རིན་པོ་ཆེ་ -འི་ མཁའ་ རྟེན་ གྱིས་ མཛེས་པ་ -ར་ བྱས་པ་ སྟེ་ །

source: The pavilion was everywhere aglitter with variegated arrangements of beautiful ornaments, as many as exist in all the world systems.
bo: ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ན་ རྒྱན་ མཛེས་པ་ བཀོད་པ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ འཁོར་ གྱི་ ཁྱམས་ དེ་ཉིད་ ན་ ཀུན་ ཏུ་ སྣང་ངོ་ ། །

source: It also featured many strikingly beautiful lion thrones—many tens of billions, countless, of all different kinds, alluring, lofty, superb, broad, and immense.
bo: དེ་ -ར་ གདན་ སེང་གེ་ -འི་ ཁྲི་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ཕྲག་ མང་པོ་ དཔག་ ཏུ་ མེད་པ་ ། གྲངས་མེད་པ་ ། སྣ་ཚོགས་པ་ ། བལྟ་ ན་ སྡུག་པ་ ། མཐོ་བ་ ། རབ་ཏུ་ བཟང་བ་ ། ཡངས་པ་ ། རྒྱ་ཆེ་བ་ ། ཡིད་ དུ་ འོང་བ་ ། ཡིད་ དགའ་བ་ -ར་ བྱེད་པ་ དག་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: In this world system appeared four thousand staircases framed by terraces the height of seven men and half a mile across.
bo: གླིང་བཞི་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ -ར་ ཐེམ་སྐས་ ཁ་ཁྱེར་ མི་ བདུན་ གྱི་ འཕང་ ཙམ་ གྱིས་ བསྐོར་བ་ ། རྒྱ་ -ར་ དཔག་ཚད་ ཕྱེད་ ཀྱིས་ ཡོངས་སུ་ བཟུང་བ་ །

source: They were fashioned from precious sapphire and deep blue sapphire and adorned with canopies of all other manner of gems.
bo: རིན་པོ་ཆེ་ ཨན་ ད་ རྙིལ་ དང་ ། མཐོན་ ཁ་ ཆེན་པོ་ -ས་ སྙིང་པོ་ -ར་ གྱུར་པ་ ། བརྒྱ་བྱིན་ ཐོགས་པ་ -འི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ -འི་ གདུགས་ ཅན་ ། ཚངས་པ་ -འི་ ནེ་ཙོ་ འམ་ ཅི་ དང་ །

source: They were festooned with golden jewels and other precious stones and enveloped by the sound of filigrees of chimes.
bo: རིན་པོ་ཆེ་ སེར་པོ་ -ས་ སྤྲས་པ་ ། རིན་པོ་ཆེ་ -འི་ དྲིལ་བུ་ གཡེར་ཁ་ -འི་ དྲ་བ་ ཀུན་ ཏུ་ བསྐྱོད་པ་ -ས་ སྒྲ་ འབྱུང་བ་ །

source: These stairways soared from the ground level all the way up to the pavilion. They were straight and steady.
bo: ས་ -འི་ སྟེང་ ནས་ འཁོར་ གྱི་ ཁྱམས་ ལ་ ཐུག་ གི་ བར་ དུ་ གྱེན་ དུ་ མངོན་པར་ འཕགས་པ་ ། དྲང་བ་ མ་ ཡོ་བ་ བཞི་ སྟོང་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: Just as in this world system, such great staircases rose in all the world systems of the trichiliocosm.
bo: གླིང་བཞི་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ -ར་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ཀྱི་ གླིང་བཞི་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ ཡང་ དེ་ལྟ་ བུ་ -འི་ ཐེམ་སྐས་ ཆེན་པོ་ དག་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: At this point the Blessed One mindfully and deliberately emerged from that state of meditative absorption.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ དགོངས་ ཤིང་ མཁྱེན་ བཞིན་ དུ་ ཏིང་ངེ་འཛིན་ དེ་ལས་ བཞེངས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: As soon as he did, the world systems of the trichiliocosm trembled six times and were brightly illuminated.
bo: བཅོམ་ལྡན་འདས་ ཏིང་ངེ་འཛིན་ དེ་ལས་ བཞེངས་ མ་ ཐག་ ཏུ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་ ཏེ་ ། སྣང་བ་ ཆེན་པོ་ ཡང་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: Then the Blessed One was together with a host of bodhisattvas and a host of śrāvakas, the host of bodhisattvas surrounding him and the host of śrāvakas in front of and behind him.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ དང་ ཐབས་ཅིག་ ། ཉན་ཐོས་ ཀྱི་ ཚོགས་ དང་ ཐབས་ཅིག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ ཉན་ཐོས་ ཀྱི་ ཚོགས་ ཀྱིས་ མདུན་ དུ་ བདར་ ཏེ་ །

source: Gods and nāgas praised him and caused a great rain of flower petals.
bo: ལྷ་ དང་ ཀླུ་ -ས་ མངོན་པར་ བསྟོད་ ཅིང་ མེ་ཏོག་ གི་ ཆ་ -ར་ ཆེན་པོ་ ནི་ འབེབས་ །

source: They bestowed many garments on him and caused a great rain of copious powders, perfumes, and lotions, all to the sound of cymbals and various melodies.
bo: ན་བཟའ་ -འི་ ཆ་ -ར་ ཆེན་པོ་ -ས་ ནི་ མངོན་པར་ འགེབས་ ། ཕྱེ་མ་ དང་ ། ། སྤོས་ དང་ ། བྱུག་པ་ -འི་ ཆ་ -ར་ ཆེན་པོ་ ནི་ འཐོར་ ། སིལ་སྙན་ དང་ ། སྒྲ་དབྱངས་ ཆེན་པོ་ ནི་ རབ་ཏུ་ སྒྲོགས་ །

source: The entire universe shook and lit up brightly.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དཔག་ ཏུ་ མེད་པ་ ནི་ རབ་ཏུ་གཡོ་ བར་ མཛད་ །

source: Thereupon the whole assembly departed from Vulture Peak through the might of the Buddha: his miraculous powers, miraculous displays, great leadership, blessing, splendor, benediction, and magical abilities.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ནི་ སྣང་བ་ -ར་ མཛད་ ཅིང་ སངས་རྒྱས་ ཀྱི་ མཐུ་ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ རྫུ་འཕྲུལ་ ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཆོ་འཕྲུལ་ ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཁྱུ་མཆོག་ ཏུ་ གྱུར་པ་ ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ བྱིན་ གྱི་ རླབས་ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ གཟི་བརྗིད་ ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ བྱིན་ ཆེན་པོ་ དང་ ། སངས་རྒྱས་ ཀྱི་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ཆེན་པོ་ -ས་ བྱ་རྒོད་ ཀྱི་ ཕུང་པོ་ -འི་ རི་ ལས་མི་ སྣང་བ་ -ར་ གྱུར་ ཏེ

source: Many tens of millions of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas followed in order to attend the Buddha, ascending the central jewel-encrusted staircase leading to the pavilion.
bo: ལྷ་ དང་ ། ཀླུ་ དང་ ། གནོད་སྦྱིན་ དང་ ། དྲི་ཟ་ དང་ ། ལྷ་མ་ ཡིན་ དང་ ། ནམ་མཁའ་ ལྡིང་ དང་ ། མི་ འམ་ ཅི་ དང་ ། ལྟོ་འཕྱེ་ ཆེན་པོ་ བྱེ་བ་ ཕྲག་ དུ་མ་ ཞབས་འབྲིང་ དུ་ འབྲང་ ཞིང་ ནོར་བུ་ རིན་པོ་ཆེ་ སྣ་ཚོགས་ ཀྱི་ ཐེམ་སྐས་ ཀྱི་ དབུས་ ནས་ འཁོར་ གྱི་ ཁྱམས་ བཀོད་པ་ ག་ལ་བ་ དེ་ -ར་ གཤེགས་ སོ་ ། །

source: Aware that the Blessed One had proceeded to the staircase, the Catur­mahā­rājakāyika gods, such as the Catur­mahā­rājas, showered clouds of divine flower petals on him in worship.
bo: དེ་ནས་ རྒྱལ་པོ་ ཆེན་པོ་ བཞི་ ལ་སོགས་པ་ རྒྱལ་ཆེན་ བཞི་ -འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ -ར་ རིག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ མེ་ཏོག་ གི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ་

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་པ་ །

source: “The light of the sun, the moon, fire, and jewels, and the immaculate divine light of the heavenly realms, are all outshone by the light of the Capable One, which pacifies the three lower destinies.
bo: ཉི་ཟླ་ མེ་ དང་ ནོར་བུ་ -འི་ འོད་ དང་ ལྷ་ཡུལ་པ་ ཡི་ ལྷ་ འོད་ ཤིན་ཏུ་ དྲི་མེད་པ་ ། ། ཐུབ་པ་ -ས་ འོད་ ཀྱིས་ ཐམས་ཅད་ ཟིལ་ གྱིས་ མནན་ ནས་ ངན་སོང་ གསུམ་པོ་ དག་ ཀྱང་ ཞི་བ་ -ར་ མཛད་ ། །

source: This light razes Mount Meru and the surrounding peaks, and it illuminates the buddhafields.
bo: རི་བོ་ ལྷུན་པོ་ དང་ ནི་ ཁོ་ར་ ཁོར་ཡུག་ རྩེ་མོ་ བསྙིལ་ ཏེ་ ཞིང་ རྣམས་ གསལ་བ་ -ར་ གྱུར་པ་ -ས་ ན་ ། །

source: Therefore, we joyously take refuge in the Victor who has accomplished all aims.”
bo: དགའ་ ཞིང་ ཡིད་ རྣམས་ མགུ་ ནས་ དོན་ རྣམས་ ཐམས་ཅད་ གྲུབ་པ་ -འི་ རྒྱལ་བ་ ལ་ ནི་ སྐྱབས་ སུ་ མཆི་ ། །

source: After the Catur­mahā­rājakāyika gods had praised the Blessed One with this verse, they joined the procession to attend to him.
bo: དེ་ནས་ རྒྱལ་ཆེན་ བཞི་ -འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ གཤེགས་པ་ -འི་ ཞབས་འབྲིང་ དུ་ འབྲང་ ངོ་ ། །

source: At this point, the gods of Trāyastriṃśa, such as Śakra, the lord of the gods, became aware that the Blessed One had proceeded to the staircase, and they showered clouds of divine perfume on him in worship.
bo: དེ་ནས་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ལ་སོགས་པ་ སུམ་ཅུ་རྩ་གསུམ་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ -ར་ རིག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ སྤོས་ ཀྱི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་པ་ །

source: “You attained the most excellent miraculous powers and display unrivaled emanations.
bo: རྫུ་འཕྲུལ་ དམ་པ་ བརྙེས་ ཤིང་ རབ་ཏུ་ མཚུངས་པ་ མེད་པ་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ཤིན་ཏུ་ སྟོན་ ། །

source: You rose like the supreme sun pervading vast numbers of buddhafields.
bo: རྒྱལ་བ་ ཉི་མ་ ཇི་བཞིན་ འཕགས་ ཏེ་ ཞིང་ རྣམས་ བྱེ་བ་ བརྒྱ་ དག་ ཏུ་ ཡང་ རབ་ཏུ་ གདའ་ ། །

source: The Buddha adorns all buddhafields, beautifying them with his own qualities.
bo: རྒྱལ་བ་ -ས་ རང་ གི་ ཡོན་ཏན་ ཀུན་ གྱིས་ ཞིང་ རྣམས་ ཐམས་ཅད་ བརྒྱན་ ཏེ་ ཤིན་ཏུ་ མཛེས་ མཛད་པ་ ། །

source: Homage to the unrivaled and unmatched master of miracles!”
bo: གང་ཞིག་ ཤིན་ཏུ་ མཉམ་མེད་ མཚུངས་པ་ མེད་ ཅིང་ རྫུ་འཕྲུལ་ དབང་ དུ་ གྱུར་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: After the gods of Trāyastriṃśa had praised the Blessed One with this verse, they joined the procession to attend to him.
bo: དེ་ནས་ སུམ་ཅུ་རྩ་གསུམ་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་འབྲིང་ དུ་ འབྲང་ ངོ་ ། །

source: At this point, the gods of Yāma, such as Suyāma, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine garments on him in worship.
bo: དེ་ནས་ ལྷ་ -འི་ རྒྱལ་པོ་ རབ་ འཐབ་བྲལ་ ལ་སོགས་པ་ འཐབ་བྲལ་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ -ར་ རིག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ ན་བཟའ་ -འི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ་
