Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Son of noble family, the tathāgatas are without verbal faults that could be reasonably objected to, such as the verbal faults that the immature or even the learned may possess.
bo: རིགས་ ཀྱི་ བུ་ ཡང་ གང་ གི་ ཕྱིར་ དེ་ -འི་ གསུང་ གི་ འཁྲུལ་པ་ -ས་ བྱིས་པ་ -འམ་ མཁས་པ་ -ས་ ཀྱང་ རུང་ སྟེ་ ། ཆོས་ དང་ འཐུན་པ་ -ས་ རྒོལ་བ་ -ར་ འགྱུར་བ་ -འི་ གསུང་ གི་ འཁྲུལ་པ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because, son of noble family, their speech is timely, poetic, correct, and truthful, and they act accordingly.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ དུས་ སུ་ གསུང་བ་ ། ཚིགས་ སུ་ གསུང་བ་ ། ཡང་དག་པ་ -ར་ གསུང་བ་ ། བདེན་པ་ -ར་ གསུང་བ་ ། ཇི་སྐད་ གསུངས་པ་ དེ་བཞིན་ དུ་ མཛད་པ་ -འོ་ ། །

source: Their words are precisely defined and satisfy all sentient beings.
bo: ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ དང་ ལྡན་པ་ -འོ་ ། ། སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ -འི་ ཚིག་ དང་ ལྡན་པ་ -འོ་ ། །

source: They are not repetitive.
bo: མི་ ཟློས་པ་ -འི་ ཚིག་ དང་ ལྡན་པ་ -འོ་ ། །

source: They are adorned with beautiful phrases and meaning.
bo: དོན་ དང་ ཚིག་འབྲུ་ -ས་ བརྒྱན་པ་ -འི་ ཚིག་ དང་ ལྡན་པ་ -འོ་ ། །

source: A single instant of expression satisfies the minds of all sentient beings.
bo: སྐད་ཅིག་ བརྗོད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཚིམ་པ་ -ར་ བྱེད་པ་ སྟེ་ །

source: Therefore, the speech of the tathāgatas is said to be faultless.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གསུང་ འཁྲུལ་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: “Son of noble family, the tathāgatas are without mental faults that could be reasonably objected to, such as the mental faults that the immature or even the learned may possess.
bo: རིགས་ ཀྱི་ བུ་ ཡང་ གང་ གི་ ཕྱིར་ དེ་ -འི་ ཐུགས་ འཁྲུལ་པ་ -ས་ བྱིས་པ་ -འམ་ ། མཁས་པ་ -ས་ ཀྱང་ རུང་ སྟེ་ ། ཆོས་ དང་ འཐུན་པ་ -ས་ རྩོད་པ་ -ར་ འགྱུར་བ་ -འི་ སེམས་ ཀྱི་ འཁྲུལ་པ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because even though they perform all the buddha deeds without abandoning the state of equipoise, the tathāgatas apply their unattached vision of wisdom to all phenomena without abandoning the mind in equipoise.
bo: འདི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ ནི་ མཉམ་པ་ -ར་ གཞག་པ་ -འི་ གནས་ མི་ འདོར་ ཞིང་ སངས་རྒྱས་ ཀྱི་ མཛད་པ་ ཐམས་ཅད་ མཛད་ ཀྱང་ སེམས་ དེ་ -ར་ མི་ གཏོང་ ཞིང་ ཆོས་ ཐམས་ཅད་ ལ་ ཆགས་པ་ མེད་པ་ -འི་ ཡེ་ཤེས་ ཀྱི་ མཐོང་བ་ འཇུག་ སྟེ

source: Therefore, the tathāgata mind is said to be faultless.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ འཁྲུལ་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: Just as their mind is faultless, they teach the Dharma accordingly to beings in order to dispel all their faults.
bo: ཇི་ལྟར་ དེ་ -འི་ སེམས་ འཁྲུལ་པ་ མེད་པ་ དེ་བཞིན་ དུ་ འཁྲུལ་པ་ ཐམས་ཅད་ སེལ་བ་ -འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the fifteenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅྭ་ ལྔ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The guides of beings are without the slightest Physical, verbal, or mental faults.
bo: སྐུ་ དང་ གསུང་ དང་ ཐུགས་ ཀྱི་ འཁྲུལ་པ་ དག་ ། རྣམ་པ་ -ར་ འདྲེན་ ལ་ ཅུང་ཟད་ ཡོད་ མ་ ཡིན་ ། །

source: The world protectors are without wrongdoing.
bo: འཇིག་རྟེན་ མགོན་པོ་ ཁ་ན་མ་ཐོ་ མེད་ ། །

source: They look faultlessly at all the ways to benefit beings.
bo: འཁྲུལ་ མེད་ འགྲོ་ ལ་ ཕན་ བྱེད་ ཀུན་ ནས་ གཟིགས་ ། །

source: “ ‘Thus the victors are without the slightest fault,
bo: ཇི་ལྟར་ རྒྱལ་བ་ ཅུང་ཟད་ འཁྲུལ་ མེད་པ་ ། །

source: And they teach the supreme Dharma of peace to beings.
bo: དེ་ལྟར་ ཆོས་མཆོག་ ཞི་བ་ འགྲོ་ ལ་ སྟོན་ ། །

source: The complete abandonment of all those faults
bo: འཁྲུལ་པ་ འདི་དག་ ཐམས་ཅད་ རྣམ་ སྤངས་པ་ ། །

source: Is the fifteenth activity of the victors.’
bo: འདི་ ནི་ རྒྱལ་བ་ -འི་ འཕྲིན་ལས་ བཅྭ་ ལྔ་པ་ ། །

source: “Son of noble family, the tathāgatas have no noisy kinds of speech that could lead to conflict, such as the noisy speech of Māra, the class of māras, or the non-Buddhists.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་ -འི་ ཅ་ཅོ་ གང་ ལས་ བདུད་ དམ་ ། བདུད་ ཀྱི་ རིས་ ཀྱི་ ལྷ་ -འམ་ ། གཞན་ མུ་སྟེགས་ ཅན་ དག་ གིས་ གླགས་ རྙེད་པ་ -ར་ འགྱུར་བ་ -འི་ ཅ་ཅོ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because the tathāgatas do not speak noisily or raucously.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ ཅ་ཅོ་ འམ་ རྗེས་སུ་ ཅ་ཅོ་ མེད་ དོ་ ། །

source: And why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because they are free of attachment and anger.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ རྗེས་སུ་ ཆགས་པ་ དང་ ། ཁོང་ཁྲོ་བ་ དང་ བྲལ་བ་ སྟེ་ །

source: They do not become elated when all beings revere them, nor do they become disheartened if no beings revere them.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱིས་ བཀུར་སྟི་ བྱས་ ཀྱང་ མ་ ཐོས་པ་ -ར་ མི་ སེམས་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱིས་ བཀུར་སྟི་ མ་ བྱས་ ཀྱང་ སྲོ་ ཤི་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: They do not babble regretfully about tasks that were difficult or could not be completed.
bo: གང་ གི་ ཕྱིར་ དེ་ འགྱོད་པ་ -ས་ རྗེས་སུ་ ཅ་ཅོ་ འབྱུང་བ་ -ར་ འགྱུར་བ་ བྱ་ དཀའ་བ་ -འི་ བྱ་བ་ -འམ་ ། མཐའ་ -ར་ མ་ ཕྱིན་པ་ ཅུང་ཟད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: “Tathāgatas do not dispute about anything in the world; they do not grumble.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ འཇིག་རྟེན་ གང་ དང་ ཡང་ རྩོད་པ་ མ་ ཡིན་ ཏེ་ ། དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཅ་ཅོ་ མེད་ དོ་ ། །

source: They abide in the absence of afflictive emotions.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ ལ་ གནས་པ་ སྟེ་ །

source: They are not possessive, they do not cling to or appropriate anything, and they are free from all bonds, so they do not speak noisily.
bo: ང་ -འི་བ་ མེད་པ་ ། ཡོངས་སུ་ འཛིན་པ་ མེད་པ་ ། ལེན་པ་ མེད་པ་ ། མདུད་པ་ ཐམས་ཅད་ དང་ བྲལ་བ་ སྟེ་ ། དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཅ་ཅོ་ མེད་ དོ་ ། །

source: Just as their speech is not noisy, they teach the Dharma accordingly, so that all the noisy speech of all sentient beings will be abandoned.
bo: ཇི་ལྟར་ དེ་ ལ་ ཅ་ཅོ་ མེད་པ་ དེ་བཞིན་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཅ་ཅོ་ ཐམས་ཅད་ སྤང་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the sixteenth activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་དྲུག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘When hearing praise, they are not elated.
bo: བསྔགས་པ་ ཐོས་ ཀྱང་ མ་ ཐོས་པ་ -ར་ སེམས་པ་ མེད་ ། །

source: When hearing blame, they are not disheartened.
bo: མི་ བསྔགས་ ཐོས་ ཀྱང་ སྲོ་ ཤི་ -ར་ མི་ འགྱུར་ ཏེ་ ། །

source: They have no attachment or anger.
bo: རྗེས་སུ་ འཆགས་ དང་ ཁོང་ཁྲོ་ -ར་ འགྱུར་བ་ མེད་ ། །

source: They do not belittle previous actions that were well performed.
bo: སྔོན་ སྤྱོད་ ལེགས་པ་ -ར་ སྤྱད་པ་ སྨད་པ་ མིན་ ། །

source: “ ‘The victors constantly cultivate the absence of afflictive emotions.
bo: རྒྱལ་བ་ -ས་ ཉོན་མོངས་ མེད་པ་ རྟག་ ཏུ་ བསྒོམས་ ། །

source: They lack possessiveness, clinging, or bonds.
bo: དེ་ ལ་ ང་ ཡི་ མེད་ ཅིང་ འཛིན་ མདུད་ མེད་ ། །

source: They teach in accord with their manner of abiding.
bo: ཇི་ལྟར་ གནས་པ་ དེ་ལྟར་ ཆོས་སྟོན་ ཏེ་ ། །

source: That is the excellence of the path on which one sees the truth.’
bo: འདི་ ནི་ བདེན་པ་ མཐོང་བ་ -འི་ ལམ་ གྱི་ མཆོག་ །

source: “Son of noble family, the tathāgatas do not suffer from forgetfulness that could lead to confusion about any phenomena.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ བསྙེལ་བ་ གང་ གིས་ ཆོས་ གང་ ལ་ ཡང་ རྨོངས་པ་ -ར་ འགྱུར་བ་ -འི་ བསྙེལ་བ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because none of the concentrations, liberations, absorptions, or meditative attainments of the tathāgatas are marred by forgetfulness.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ བསམ་གཏན་ དང་ ། རྣམ་པ་ -ར་ ཐར་པ་ དང་ ། ཏིང་ངེ་འཛིན་ དང་ ། སྙོམས་པར་ འཇུག་པ་ ཐམས་ཅད་ ལ་ བསྙེལ་བ་ མེད་ དོ་ ། །

source: When the tathāgatas observe the activity and movement of the minds of all sentient beings and teach the Dharma that is suitable for each, they do not suffer from forgetfulness.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ སྤྱོད་པ་ དང་ ། གཡོ་བ་ ལ་ རྣམ་པ་ -ར་ ལྟ་ ཞིང་ སོ་སོ་ ཅི་རིགས་པ་ -ར་ ཆོས་སྟོན་པ་ ལ་ བསྙེལ་བ་ མེད་ དོ་ ། །

source: The tathāgatas do not suffer from forgetfulness regarding the discriminations of meaning, phenomena, etymologies, and eloquence.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ དོན་ དང་ ། ཆོས་ དང་ ། ངེས་པ་ -འི་ ཚིག་ དང་ ། སྤོབས་པ་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ རྣམས་ ལ་ བསྙེལ་བ་ མེད་ དོ་ ། །

source: They do not suffer from forgetfulness in their unattached vision of wisdom of the past, present, and future.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ འདས་པ་ དང་ ། མ་འོངས་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ ལ་ ཆགས་པ་ མེད་པ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ ལ་ བསྙེལ་བ་ མེད་ དོ་ ། །

source: “Just as the tathāgatas do not suffer from forgetfulness themselves, they teach the Dharma accordingly, so that no sentient beings will suffer from forgetfulness.
bo: དེ་བཞིན་ གཤེགས་པ་ ཇི་ལྟར་ བདག་ བསྙེལ་བ་ མེད་པ་ དེ་ལྟར་ སེམས་ཅན་ ཐམས་ཅད་ བརྗེད་པ་ -ར་ མི་འགྱུར་བ་ -ར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the seventeenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་བདུན་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The guides do not suffer from forgetfulness regarding phenomena Or in their wisdom, liberations, or fields of activity.
bo: ཆོས་ དང་ ཡེ་ཤེས་ རྣམ་ཐར་ སྤྱོད་ཡུལ་ ལ་ ། ། རྣམ་པ་ -ར་ འདྲེན་པ་ བསྙེལ་བ་ མེད་པ་ སྟེ་ ། །

source: They teach the dharmas that correspond to mentalities,
bo: བསམ་པ་ ཇི་བཞིན་ ཆོས་ རྣམས་ བསྟན་པ་ -འི་ ཕྱིར་ ། །

source: Since the activity in the minds of sentient beings is endless.
bo: སེམས་ཅན་ བསམ་པ་ རྣམས་ ལ་ སྤྱོད་ མཐའ་ ཡས་ ། །

source: “ ‘Their discriminating knowledge is not marred by forgetfulness.
bo: སོ་སོ་ ཡང་དག་ རིག་ ལ་ བསྙེལ་བ་ མེད་ ། །

source: Their wisdom is unobscured with respect to the three times.
bo: དུས་གསུམ་ ལ་ ནི་ ཡེ་ཤེས་ བསྒྲིབས་པ་ མེད་ ། །

source: Just as they are without forgetfulness, so do they teach the Dharma accordingly.
bo: ཇི་ལྟར་ མི་ བསྙེལ་ དེ་ལྟར་ ཆོས་སྟོན་ ཏེ་ ། །

source: This is the activity of supreme beings.’
bo: འདི་ ནི་ སྐྱེས་མཆོག་ རྣམས་ ཀྱི་ འཕྲིན་ལས་ ཡིན་ ། །

source: “Son of noble family, the minds of the tathāgatas are never not in equipoise.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ སེམས་ མཉམ་པ་ -ར་ མ་ བཞག་པ་ མེད་ དོ་ ། །

source: Whether they walk, stand, sit, or recline, whether they eat, speak, or remain silent, they are constantly in equipoise, attain the supremely profound absorption, and practice an unobscured type of concentration.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ འཆག་ གམ་ ། བཞེངས་ སམ་ ། བཞུགས་ སམ་ ། གཟིམས་ སམ་ ། བཤོས་ གསོལ་ ལམ་ ། གསུང་ ངམ་ ། ཅང་ མི་ གསུང་ ཡང་ རུང་ སྟེ་ ། རྟག་ ཏུ་ མཉམ་པ་ -ར་ བཞག་པ་ ། ཏིང་ངེ་འཛིན་ ཟབ་མོ་ -འི་ མཆོག་ཐོབ་པ་ ། སྒྲིབ་པ་ མེད་པ་ -འི་ བསམ་གཏན་ ལ་ བསམ་གཏན་ བྱེད་པ་ སྟེ་ །

source: Without the blessing of the tathāgatas, no one among beings, whether in equipoise or not, is able to observe the mind of the tathāgatas.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བྱིན་ གྱི་ རླབས་ མ་གཏོགས་པ་ -ར་ སེམས་ཅན་ གྱི་ རིས་ ན་ སེམས་ཅན་ གང་ མཉམ་པ་ -ར་ བཞག་ ཀྱང་ རུང་ མཉམ་པ་ -ར་ མ་ བཞག་ ཀྱང་ རུང་ སྟེ་ ། སུ་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ ལ་ ལྟ་བ་ -ར་ ནུས་པ་ མེད་ དོ་ ། །

source: “Just as the tathāgatas are constantly in equipoise, they teach the Dharma accordingly, in order that sentient beings will not become distracted from their absorptions.
bo: དེ་བཞིན་ གཤེགས་པ་ ཇི་ལྟར་ རྟག་ ཏུ་ མཉམ་པ་ -ར་ གཞག་པ་ དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ རྣམས་ ཏིང་ངེ་འཛིན་ ལས་མི་ གཡེང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the eighteenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅྭ་ བརྒྱད་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Whether standing, sitting, lying down, or moving about, The buddhas are without a mind that is not in equipoise.
bo: བཞེངས་ སམ་ བཞུགས་ སམ་ གཟིམས་ སམ་ འཆག་པ་ རྣམས་ སུ་ ཡང་ ། ། སངས་རྒྱས་ སེམས་ ནི་ མཉམ་པ་ -ར་ མ་ བཞག་ ནམ་ཡང་ མེད་ ། །

source: Whether sitting silently, speaking, or eating, The victors are never seen to waver in their equipoise.
bo: མི་ གསུང་ བཞུགས་ དང་ གསུང་བ་ དང་ ནི་ བཤོས་ གསོལ་ དང་ ། ། རྒྱལ་བ་ མཉམ་པ་ -ར་ བཞག་ ལ་ གཡེང་བ་ མི་ དམིགས་ སོ་ ། །

source: “ ‘There is no one in the ten directions Who can know the mind of a sugata in equipoise.
bo: གང་ཞིག་ བདེ་གཤེགས་ མཉམ་པ་ -ར་ བཞག་པ་ -འི་ སེམས་ཤེས་པ་ ། ། གང་ཟག་ དེ་ ནི་ ཕྱོགས་ བཅུ་ དག་ ན་ -འང་ ཡོད་ མ་ ཡིན་ ། །

source: Just as they are in equipoise, so do they continuously teach the dharmas to beings.
bo: དེ་ ནི་ ཇི་ལྟར་ མཉམ་བཞག་ དེ་ལྟར་ འགྲོ་བ་ ལ་ ། ། རྟག་ ཏུ་ ཆོས་ རྣམས་ སྟོན་ ཏེ་

source: That is the activity of the victors.’
bo: འདི་ ནི་ རྒྱལ་བ་ -འི་ ལས་ ། །

source: “Son of noble family, the tathāgatas are free from perceptions of difference of the type that would lead the mind into a state of imbalance.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ཐ་ དད་པ་ -འི་ འདུ་ཤེས་ གང་ གིས་ སེམས་ མི་མཉམ་པ་ -ར་ གནས་པ་ -ར་ འགྱུར་བ་ -འི་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The tathāgatas are free from perceptions of difference regarding the fields, since the fields are inexhaustible like space;
bo: ནམ་མཁའ་ བཞིན་ དུ་ ཞིང་ མི་ཟད་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཞིང་ རྣམས་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་ དོ་ ། །

source: they are free from perceptions of difference regarding sentient beings, since they are by nature without a self;
bo: རང་བཞིན་ གྱིས་ བདག་མེད་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ རྣམས་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་ དོ་ ། །

source: they are free from perceptions of difference regarding the buddhafields, since they know the realm of phenomena to be a state of unadulterated equality;
bo: ཆོས་ ཀྱི་ དབྱིངས་ འདྲེས་པ་ མེད་ ཅིང་ མཉམ་པ་ཉིད་ དུ་ ཤེས་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ རྣམས་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་ དོ་ ། །

source: and they are free from perceptions of difference regarding phenomena, since the nature of reality is free from attachment.
bo: འདོད་ཆགས་ དང་ བྲལ་བ་ -འི་ ཆོས་ཉིད་ ཀྱི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་ རྣམས་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་ དོ་ ། །

source: “Tathāgatas do not favor those who observe moral conduct or feel anger toward those who transgress moral conduct.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ རྣམས་ ལ་ ཡང་ རྗེས་སུ་ ཆགས་པ་ མེད་ ། ཚུལ་ཁྲིམས་ འཆལ་པ་ རྣམས་ ལ་ ཡང་ ཁོང་ཁྲོ་བ་ མེད་ །

source: They do not reward those who do good or return harm to those who have done harm.
bo: ཕན་ བཏགས་པ་ རྣམས་ ལ་ ཡང་ ལན་ དུ་ ཕན་ འདོགས་པ་ མེད་ ། གནོད་པ་ བྱས་པ་ རྣམས་ ལ་ ཡང་ ལན་ དུ་ གནོད་པ་ བྱེད་པ་ མེད་ །

source: They are not indifferent to those who are worthy of training, nor do they condemn those who are stuck in error.
bo: འདུལ་བ་ -ར་ འོས་པ་ རྣམས་ ལ་ ཡང་ མཉམ་པ་ཉིད་ དུ་མ་ ཡིན་ ། ལོག་པ་ -ར་ ངེས་པ་ རྣམས་ ལ་ ཡང་ སྨོད་པ་ མ་ ཡིན་ གྱི་ །

source: The tathāgatas abide in sameness regarding all phenomena.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་ མཉམ་པ་ཉིད་ དུ་ གནས་པ་ སྟེ་ །

source: Therefore, the tathāgatas are said to be without any perceptions of difference.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: “Just as the tathāgatas are free of perceptions of difference, they teach the Dharma accordingly in order that all sentient beings may abandon perceptions of difference.
bo: ཇི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ མེད་པ་ དེ་ལྟར་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐ་དད་པ་ -འི་ འདུ་ཤེས་ སྤང་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the nineteenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་དགུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The sugatas are free of perceptions of difference Regarding fields, sentient beings, or phenomena.
bo: ཞིང་ དང་སེམས་ ཅན་ དེ་བཞིན་ ཆོས་ རྣམས་ ལ་ ། ། ཐ་དད་ འདུ་ཤེས་ བདེ་བ་ -ར་ གཤེགས་པ་ མེད་ ། །

source: Because they abide in sameness, The greatly renowned never have perceptions of difference.
bo: མཉམ་ཉིད་ གནས་ ཤིང་ གྲགས་པ་ ཆེ་ རྣམས་ ལ་ ། ། ཐ་དད་ འདུ་ཤེས་ ནམ་ཡང་ ཡོད་ མ་ ཡིན་ ། །

source: “ ‘The minds of superior humans are the same Whether beings observe moral conduct or faultless conduct, Or whether they are ready to be tamed or difficult to tame.
bo: ཁྲིམས་ལྡན་ ཁ་ན་མ་ཐོ་ མེད་པ་ -འི་ ཁྲིམས་ ། ། སེམས་ཅན་ འདུལ་བ་ -འི་ འོས་ དང་ གདུལ་ དཀའ་བ་ ། ། དེ་ ལ་ རྐང་ གཉིས་ དམ་པ་ སེམས་ མཉམ་ སྟེ་ ། །

source: They liberate those who apprehend difference.’
bo: སེམས་ཅན་ ཐ་དད་ འཛིན་པ་ ཐར་བ་ -ར་ བྱེད་ ། །

source: “Son of noble family, the equanimity of the tathāgatas is not due to a lack of discernment.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ ལ་སོ་ སོ་ -ར་ མ་ བརྟགས་པ་ -འི་ བཏང་སྙོམས་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because the equanimity of the tathāgatas comprises cultivation of the path, not a lack of its cultivation.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ ལམ་ བསྒོམས་པ་ ཡིན་ གྱི་ ། ལམ་ མ་ བསྒོམས་པ་ མ་ ཡིན་ ཏེ་ །

source: It is the cultivation of body, mind, and moral conduct.
bo: ལུས་ བསྒོམས་པ་ ། སེམས་ བསྒོམས་པ་ ། ཚུལ་ཁྲིམས་ བསྒོམས་པ་ -འོ་ ། །

source: The equanimity of the tathāgatas comprises the cultivation of insight, not a lack of its cultivation.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ ཤེས་རབ་ བསྒོམས་པ་ ཡིན་ གྱི་ ། མ་ བསྒོམས་པ་ མ་ ཡིན་ ནོ་ ། །

source: It is endowed with insight, not with delusion. It transcends the world; it does not descend into the mundane.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ ཡེ་ཤེས་ དང་ ལྡན་པ་ ཡིན་ གྱི་ ། གཏི་མུག་ དང་ ལྡན་པ་ མ་ ཡིན་ ནོ་ ། ། དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ འཇིག་རྟེན་ ལས་ འདས་པ་ ཡིན་ གྱི་ ། འཇིག་རྟེན་པ་ -ར་ ལྟུང་བ་ མ་ ཡིན་ ནོ་ ། །

source: It constitutes the deliverance of a noble one, not the nondeliverance of someone who is not a noble one.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ འཕགས་པ་ ངེས་པར་ འབྱུང་བ་ ཡིན་ གྱི་ ། འཕགས་པ་ མ་ཡིན་པ་ ངེས་པར་ མི་ འབྱུང་བ་ མ་ ཡིན་ ནོ་ ། །

source: “The equanimity of tathāgatas involves turning the wheel of the Dharma. It is not without great compassion for beings.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ ནི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ སྐོར་བ་ སྟེ་ ། སེམས་ཅན་ ལ་ སྙིང་རྗེ་ ཆེན་པོ་ དང་ བྲལ་བ་ མ་ ཡིན་ ནོ་ ། །

source: It is realized of its own accord without relying on a remedy.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ བཏང་སྙོམས་ དེ་ ནི་ རང་ གི་ ཚུལ་ གྱིས་ སྒྲུབ་པ་ སྟེ་ གཉེན་པོ་ -འི་ རྗེས་སུ་ སོང་བ་ མ་ ཡིན་ །

source: It is not an elated state of mind or a depressed state of mind.
bo: མཐོ་བ་ -ར་ སེམས་པ་ མ་ ཡིན་ ། དམའ་བ་ -ར་ སེམས་པ་ མ་ ཡིན་ ཏེ་ །

source: It is an unwavering state without objectification.
bo: གནས་པ་ མི་གཡོ་བ་ -ར་ གྱུར་པ་ ། དམིགས་པ་ དང་ བྲལ་བ་ །

source: It transcends conceptualization and conceptual exclusion.
bo: རྟོག་པ་ དང་ སེལ་བ་ ལས་ ཤིན་ཏུ་ འདས་པ་ །

source: It is aware of the occasion and timely.
bo: དུས་ ལ་ ལྟ་བ་ ། དུས་ ལས་མ་ ཡོལ་བ་ །

source: It does not waver. It is not intentional, discriminative, or analytical. It is not an accomplishment. It is indefinable. It is genuine.
bo: མི་གཡོ་བ་ ། མི་ སེམས་པ་ ། མི་ རྟོག་པ་ ། རྣམ་པ་ -ར་ མི་ རྟོག་པ་ ། རྣམ་པ་ -ར་ མ་ བསྒྲུབས་པ་ ། བསྟན་ དུ་ མེད་པ་ ། ཡང་དག་པ་ ། དེ་ ཁོ་ན་ །

source: It is just that: suchness—unique suchness.
bo: དེ་བཞིན་ཉིད་ ། གཞན་མ་ ཡིན་པ་ དེ་བཞིན་ཉིད་ དེ་ །

source: “Through the perfection of such great equanimity the tathāgatas teach the Dharma accordingly, so that all sentient beings may perfect such equanimity.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ བཏང་སྙོམས་ ཆེན་པོ་ དེ་ལྟ་ བུ་ ཕུན་སུམ་ ཚོགས་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ བཏང་སྙོམས་ དེ་ལྟ་ བུ་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the twentieth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Since the supreme path of excellent conduct has been cultivated,
bo: ལེགས་སྤྱད་ ལམ་མཆོག་ ཤིན་ཏུ་ བསྒོམས་པ་ -འི་ ཕྱིར་ ། །

source: Their equanimity is not due to lack of discernment.
bo: སོ་སོ་ -ར་ མ་ བརྟགས་ བཏང་སྙོམས་ ཡོད་ མ་ ཡིན་ ། །

source: The supreme beings fully cultivated body, mind, Moral conduct, insight, and truth.
bo: གང་ཟག་ མཆོག་ ནི་ ལུས་ དང་ དེ་བཞིན་ སེམས་ ། ། ཚུལ་ཁྲིམས་ ཤེས་རབ་ བདེན་པ་ ཤིན་ཏུ་ བསྒོམས་ ། །

source: “ ‘The victors lack attachment or anger.
bo: རྒྱལ་བ་ རྗེས་སུ་ ཆགས་ དང་ ཁོང་ཁྲོ་ མེད་ ། །

source: Without discrimination, analysis, or accomplishment,
bo: རྟོག་ དང་ རྣམ་པ་ -ར་ རྟོག་ དང་ རྣམ་ བསྒྲུབས་ མེད་ ། །

source: Their equanimity is genuine and unique.
bo: བཏང་སྙོམས་ ཡང་དག་ དེ་བཞིན་ གཞན་མ་ ཡིན་ ། །

source: Still, they teach all beings.’
bo: དེ་ལྟར་ ཡིན་ཡང་ འགྲོ་བ་ ཀུན་ ལ་ འཆད་ ། །

source: “Son of noble family, the zeal of the tathāgatas does not deteriorate.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: What kind of zeal is it?
bo: དེ་ ལ་ འདུན་པ་ གང་ཞེ་ན་ །

source: It is the zeal for virtuous factors.
bo: འདི་ལྟ་སྟེ་ ། དགེ་བ་ -འི་ ཆོས་ ལ་ འདུན་པ་ -འོ་ ། །

source: Why is that?
bo: དེ་ཡང་ གང་ཞེ་ན་ །

source: The tathāgatas’ zeal for great love and great compassion does not deteriorate.
bo: བྱམས་པ་ ཆེན་པོ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། ། སྙིང་རྗེ་ ཆེན་པོ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: Their zeal for teaching the Dharma and for taming and ripening beings does not deteriorate.
bo: ཆོས་སྟོན་པ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། ། སེམས་ཅན་ འདུལ་བ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། ། སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱ་བ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: Their zeal for solitude does not deteriorate.
bo: རབ་ཏུ་ དབེན་པ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: Their zeal for engaging sentient beings in embracing awakening does not deteriorate.
bo: སེམས་ཅན་ བྱང་ཆུབ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: Their zeal for the unbroken continuity of the lineage of the Three Jewels does not deteriorate.
bo: དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ ལ་ འདུན་པ་ ཉམས་པ་ མེད་ དོ་ ། །

source: “The tathāgatas are not driven by zeal, but, rather, their zeal is preceded by wisdom.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ འདུན་པ་ -ས་ འགྲོ་བ་ མ་ ཡིན་ གྱི་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ འདུན་པ་ ནི་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་བ་ ཉིད་ དེ་ །

source: That is why it is said that the zeal of the tathāgatas does not deteriorate.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འདུན་པ་ ཉམས་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: The tathāgatas teach the Dharma so that the unsurpassed zeal of all sentient beings may be perfected.
bo: སེམས་ཅན་ ཐམས་ཅད་ ལ་ བླ་ ན་ མེད་པ་ -འི་ འདུན་པ་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་ ཀྱང་ སྟོན་ ཏེ་ །

source: This is the twenty-first tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ གཅིག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The zeal of the victors is a constant wish for and delight in virtuous factors.
bo: རྒྱལ་བ་ -འི་ འདུན་པ་ རྟག་ ཏུ་ དགེ་བ་ -འི་ ཆོས་ ཀྱི་ ཚུལ་ ལ་ འདོད་ ཅིང་ དགའ་ ། །

source: They bestow the Dharma of love and compassion in order to liberate beings.
bo: སེམས་ཅན་ རབ་ཏུ་ ཐར་བ་ -ར་ བྱ་ ཕྱིར་ བྱམས་ དང་ སྙིང་རྗེ་ -འི་ ཆོས་ ཀྱང་ སྦྱིན་ ། །

source: Their longing to mature beings and to delight in forest groves does not deteriorate.
bo: སེམས་ཅན་ ཡོངས་ སྨིན་ བྱ་ དང་ ནགས་ཚལ་ དགའ་ ལ་མོ་ -ས་པ་ ཉམས་པ་ མེད་ ། །

source: They cause many to embrace awakening and do not disrupt the continuity of the lineage of the Three Jewels.
bo: རབ་ཏུ་ མང་པོ་ བྱང་ཆུབ་ འཛིན་ འཇུག་ དཀོན་མཆོག་ གསུམ་ གྱི་ རྒྱུན་ མི་ གཅོད་ ། །

source: “ ‘They are not driven by attachment, aversion, fear, or delusion.
bo: འདོད་ དང་ ཞེ་སྡང་ དང་ ནི་ འཇིགས་ དང་ གཏི་མུག་ གིས་ ནི་ འགྲོ་ མ་ ཡིན་ ། །

source: Exceptionally skilled, they realize all factors that are produced by knowledge.
bo: ཁྱད་པར་ གྱུར་ ནས་ མཁས་ དེ་ ཤེས་པ་ -ས་ བྱས་པ་ -འི་ ཆོས་ ཀུན་ རྟོགས་པ་ -ར་ འགྱུར་ ། །

source: Observing lazy beings who lack zeal, the victors motivate them.
bo: རྒྱལ་བ་ སེམས་ཅན་ འདུན་ བྲལ་ ལེ་ལོ་ ཅན་ དག་ མཐོང་ ནས་ འདུན་ ལ་ སྦྱོར་ ། །
