Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: That which is the definitive meaning is the ultimate.
bo: ངེས་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་དོན་ དམ་པ་ -འོ་ ། །

source: That which is ultimate means the reality devoid of a person.
bo: དོན་དམ་པ་ གང་ཡིན་པ་ དེ་ གང་ཟག་ མེད་པ་ -འི་ དོན་ ཏོ་ ། །

source: The reality devoid of a person is inexpressible.
bo: གང་ཟག་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ བརྗོད་ དུ་ མེད་པ་ -འི་ དོན་ ཏོ་ ། །

source: The inexpressible is dependent arising.
bo: བརྗོད་ དུ་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ -འི་ དོན་ ཏོ་ ། །

source: Dependent arising is the Dharma.
bo: རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ཆོས་ ཀྱི་ དོན་ ཏོ་ ། །

source: The Dharma is suchness.
bo: ཆོས་ ཀྱི་ དོན་ གང་ཡིན་པ་ དེ་དེ་ བཞིན་ ཉིད་ ཀྱི་ དོན་ ཏོ་ ། །

source: Suchness is the tathāgata.
bo: དེ་བཞིན་ཉིད་ ཀྱི་ དོན་ གང་ཡིན་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ་ -འི་ དོན་ ཏོ་ ། །

source: Therefore, it is said that ‘whoever sees dependent arising sees the Dharma, and whoever sees the Dharma sees the tathāgata.’
bo: དེས་ན་ སུ་ -ས་ རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ མཐོང་བ་ དེ་ -ས་ ཆོས་ མཐོང་ ངོ་ ། ། སུ་ -ས་ ཆོས་ མཐོང་བ་ དེ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ མཐོང་ ངོ་ ཞེས་ བྱ་ སྟེ་ །

source: When one searches, informed by suchness, one sees nothing whatsoever, and that is how one sees.
bo: ཇི་ལྟར་ དེ་བཞིན་ཉིད་ ཀྱིས་ ཡོངས་སུ་ བཙལ་ ན་ ཅི་ཡང་ མི་ མཐོང་བ་ དེ་ལྟར་ མཐོང་ ངོ་ ། །

source: What is that ‘nothing whatsoever?’
bo: དེ་ ལ་ ཅི་ཡང་ ཞེས་ བྱ་བ་ གང་ཞེ་ན་ །

source: The answer is ‘conceptual signs and objective references.’
bo: འདི་ལྟ་སྟེ་ ། མཚན་མ་ དང་ དམིགས་པ་ -འོ་ ། །

source: At the time when one sees without thought or objective reference, one sees truly.
bo: དེ་ -ས་ གང་ གི་ ཚེ་ སེམས་ མེད་པ་ དང་ དམིགས་པ་ མེད་པ་ -ར་ མཐོང་བ་ དེ་ -འི་ ཚེ་ ཡང་དག་པ་ མཐོང་ ངོ་ ། །

source: In this manner, tathāgatas completely and perfectly awaken, by means of sameness, to the sameness of all phenomena.
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ དེ་དག་ མཉམ་པ་ཉིད་ ཀྱིས་ མཉམ་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend what is without contamination and appropriation. They should comprehend it.’
bo: ཟག་པ་ མེད་པ་ དང་ ། ཉེ་བར་ ལེན་པ་ མེད་པ་ འདི་ ཡང་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is pure, stainless, and without afflictive emotions.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ དག་པ་ དང་ ། དྲི་མ་ མེད་པ་ དང་ ། ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: In this regard, what is pure?
bo: དེ་ ལ་ དག་པ་ ནི་ གང་ །

source: What is stainless?
bo: དྲི་མ་ མེད་པ་ ནི་ གང་ །

source: What is without afflictive emotions?
bo: ཉོན་མོངས་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Emptiness is pure.
bo: སྟོང་པ་ཉིད་ ནི་ དག་པ་ -འོ་ ། །

source: Signlessness is stainless.
bo: མཚན་མ་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Wishlessness is without afflictive emotions.
bo: སྨོན་པ་ མེད་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: The unborn is pure.
bo: སྐྱེ་བ་ མེད་པ་ ནི་ དག་པ་ -འོ་ ། །

source: Absence of conditioning is stainless.
bo: མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Nonarising is without afflictive emotions.
bo: འབྱུང་བ་ མེད་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: The nature is pure.
bo: རང་བཞིན་ ནི་ དག་པ་ -འོ་ ། །

source: Total purity is stainless.
bo: ཡོངས་སུ་ དག་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Luminosity is without afflictive emotions.
bo: འོད་གསལ་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: The absence of proliferation is pure.
bo: སྤྲོས་པ་ མེད་པ་ ནི་ དག་པ་ -འོ་ ། །

source: Non-proliferation is stainless.
bo: མ་ སྤྲོས་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: The pacification of proliferations is without afflictive emotions.
bo: སྤྲོས་པ་ ཉེ་བར་ ཞི་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Suchness is pure.
bo: དེ་བཞིན་ཉིད་ ནི་ དག་པ་ -འོ་ ། །

source: The realm of phenomena is stainless.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: The limit of reality is without afflictive emotions.
bo: ཡང་དག་པ་ -འི་ མཐའ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Space is pure.
bo: སྐབས་ འབྱེད་པ་ ནི་ དག་པ་ -འོ་ ། །

source: Space is stainless.
bo: ནམ་མཁའ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Space is without afflictive emotions.
bo: ནམ་མཁའ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Understanding inwardly is pure.
bo: ནང་ ཡོངས་སུ་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: Not pursuing outwardly is stainless.
bo: ཕྱི་རོལ་ དུ་ མི་ རྒྱུ་བ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Not objectifying inwardly or outwardly is without afflictive emotions.
bo: ནང་ དང་ ཕྱི་མི་ དམིགས་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Understanding the aggregates is pure.
bo: ཕུང་པོ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: The essence of the elements is stainless.
bo: ཁམས་ ཀྱི་ ངོ་བོ་ ཉིད་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Rejecting the sense fields is without afflictive emotions.
bo: སྐྱེ་མཆེད་ འདོར་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Understanding that the past is gone is pure.
bo: འདས་པ་ ལ་ ཟད་པར་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: Understanding that the future has not yet arisen is stainless.
bo: མ་འོངས་པ་ ལ་ མི་ སྐྱེ་བ་ -ར་ ཤེས་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: Understanding that the present is present as the realm of phenomena is without afflictive emotions.
bo: ད་ལྟར་ བྱུང་བ་ ལ་ ཆོས་ ཀྱི་ དབྱིངས་ གནས་པ་ -ར་ ཤེས་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: “Therefore purity, stainlessness, and the absence of afflictive emotions are actually united in the single state that is the state of peace.
bo: དེ་ལྟར་ ན་ དག་པ་ དང་ ། དྲི་མ་ མེད་པ་ དང་ ། ཉོན་མོངས་པ་ མེད་པ་ ནི་ འདི་ལྟ་སྟེ་ ། ཞི་བ་ -འི་ གནས་ ཀྱི་ གནས་ གཅིག་ ཏུ་ ཡང་དག་པ་ -ར་ འདུ་ -འོ་ ། །

source: Peace is peacefulness.
bo: ཞི་བ་ གང་ཡིན་པ་ དེ་ རབ་ཏུ་ ཞི་བ་ -འོ་ ། །

source: Peacefulness is what is called pacification.
bo: རབ་ཏུ་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ཉེ་བར་ ཞི་བ་ -འོ་ ། །

source: Pacification is what is called the absence of signs by means of the act of pacifying.
bo: ཉེ་བར་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ཉེ་བར་ ཞི་བ་ -ར་ བྱེད་པ་ -ས་ མཚན་མ་ མེད་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: The absence of signs is what is called pacification.
bo: མཚན་མ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ཉེ་བར་ ཞི་བ་ -འོ་ ། །

source: Pacification is what is called intelligence.
bo: ཉེ་བར་ ཞི་བ་ གང་ཡིན་པ་ དེ་ བློ་གྲོས་ ཞེས་ བྱ་ -འོ་ ། །

source: “Therefore, son of noble family, as is space, so too is awakening.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ ན་ ནམ་མཁའ་ ཇི་ལྟ་ བར་ བྱང་ཆུབ་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: As is awakening, so too are all phenomena.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ ཆོས་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: As are all phenomena, so too are sentient beings.
bo: ཆོས་ རྣམས་ ཇི་ལྟ་ བར་ སེམས་ཅན་ རྣམས་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: As are sentient beings, so too are the buddhafields.
bo: སེམས་ཅན་ རྣམས་ ཇི་ལྟ་ བར་ ཞིང་ རྣམས་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: As are the buddhafields, so too is nirvāṇa.
bo: ཞིང་ རྣམས་ ཇི་ལྟ་ བར་ མྱ་ངན་ ལས་ འདས་པ་ ཡང་ དེ་བཞིན་ ནོ་ ། །

source: Thus, all phenomena are said to be equal to nirvāṇa. Because they are ultimate and final there are no remedies to apply.
bo: དེས་ན་ ཆོས་ ཐམས་ཅད་ ནི་ མྱ་ངན་ ལས་ འདས་པ་ དང་ མཉམ་པ་ ཞེས་ བྱ་ སྟེ་ ། མཐའ་ -ར་ ཕྱིན་ ཅིང་ མུ་ -ར་ ཐུག་པ་ -འི་ ཕྱིར་ གཉེན་པོ་ མེད་པ་ -འོ་ ། །

source: Because there are no remedies to apply, all phenomena are primordially pure, primordially stainless, and primordially without afflictive emotions.
bo: གཉེན་པོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ དག་པ་ ། གཟོད་མ་ ནས་ དྲི་མ་ མེད་པ་ ། གཟོད་མ་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Tathāgatas accordingly are completely and perfectly awakened to the reality of all phenomena.
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དེ་ལྟ་ བུ་ -འི་ ཚུལ་ དང་ འཐུན་པ་ -ར་ ཆོས་ ཐམས་ཅད་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: After surveying the mass of sentient beings who are impure, who are not stainless, and who possess afflictive emotions, they extend their great compassion known as magical play to all sentient beings.
bo: མ་ དག་པ་ དང་ ། དྲི་མ་ མེད་པ་ མ་ཡིན་པ་ དང་ ། ཉོན་མོངས་པ་ དང་ བཅས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ལ་ རྣམ་པ་ -ར་ གཟིགས་ ནས་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ རྣམ་པ་ -ར་ རོལ་པ་ ཞེས་ བྱ་བ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Using his skillful means, the Tathāgata informed the gods of the Brahmā realm that he would not turn the wheel of the Dharma without being requested to do so.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཐབས་མཁས་པ་ -ས་ ཚངས་པ་ ལ་ གཞེས་ ཏེ་ ། གསོལ་བ་ མ་ བཏབ་པ་ -ར་ ཆོས་ ཀྱི་ འཁོར་ལོ་ མི་ བསྐོར་ རོ་ ། །

source: Then Top-Knotted Brahmā, surrounded and escorted by eight hundred thousand gods of the Brahmā realm, instantly disappeared from the realm of Brahmā.
bo: དེ་ནས་ ཚངས་པ་ གཙུག་ཕུད་ ཅན་ ཚངས་པ་ བརྒྱ་ སྟོང་ཕྲག་ བརྒྱད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཏེ་ ། མདུན་ དུ་ བདར་ ནས་ ལྷན་ཅིག་ ཏུ་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ཏེ་

source: He arrived in the presence of the Tathāgata and paid homage at the Tathāgata’s feet.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ ། དེ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཞབས་ གཉིས་ ལ་ གཏུགས་ ཏེ་

source: To ensure that the wheel of Dharma be set in motion, he supplicated the Tathāgata:
bo: ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ -འི་ སླད་ དུ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཆོས་ བཤད་ དུ་ གསོལ་ །

source: ‘May the Blessed One teach the Dharma! May the Sugata teach the Dharma!’
bo: བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ ཆོས་ བཤད་ དུ་ གསོལ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ གསོལ་བ་ བཏབ་བོ་ ། །

source: He also supplicated the Tathāgata with the following words:
bo: དེ་ -འི་ ཚེ་ ཚངས་པ་ གཙུག་ཕུད་ ཅན་ གྱིས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ཚིགས་ སུ་ བཅད་པ་ -ས་ ཀྱང་ གསོལ་པ་ །

source: “ ‘Your Dharma, realized by buddha wisdom, Is peaceful and serene, pure and immaculate, Unsullied and radiant, Inexpressible, soundless, and without words.
bo: ཁྱོད་ ཀྱི་ ཆོས་ ནི་ ཞི་ ཞིང་ རབ་ ཞི་ ལ་ ། ། དག་ ཅིང་ རྣམ་དག་ དྲི་མེད་ འོད་གསལ་ ཏེ་ ། ། བརྗོད་ མེད་ སྒྲ་མེད་ ཡི་གེ་ མེད་ འཕགས་པ་ -ར་ ། ། སངས་རྒྱས་ ཡེ་ཤེས་ ཀྱིས་ ནི་ ཐུགས་ སུ་ ཆུད་ ། །

source: “ ‘You endured great hardships of asceticism and austerity For millions of eons To bring about the awakening of beings, confused and obscured By self-satisfaction, from the deep sleep of delusion.
bo: ཡུན་རིང་ གཉིད་ལོག་ གཏི་མུག་ རྒྱགས་པ་ -ས་ བསྒྲིབས་ ། ། ནོར་བ་ -འི་ སེམས་ཅན་ སད་པ་ -ར་ མཛད་ དོན་ དུ་ ། ། དེ་ སླད་ ཁྱོད་ ཀྱིས་ བསྐལ་པ་ བྱེ་ བར་ ནི་ ། ། བརྟུལ་ཞུགས་ དཀའ་ཐུབ་ ཤིན་ཏུ་ དཀའ་བ་ སྤྱད་ ། །

source: “ ‘Those entrusted with the lineage of the previous victors Realized this supreme Dharma. On account of the many virtuous beings present herein,
bo: གང་དག་ སྔོན་ གྱི་ རྒྱལ་བ་ -འི་ རྒྱུས་ ལྷགས་པ་ ། ། དེ་དག་ ཆོས་མཆོག་ འདི་ ནི་ རྟོགས་ འགྱུར་ ཏེ་ ། ། འདི་ ན་ སེམས་ཅན་ དགེ་ བསམ་ མང་ མཆིས་ ཀྱིས་ ། །

source: May the Tathāgata turn the wheel of the Dharma.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ རབ་ འཁོར་ལོ་ བསྐོར་ ། །

source: “ ‘You have subjugated the hosts of Māra
bo: ཁྱོད་ ཀྱིས་ བདུད་ འཁོར་ ཤིན་ཏུ་ ཚར་ བཅད་ དེ་ ། །

source: And opened the gate to the deathless.
bo: ཁྱོད་ ཀྱིས་ བདུད་རྩི་ -འི་ སྒོ་ ནི་ རབ་ཏུ་ ཕྱེ་ ། །

source: Great Leader, guide beings who have gone astray To the path of the noble ones!
bo: དེད་དཔོན་ ཆེན་པོ་ ལམ་ལོག་ འཁྱམས་པ་ ཡི་ ། ། སེམས་ཅན་ དག་ ནི་ འཕགས་པ་ -འི་ ལམ་ དུ་ ཁྲིད་ ། །

source: “ ‘Your unsurpassed buddha compassion
bo: ཁྱོད་ ཀྱི་ སངས་རྒྱས་ ཐུགས་རྗེ་ བླ་ ན་ མེད་ ། །

source: Benefits beings inconceivably. Teacher, I beg you, Please turn the wheel of the supreme Dharma!
bo: འགྲོ་ ལ་ ཕན་པ་ -ར་ བསམ་ གྱིས་ མི་ ཁྱབ་འཇུག་ ། སྟོན་པ་ ཁྱོད་ ལ་ བདག་ ནི་ གསོལ་འདེབས་ ཀྱིས་ ། ། ཆོས་མཆོག་ འཁོར་ལོ་ རབ་ཏུ་ བསྐོར་ དུ་ གསོལ་ ། །

source: “ ‘Blessed One, may you also turn the wheel of Dharma Just as the Victor Krakucchanda, The Victor Kanakamuni, And the Tathāgata Kāśyapa have done.
bo: ཇི་ལྟར་ རྒྱལ་བ་ འཁོར་བ་ འཇིག་ གིས་ བསྐོར་ ། ། ཇི་ལྟར་ གསེར་ཐུབ་ རྒྱལ་བ་ -ས་ བསྐོར་བ་ དང་ ། ། བདེ་གཤེགས་ འོད་སྲུང་ གིས་ ཀྱང་ བསྐོར་བ་ ལྟར་ ། ། བཅོམ་ལྡན་འདས་ ཀྱང་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་ ། །

source: “ ‘Just as rainfall brings satisfaction
bo: ཇི་ལྟར་ སྤྲིན་ གྱི་ ཆུ་ ཡིས་ ཚིམ་ བགྱིས་ ཏེ་ ། །

source: And causes medicinal plants to grow,
bo: དེ་ ཡིས་ ལོ་ཐོག་ སྨན་ རྣམས་ བསྐྱེད་པ་ ལྟར་ ། །

source: So the clouds of your compassion encircle the world,
bo: ཐུགས་རྗེ་ -འི་ སྤྲིན་ གྱིས་ འཇིག་རྟེན་ ཁྱབ་ མཛད་ དེ་ ། །

source: And you, Tathāgata, let the rain of Dharma fall!
bo: དེ་བཞིན་ གཤེགས་པ་ ཁྱོད་ ཀྱིས་ ཆོས་ ཆ་ -ར་ ཕོབ་ ། །

source: “ ‘As soon as a supreme guide is born,
bo: རྣམ་པ་ -ར་ འདྲེན་ མཆོག་ གང་ཞིག་ སྐྱེས་མ་ ཐག་ །

source: He issues a sound in order to liberate beings.
bo: འགྲོ་བ་ ཐར་བ་ -ར་ མཛད་ སླད་ སྒྲ་ ཕྱུང་བ་ ། །

source: Right now, please relieve the thirst of the yearning gods and humans With the water of great Dharma.’
bo: དེང་དུས་ དེང་ ལགས་ ལྷ་ མི་ སྐོམ་པ་ རྣམས་ ། ། ཆོས་ ཆེན་ ཆུ་ ཡིས་ སྐོམ་པ་ བསལ་ དུ་ གསོལ་ ། །

source: “Son of noble family, the Tathāgata, aware of Top-Knotted Brahmā’s supplication, proceeded with unrelinquishing great compassion to turn the unsurpassed Dharma wheel in Deer Park in Rṣipatana near the town of Vārāṇasī. In this world such a Dharma wheel had never been turned in conformity with the Dharma before by any wandering ascetic, brahmin, god, demon, or Brahmā himself. It was then that the word impermanence was understood throughout the entire billionfold universe.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཚངས་པ་ གཙུག་ཕུད་ ཅན་ གྱིས་ གསོལ་བ་ བཏབ་པ་ -ར་ མཁྱེན་ ནས་ ཉིད་ ཀྱིས་ ཐུགས་རྗེ་ ཆེན་པོ་ མ་ བཏང་བ་ -ས་ གྲོང་ཁྱེར་ བཱ་རཱ་ཎ་སཱི་ དྲང་སྲོང་ ལྷུང་བ་ རི་ དགའ་ -ས་ ཀྱི་ ནགས་ སུ་ དགེ་སྦྱོང་ དང་ ། བྲམ་ཟེ་ -འམ་ ། ལྷ་ -འམ་ ། བདུད་ དམ་ ། ཚངས་པ་ -འམ་ ། གང་ གིས་ ཀྱང་ འཇིག་རྟེན་ དུ་ ཆོས་ དང་ འཐུན་ པར་མ་ བསྐོར་བ་ -འི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བླ་ ན་ མེད་པ་ བསྐོར་ ཏེདེར་ མི་རྟག་པ་ -འི་ སྒྲ་ -ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ གོ་བ་ -ར་ བྱས་ སོ་ ། །

source: Kauṇḍinya was the first to fully know the Dharma.
bo: ཀཽཎྜི་ ནྱས་ ཀྱང་ ཐོག་མ་ -ར་ ཆོས་ ཀུན་ དུ་ ཤེས་ སོ་ ། །

source: Then the Buddha, inspired, uttered the following:
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ ཆེད་ དུ་ བརྗོད་པ་ འདི་ ཆེད་ དུ་ བརྗོད་ དོ་ ། །

source: “ ‘That which is ineffable and profound, Beyond words and of definitive meaning— Kauṇḍinya understood it,
bo: བརྗོད་ དུ་ མེད་ ཅིང་ ཟབ་པ་ སྟེ་ ། ། ཡི་གེ་ མེད་ ཅིང་ ངེས་པ་ -འི་ དོན་ ། ། ཀཽཎྜི་ ནྱས་ ནི་ འདི་ ཤེས་པ་ -ས་ ། །

source: So my effort has not been in vain!’
bo: ང་ ཡི་ འབད་པ་ དོན་མེད་ མིན་ ། །

source: “By turning the wheel of the Dharma, the Tathāgata tamed innumerable and unfathomably many sentient beings.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ -ས་ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ བཏུལ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: Through knowing this magical play of great tathāgata compassion, immeasurable and innumerable sentient beings generated the thought of awakening.
bo: དེ་བཞིན་ གཤེགས་པ་ ཐུགས་རྗེ་ ཆེན་པོ་ -ས་ རྣམ་པ་ -ར་ རོལ་པ་ -ར་ རིག་ ནས་ ། སེམས་ཅན་ ཚད་ མེད་ གྲངས་མེད་པ་ དག་ གིས་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “Son of noble family, these sixteen kinds of great compassion of the blessed buddhas are constantly spontaneously active and are never given up.
bo: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ རྣམ་པ་ བཅུ་དྲུག་པོ་ འདི་ ནི་ ལྷུན་ གྱིས་ གྲུབ་པ་ -ར་ རྟག་ ཏུ་ འཇུག་པ་ སྟེ་ ཡང་ གཏང་བ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: Endowed with such great compassion, tathāgatas happily dwell among the denizens in the great hell realms for the sake of each and every being, for as many eons as there are grains of sand in the river Ganges.
bo: ཐུགས་རྗེ་ ཆེན་པོ་ དེ་ དང་ ལྡན་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ རེ་རེ་ -འི་ ཆེད་ དུ་ ཡང་ བསྐལ་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དུ་ སེམས་ཅན་ དམྱལ་བ་ ཆེན་པོ་ རྣམས་ སུ་ གནས་པ་ -ར་ སྤྲོ་ སྟེ་ །

source: When they gaze at those to be tamed through the superior Dharma and Vinaya, the tathāgatas are never discouraged, and their great compassion never deteriorates.
bo: གལ་ཏེ་ སེམས་ཅན་ དེ་དག་ འཕགས་པ་ -འི་ ཆོས་ འདུལ་བ་ ལ་ འདུལ་བ་ -ར་ འགྱུར་བ་ ལྟ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡང་ ཡོངས་སུ་ མི་ སྐྱོ་ ཞིང་ ། ཐུགས་རྗེ་ ཆེན་པོ་ དེ་ཡང་ ཡོངས་སུ་ མི་ མཉམ་ མོ་ ། །

source: That is how the inconceivable great compassion of the blessed buddhas extends to sentient beings.
bo: དེ་ལྟར་ སེམས་ཅན་ རྣམས་ ལ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ འཇུག་ གོ་ ། །

source: “The compassion of śrāvakas and pratyekabuddhas is compared to skin, the compassion of bodhisattvas to flesh, and the great compassion of blessed buddhas to bones and marrow.
bo: ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ པགས་པ་ -འི་ རྣམ་པ་ ལྟ་བུ་ -འོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ ཤ་ -འི་ རྣམ་པ་ ལྟ་བུ་ -འོ་ ། ། སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ རུས་པ་ དང་ རྐང་ གི་ རྣམ་པ་ ལྟ་བུ་ -འོ་ ། །

source: Śrāvaka compassion rejoices in buddha wisdom.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ལ་ རྗེས་སུ་ ཡི་ རང་བ་ -འོ་ ། །

source: Bodhisattva compassion establishes bodhicitta.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ བྱང་ཆུབ་ ཀྱི་ སེམས་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ -འོ་ ། །

source: The great compassion of blessed buddhas predicts beings to awakening.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ བྱང་ཆུབ་ ཏུ་ ལུང་སྟོན་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: The compassion of śrāvakas relies on love.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ བྱམས་པ་ ལ་ ལྟོས་པ་ -འོ་ ། །

source: The compassion of bodhisattvas relies on bringing beings to maturity.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ་ ལ་ ལྟོས་པ་ -འོ་ ། །

source: The great compassion of blessed buddhas relies on bringing them to full maturity.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ ཤིན་ཏུ་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱ་བ་ ལ་ ལྟོས་པ་ -འོ་ ། །

source: “The compassion of śrāvakas is discouraged by effort.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ཆེན་པོ་ ནི་ རྩོམ་པ་ -ས་ ཡོངས་སུ་ སྐྱོ་བ་ -འོ་ ། །

source: The compassion of bodhisattvas brings undertakings to completion.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྙིང་རྗེ་ ནི་ རྩོམ་པ་ ཉམས་ འོག་ ཏུ་ ཆུད་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: The compassion of blessed buddhas brings success in all undertakings.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ རྩོམ་པ་ ཐམས་ཅད་ ཉམས་ འོག་ ཏུ་ ཆུད་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: “Therefore, son of noble family, the great compassion of the blessed buddhas is supreme because buddhas dwell for eons, hundreds of eons, thousands of eons, or hundreds of thousands of eons in order to tame beings. For so long as they do, they do not pass away into nirvāṇa.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ ན་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ མཆོག་ ཡིན་ ཏེ་ ། གང་ གི་ ཕྱིར་ སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ -འི་ ཆེད་ དུ་ བསྐལ་པ་ -འམ་ ། བསྐལ་པ་ བརྒྱ་ -འམ་ ། བསྐལ་པ་ སྟོང་ ངམ་ ། བསྐལ་པ་ བརྒྱ་ ཕྲག་ སྟོང་ དུ་ གནས་ ཀྱང་ དེ་སྲིད་ ཤིན་ཏུ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ས་ ཡོངས་སུ་ མྱ་ངན་ ལས་མི་ འདའ་ -འོ་ ། །

source: Son of noble family, you should understand this through this discourse.
bo: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ རྣམ་ གྲངས་ འདི་ -ས་ ཀྱང་ འདི་ལྟར་ རིག་པ་ -ར་ བྱ་ -འོ་ ། །

source: “Son of noble family, in the past, innumerable beyond countless eons ago, in an eon known as Most Fragrant, in a world realm known as Fragrant, there appeared a tathāgata, an arhat, a completely and perfectly awakened buddha known as Sandalwood Dwelling.
bo: རིགས་ ཀྱི་ བུ་ སྔོན་བྱུང་བ་ འདས་པ་ -འི་ དུས་ ན་ བསྐལ་པ་ གྲངས་མེད་པ་ བས་ ཀྱང་ ཆེས་ གྲངས་མེད་པ་ -ར་ གྱུར་པ་ དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ ། དྲི་མཆོག་ གི་ བསྐལ་པ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་ལྡན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཙན་དན་ ཁྱིམ་ ཞེས་ བྱ་བ་

source: He was endowed with perfect knowledge and perfect conduct, a sugata, a world knower, an unsurpassed charioteer of those to be tamed, a teacher of gods and humans, a buddha, a blessed one.
bo: རིག་པ་ དང་ ཞབས་ སུ་ ལྡན་པ་ ། བདེ་བ་ -ར་ གཤེགས་པ་ ། འཇིག་རྟེན་ མཁྱེན་པ་ ། སྐྱེས་བུ་ འདུལ་བ་ -འི་ ཁ་ལོ་ སྒྱུར་བ་ བླ་ ན་ མེད་པ་ ། ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ སྟོན་པ་ ། སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ ། །

source: The lifespan of the Blessed Tathāgata Sandalwood Dwelling reached sixteen times eighty-four thousand years.
bo: བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ -འི་ ཚེ་ -འི་ ཚད་ ནི་ ལོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ཕྲག་ བཅུ་དྲུག་ ཐུབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: His śrāvaka entourage consisted of sixteen times eighty-four thousand śrāvakas.
bo: དེ་ -འི་ ཉན་ཐོས་ ཀྱི་ འདུས་པ་ ནི་ ཉན་ཐོས་ བརྒྱད་ཅུ་ རྩ་ བཞི་ ཕྲག་ བཅུ་དྲུག་ གོ་ ། །

source: “The sweet fragrance coming from one of the pores of his skin suffused the billionfold universe with sweet-smelling fragrance.
bo: བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ -འི་ སྤུ་ -འི་ ཁུང་བུ་ གཅིག་ ནས་ དྲི་ -འི་ ངད་ བྱུང་བ་ གང་ཡིན་པ་ དེ་ -ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ -ར་ དྲི་ཞིམ་པོ་ -འི་ དྲི་ -ར་ བྱེད་ དོ་ ། །

source: No foul smell arose in that world.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ དྲི་ང་བ་ འབྱུང་བ་ མེད་ དོ་ ། །

source: In that world, furthermore, the fences, trees, mountains, and material forms that appeared were enveloped in the fragrance of that tathāgata.
bo: ཡང་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ རྩིག་པ་ དང་ ། ཤིང་ དང་ ། རི་ དང་ ། གཟུགས་ སྣང་བ་ རྣམས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དྲི་ དེ་ -ས་ ཡོངས་སུ་ བསྒོས་པ་ -ར་ གྱུར་ ཏེ་ །

source: That is how it became known as Fragrant.
bo: དེས་ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ དྲི་ལྡན་ ཞེས་ བྱ་ -འོ་ ། །

source: “Through the fragrance of the Tathāgata, despicable physical, verbal, and mental actions disappeared from the beings born in that realm.
bo: སེམས་ཅན་ གང་དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ -ར་ སྐྱེས་པ་ -ར་ གྱུར་པ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དྲི་ དེ་ -ས་ ལུས་ དང་ ། ངག་ དང་ ། ཡིད་ ཀྱི་ སྤྱོད་པ་ ཁ་ན་མ་ཐོ་བ་ མེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: When they smelled that fragrance, those who went forth into the religious life following the Dharma of that blessed one generated the four concentrations.
bo: སེམས་ཅན་ གང་དག་ བཅོམ་ལྡན་འདས་ དེ་ -འི་ བསྟན་པ་ ལ་ རབ་ཏུ་ བྱུང་བ་ དེ་དག་ ཀྱང་ ། དྲི་ དེ་ བསྣམས་པ་ -ས་ བསམ་གཏན་ བཞི་ དག་ བསྐྱེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: In that realm, ten thousand buddhas emerged simultaneously, all of them named Sandalwood Dwelling.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ -ར་ སངས་རྒྱས་ སྟོང་ཕྲག་ བཅུ་ ཅིག་ ཆ་ -ར་ བྱུང་བ་ -ར་ གྱུར་ ཏེ་ ། ཐམས་ཅད་ ཀྱང་ འདི་ལྟར་ ཙན་དན་ ཁྱིམ་ ཞེས་ བྱ་བ་ -ར་ མིང་ འཐུན་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: That is how the eon came to be called Most Fragrant.
bo: དེས་ན་ བསྐལ་པ་ དེ་ དྲི་མཆོག་ ཅེས་ བྱ་ -འོ་ ། །

source: “The Blessed Tathāgata Sandalwood Dwelling performed his buddha activity, and at the time of passing into nirvāṇa he beheld the disposition of a being who was trainable by a buddha and who was known as Trainable by Me.
bo: བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ -ས་ སངས་རྒྱས་ ཀྱི་ མཛད་པ་ མཛད་ ནས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ དུས་ ཀྱི་ ཚེ་ སེམས་ཅན་ སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ གང་ཞིག་ ངས་ གདུལ་བ་ -ར་ བྱ་ ཞེས་

source: The buddha saw with pure divine vision surpassing human sight that this one being among the gods in the Sphere of neither Perception nor Nonperception who had previously cultivated roots of virtue, who was devoted to the vast, and who was tamable by a buddha would remain there for eighty-four thousand eons.
bo: སེམས་ཅན་ གྱི་ ཁམས་ ལ་ རྣམ་པ་ -ར་ གཟིགས་ ནདེས་ ལྷ་ -འི་ སྤྱན་ རྣམ་པ་ -ར་ དག་པ་ མི་ -འི་ ལས་ འདས་པ་ -ས་ ། འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ གྱི་ ལྷ་ -འི་ ནང་ ན་ སེམས་ཅན་ སྔོན་ དགེ་བ་ -འི་ རྩ་བ་ བསྐྱེད་པ་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ ། སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ གཅིག་ཅིག་ དེ་ -ར་ བསྐལ་པ་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ རྩ་ བཞི་ -ར་ གནས་ ནས

source: Once he died and was reborn as a human, if he heard praise of the Great Vehicle instead of enjoying sense desires, he would generate the thought of unsurpassed perfect awakening and become someone who would not be turned back from unsurpassed perfect awakening.
bo: དེ་ནས་ ཤི་འཕོས་ ཏེ་ མི་ རྣམས་ དང་ སྐལ་བ་ མཉམ་པ་ -ར་ སྐྱེ་ ཞིང་ ། གལ་ཏེ་ འདོད་པ་ རྣམས་ ལ་མ་ རྩེས་པ་ -ར་ ཐེག་པ་ ཆེན་པོ་ -འི་ བསྔགས་པ་ ཐོས་པ་ ལྟ་ ན་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་ སྐྱེད་པ་ -ར་ འགྱུར་ ། བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ལས་ ཕྱིར་ མི་ ལྡོག་པ་ -ར་ འགྱུར་བ་ ཞིག་ གཟིགས་ སོ་ ། །
