Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: Because there was already depletion before that depletion was taught.
bo: སྔོན་ ནས་ ཟད་པ་ -ས་ དེ་ཕྱིར་ ཟད་ ཅེས་ བསྟན་ ། །

source: That which is depleted is unconditioned
bo: ཟད་པ་ གང་ཡིན་ དེ་ ནི་ འདུས་མ་བྱས་ ། །

source: And is therefore not something that possesses the three characteristics.
bo: དེ་ ལ་ མཚན་ཉིད་གསུམ་ ནི་ ཡོད་ མ་ ཡིན་ ། །

source: “ ‘The realm of phenomena endures without change.
bo: དབྱིངས་ དེ་ གནས་པ་ ཡིན་ ཏེ་ འགྱུར་བ་ མེད་ ། །

source: With perfected faculties phenomena are known.
bo: དབང་ གི་ ཕ་རོལ་ སོན་པ་ -ས་ ཆོས་ རྣམས་ མཁྱེན་ ། །

source: Knowing them, they teach the Dharma accordingly.
bo: དེ་དག་ ཤེས་ ནས་ དེ་བཞིན་ ཆོས་སྟོན་ ཏེ་ ། །

source: This is the twelfth activity of the victors.’
bo: འདི་ ནི་ རྒྱལ་བ་ -འི་ འཕྲིན་ལས་ བཅུ་གཉིས་པ་ ། །

source: “Son of noble family, the tathāgatas know in accordance with reality which obstructing factors obstruct. No one in the world with its gods is able to reasonably reprove the tathāgatas, saying, ‘Those factors do not obstruct.’
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བར་ དུ་ གཅོད་པ་ -འི་ ཆོས་ རྣམས་ མཚུངས་པ་ -ར་ བར་ དུ་ གཅོད་པ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་པ་ དེ་ ལ་ ལྷ་ དང་ བཅས་པ་ -འི་ འཇིག་རྟེན་ གང་ གིས་ ཀྱང་ ཆོས་ འདི་དག་ བར་ དུ་ གཅོད་པ་ -ར་ མི་ འགྱུར་ རོ་ ཞེས་ ཆོས་ དང་ འཐུན་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ རྒོལ་ མི་ ནུས་ སོ་ ། །

source: What are the obstructing factors?
bo: དེ་ ལ་བ་ -ར་ དུ་ གཅོད་པ་ -འི་ ཆོས་ རྣམས་ གང་ཞེ་ན་ །

source: There is one [obstructing factor]: a mind that lacks faith.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ གཅིག་ སྟེ་ ། གཅིག་ གང་ཞེ་ན་ འདི་ལྟ་སྟེ་ ། དང་བ་ མེད་པ་ -འི་ སེམས་ སོ་ ། །

source: There are two [obstructing factors]: immodesty and impropriety.
bo: བར་ དུ་ གཅོད་པ་ -འི་ ཆོས་ གཉིས་ ཏེ་ ། གཉིས་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ངོ་ཚ་ མི་ ཤེས་པ་ དང་ ། ཁྲེལ་མེད་པ་ -འོ་ ། །

source: There are three [obstructing factors]: misconduct of body, speech, and mind.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ གསུམ་ སྟེ་ ། གསུམ་ གང་ཞེ་ན་ འདི་ལྟ་སྟེ་ ། ལུས་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ དང་ ། ངག་ གིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ དང་ ། ཡིད་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ སྟེ་ ། གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: There are four [obstructing factors]: going wrong because of desire, aversion, delusion, or fear.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ བཞི་ སྟེ་ ། བཞི་ གང་ཞེ་ན་ འདི་ལྟ་སྟེ་ ། འགྲོ་བ་ མ་ཡིན་པ་ -ར་ འགྲོ་བ་ བཞི་ སྟེ་ ། འདུན་པ་ -ས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ འགྲོ་བ་ དང་ ། ཞེ་སྡང་ གིས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ འགྲོ་བ་ དང་ ། གཏི་མུག་ གིས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ འགྲོ་བ་ དང་ ། འཇིགས་པ་ -ས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ འགྲོ་བ་ སྟེ་ ། བཞི་པོ་ འདི་དག་ གོ་ ། །

source: There are five [obstructing factors]: killing, stealing, sexual misconduct, lying, and consuming intoxicants.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ ལྔ་ སྟེ་ ། ལྔ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྲོག་གཅོད་པ་ དང་ ། མ་ བྱིན་པ་ -ར་ ལེན་པ་ དང་ ། འདོད་པ་ ལ་ ལོག་པ་ -ར་ གཡེམ་པ་ དང་ ། བརྫུན་ དུ་ སྨྲ་བ་ དང་ ། ཆང་ འཐུང་བ་ སྟེ་ ། ལྔ་པོ་ འདི་དག་ གོ་ ། །

source: There are six [obstructing factors]: irreverence toward the Buddha, the Dharma, and the Saṅgha and irreverence toward the training, meditative absorption, and the meditation cushion.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ དྲུག་ སྟེ་ ། དྲུག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སངས་རྒྱས་ ལ་མ་ གུས་པ་ ཡིན་ ། ཆོས་ ལ་མ་ གུས་པ་ ཡིན་ ། དགེ་འདུན་ ལ་མ་ གུས་པ་ ཡིན་ ། བསླབ་པ་ ལ་མ་ གུས་པ་ ཡིན་ ། ཏིང་ངེ་འཛིན་ ལ་མ་ གུས་པ་ ཡིན་ ། གདིང་བ་ ལ་མ་ གུས་པ་ ཡིན་ ཏེ་ ། དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: There are seven [obstructing factors]: ordinary pride, the pride of superiority, excessive pride, the pride that thinks ‘I am,’ manifest pride, the inverted pride of self-abasement, and mistaken pride.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ བདུན་ ཏེ་ ། བདུན་ གང་ཞེ་ན་ འདི་ལྟ་སྟེ་ ། ང་རྒྱལ་ དང་ ། ཆེ་བ་ -འི་ ང་རྒྱལ་ དང་ ། ང་རྒྱལ་ ལས་ ཀྱང་ ང་རྒྱལ་ དང་ ། ང་ -འོ་ སྙམ་པ་ -འི་ ང་རྒྱལ་ དང་ ། མངོན་པ་ -འི་ ང་རྒྱལ་ དང་ ། ཆུང་ ཟད་ སྙམ་པ་ -འི་ ང་རྒྱལ་ དང་ ། ལོག་པ་ -འི་ ང་རྒྱལ་ ཏེ་ ། བདུན་པོ་ འདི་དག་ གོ་ ། །

source: There are eight [obstructing factors]: wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong absorption.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ བརྒྱད་ དེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ལོག་པ་ -འི་ ལྟ་བ་ དང་ ། ལོག་པ་ -འི་ རྟོག་པ་ དང་ ། ལོག་པ་ -འི་ ངག་ དང་ ། ལོག་པ་ -འི་ ལས་ ཀྱི་ མཐའ་ དང་ ། ལོག་པ་ -འི་ འཚོ་བ་ དང་ ། ལོག་པ་ -འི་ རྩོལ་བ་ དང་ ། ལོག་པ་ -འི་ དྲན་པ་ དང་ ། ལོག་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཏེ་ ། བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: There are nine [obstructing factors]:
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ དགུ་སྟེ་ ། དགུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ །

source: giving rise to miserable states of mind such as ‘I was harmed,” ‘I am being harmed,’ or ‘I will be harmed’;
bo: བདག་ ལ་ གནོད་པ་ བྱས་ སོ་ བྱེད་ དོ་ ། ། བྱེད་པ་ -ར་ འགྱུར་ རོ་ ཞེས་ ཀུན་ ནས་ མནར་སེམས་ ཀྱི་ སེམས་ སྐྱེད་པ་ དང་ །

source: giving rise to miserable states of mind such as ‘My friends were harmed,’ ‘They are being harmed,’ or ‘They will be harmed’;
bo: བདག་ གི་ མཛའ་བོ་ གང་ཡིན་པ་ དེ་ ལ་ གནོད་པ་ བྱས་ སོ་ ། ། བྱེད་ དོ་ ། ། བྱེད་པ་ -ར་ འགྱུར་ རོ་ ཞེས་ ཀུན་ ནས་ མནར་སེམས་ ཀྱི་ སེམས་ སྐྱེད་པ་ དང་ །

source: and giving rise to miserable states of mind such as ‘Those who are not my friends have benefited,’ ‘They are benefitting,’ or ‘They will benefit.’
bo: བདག་ དང་ མི་ མཛའ་བ་ གང་ཡིན་པ་ དེ་ -འི་ དོན་ བྱས་ སོ་ ། ། བྱེད་ དོ་ ། ། བྱེད་པ་ -ར་ འགྱུར་ རོ་ ཞེས་ ཀུན་ ནས་ མནར་སེམས་ ཀྱི་ སེམས་ སྐྱེད་པ་ སྟེ་ དགུ་པོ་ འདི་དག་ གོ་ ། །

source: There are ten [obstructing factors]:
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ བཅུ་ སྟེ་ ། བཅུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ །

source: the ways of the ten nonvirtuous actions of killing, stealing, and sexual misconduct, lying, slander, harsh words, and idle chatter, and covetousness, maliciousness, and wrong views.
bo: མི་དགེ་བ་ བཅུ་ -འི་ ལས་ ཀྱི་ ལམ་ རྣམས་ ཡིན་ ནོ་ ། ། བཅུ་ གང་ཞེ་ན་ འདི་ལྟ་སྟེ་ ། སྲོག་གཅོད་པ་ དང་ ། མ་ བྱིན་པ་ -ར་ ལེན་པ་ དང་ ། འདོད་པ་ ལ་ ལོག་པ་ -ར་ གཡེམ་པ་ དང་ ། བརྫུན་ དུ་ སྨྲ་བ་ དང་ ། ཕྲ་མ་ དང་ ། ངག་ རྩུབ་པོ་ དང་ ། ཚིག་ཀྱལ་པ་ དང་ ། བརྣབ་སེམས་ དང་ ། གནོད་སེམས་ དང་ ། ལོག་པ་ -ར་ ལྟ་བ་ སྟེ་ །

source: “Tathāgatas know the following to be obstructing factors: becoming engrossed in the taste of factors that are entangled with incorrect mental activity, being mistaken, being ensnared by obscurations, and being disordered by clinging to existence and to views, as well as any physical, verbal, or mental acts encumbered by the aggregates.
bo: ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ དང་ ལྡན་པ་ -འི་ ཀུན་ དུ་ སྦྱོར་བ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ རྣམས་ རོ་མྱང་བ་ ལ་ རྗེས་སུ་ ལྟ་ ཞིང་ གནས་པ་ དང་ ། ཕྱིན་ ཅི་ ལོག་ དང་ ལྡན་པ་ དང་ ། སྒྲིབ་པ་ -ས་ ཀུན་ ནས་ དཀྲིས་པ་ དང་ ། སྲིད་པ་ དང་ ལྟ་བ་ ལ་ མངོན་པར་ ཞེན་པ་ -འི་ ཟང་ཟིང་ དང་ བཅས་པ་ དང་ ། ཕུང་པོ་ དང་ བཅས་པ་ -འི་ ལུས་ ཀྱི་ ལས་ དང་ ། ངག་གི་ལས་ དང་ ། ཡིད་ ཀྱི་ ལས་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ བར་ དུ་ གཅོད་པ་ -འི་ ཆོས་ སུ་ ། དེ་བཞིན་ གཤེགས་པ་ -ས་ མཁྱེན་ ཅིང་

source: Declaring, ‘These are obstructing factors,’ they teach them as such, in accordance with reality.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་ རོ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ དེ་བཞིན་ དུ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སྟོན་ ཏེའདི་ དག་ ནི་ བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ རྣམས་ སོ་ ། །

source: The tathāgatas teach the Dharma in order that these obstructing factors are pacified, calmed, and abandoned.
bo: བར་ དུ་ གཅོད་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ དེ་དག་ ཞི་བ་ -ར་ བྱ་བ་ དང་ ། ཉེ་བར་ ཞི་བ་ -ར་ བྱ་བ་ དང་ ། སྤང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ། དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་སྟོན་ ཏེ་ །

source: This is the thirteenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་གསུམ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Those who rely on factors realized by the victors as obstructing Will not attain liberation:
bo: རྒྱལ་བ་ ཡིས་ ནི་ ཆོས་ གང་ རྗེས་ རྟོགས་པ་ ། ། དེ་དག་ བསྟེན་ ན་ རྣམ་པ་ -ར་ གྲོལ་ མི་ འཐོབ་ ། །

source: Discarding devotion
bo: གང་ ལ་ དད་པ་ སྤང་བ་ ཡོད་པ་ དང་ ། །

source: And lacking the slightest modesty or propriety,
bo: གང་ ལ་ ངོ་ཚ་ ཁྲེལ་ ལྟས་ ཆུང་ ཟད་ མེད་ ། །

source: “ ‘Likewise having no restraint whatsoever In body, speech, and mind, Having desire, aversion, and delusion, Killing and destroying the property of others,
bo: དེ་བཞིན་ ལུས་ དང་ ངག་ དང་སེམས་ སྡོམ་པ་ ། ། གང་དག་ ལ་ ནི་ ནམ་ཡང་ མེད་པ་ དང་ ། ། འདུན་པ་ དང་ ནི་ ཞེ་སྡང་ གཏི་མུག་ ནས་ ། ། སྲོག་གཅོད་ གཞན་ གྱི་ ལོངས་སྤྱོད་ འཇིག་པ་ -འི་ བདག་ །

source: “ ‘Taking another’s wife, lying, or consuming intoxicants,
bo: གཞན་ གྱི་ ཆུང་མ་ བརྫུན་ སྨྲ་ དེ་བཞིན་ ཆང་ ། །

source: Lacking the six kinds of reverence and having the seven kinds of pride, And engaging in the eight kinds of misdeeds— These all obstruct the path to liberation.
bo: མ་ གུས་ དྲུག་པོ་ དག་ དང་ ང་རྒྱལ་ བདུན་ ། ། ལོག་པ་ བརྒྱད་ ནི་ གང་ཡིན་ དེ་དག་ ཀྱང་ ། ། ཐམས་ཅད་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ལམ་ གྱི་ བགེགས་ ། །

source: “ ‘The miserable states of mind said to be ninefold,
bo: ཀུན་ ནས་ མནར་སེམས་ དངོས་པོ་ དགུ་ -ར་ གསུངས་ དང་ ། །

source: The ways of the ten nonvirtuous actions—
bo: མི་དགེ་ བཅུ་པོ་ -འི་ ལས་ ཀྱི་ ལམ་ རྣམས་ དང་ ། །

source: For those who lack any propriety,
bo: གང་ཡང་ ཚུལ་བཞིན་ མི་ ལྡན་ དེ་དག་ ལ་ ། །

source: There will never be superknowledge or liberation.
bo: མངོན་པར་ ཤེས་ དང་ ཐར་པ་ ནམ་ཡང་ མེད་ ། །

source: “ ‘To those who are encumbered by being mistaken,
bo: དེ་དག་ ཕྱིན་ ཅི་ ལོག་ དང་ ལྡན་པ་ དང་ ། །

source: Who cling to extremes and hold on to what is unreal,
bo: མཐ་ -ར་ ཞེན་ ཡང་དག་ མ་ ཡིན་ ཆགས་ རིག་ ནས་ ། །

source: The victorious lords teach out of benevolence So that these beings may know and abandon those factors.’
bo: ཆོས་ རྣམས་ འདི་དག་ རྣམ་པ་ -ར་ སྤང་བ་ -འི་ ཕྱིར་ ། ། རྒྱལ་བ་ དབང་པོ་ བྱམས་པ་ -ས་ འཆད་པ་ མཛད་ ། །

source: “Son of noble family, the tathāgatas know, in accordance with reality, the noble path of deliverance as a noble path of deliverance, which eliminates created suffering. Beings will be delivered if they rely on it, and no one in the world with its gods is able to reasonably reprove the tathāgatas, saying, ‘This is not a path of deliverance.’
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ འཕགས་པ་ -འི་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ ནི་ དེ་ བྱེད་པ་ -འི་ སྡུག་བསྔལ་ ཡང་དག་པ་ -ར་ ཟད་པར་ འགྱུར་བ་ -འི་ འཕགས་པ་ -འི་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ དུ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏེདེ་ ལ་ བསྟེན་ ན་ སེམས་ཅན་ རྣམས་ ངེས་པར་ འབྱུང་བ་ དེ་ ལ་ ལྷ་ དང་ བཅས་པ་ -འི་ འཇིག་རྟེན་ གང་ གིས་ ཀྱང་ འདི་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ མ་ ཡིན་ ནོ་ ཞེས་ ཆོས་ དང་ འཐུན་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ རྒོལ་ མི་ ནུས་ སོ་ ། །

source: What, then, is the path of deliverance?
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གང་ཞེ་ན་ །

source: It is the single path for sentient beings to travel that leads to purification.
bo: འདི་ལྟ་སྟེ་ ། སེམས་ཅན་ རྣམས་ རྣམ་པ་ -ར་ དག་པ་ -ར་ འགྱུར་བ་ -འི་ བགྲོད་པ་ གཅིག་པུ་ -འི་ ལམ་ མོ་ ། །

source: “There are two factors of the path of deliverance: tranquil abiding and special insight.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ གཉིས་ ཏེ་ ། གཉིས་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཞི་གནས་ དང་ ། ལྷག་མཐོང་ ངོ་ ། །

source: There are three: emptiness, signlessness, and wishlessness.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ གསུམ་ སྟེ་ ། གསུམ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྟོང་པ་ཉིད་ དང་ ། མཚན་མ་ མེད་པ་ དང་ ། སྨོན་པ་ མེད་པ་ སྟེ་ ། གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: There are four factors of the path of deliverance: mindfulness of body, mindfulness of feeling, mindfulness of mind, and mindfulness of phenomena.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ བཞི་ སྟེ་ ། བཞི་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ལུས་ སུ་ གཏོགས་པ་ -འི་ དྲན་པ་ དང་ ། ཚོར་བ་ -ར་ གཏོགས་པ་ དང་ ། སེམས་ སུ་ གཏོགས་པ་ དང་ ། ཆོས་ སུ་ གཏོགས་པ་ -འི་ དྲན་པ་ སྟེ་ །

source: There are applications of mindfulness of the body where one contemplates what is inside the body, what is on the outside of the body, and both together.
bo: དེ་ ལ་ ནང་ གི་ ལུས་ ལ་ ལུས་ ཀྱི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ དང་ ། ཕྱི་ -འི་ ལུས་ ལ་ ལུས་ ཀྱི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ དང་ ། ནང་ དང་ ཕྱི་ -འི་ ལུས་ ལ་ ལུས་ ཀྱི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ དང་ །

source: There are applications of mindfulness of sensation where one contemplates inner sensations, outer sensations, and both together.
bo: ནང་ གི་ ཚོར་བ་ དང་ ། ཕྱི་ -འི་ ཚོར་བ་ དང་ ། ནང་ དང་ ཕྱི་ -འི་ ཚོར་བ་ ལ་ ཚོར་བ་ -འི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ དང་ །

source: There are applications of mindfulness of mind where one contemplates the introverted mind, the extroverted mind, and both together.
bo: ནང་ གི་ སེམས་ དང་ ། ཕྱི་ -འི་ སེམས་ དང་ ། ནང་ དང་ ཕྱི་ -འི་ སེམས་ ལ་ སེམས་ ཀྱི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ དང་ །

source: Finally, there are applications of mindfulness of phenomena where one contemplates inner factors, outer factors, and both together.
bo: ནང་ གི་ ཆོས་ དང་ ། ཕྱི་ -འི་ ཆོས་ དང་ ། ནང་ དང་ ཕྱི་ -འི་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ རྗེས་སུ་ ལྟ་བ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ སྟེ་ །

source: There are five factors of the path of deliverance: the spiritual faculties of faith, vigor, mindfulness, meditative absorption, and insight.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ ལྔ་ སྟེ་ ། ལྔ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དད་པ་ -འི་ དབང་པོ་ དང་ ། བརྩོན་འགྲུས་ ཀྱི་ དབང་པོ་ དང་ ། དྲན་པ་ -འི་ དབང་པོ་ དང་ ། ཏིང་ངེ་འཛིན་ གྱི་ དབང་པོ་ དང་ ། ཤེས་རབ་ ཀྱི་ དབང་པོ་ སྟེ་ ། ལྔ་པོ་ འདི་དག་ གོ་ ། །

source: There are six factors of the path of deliverance: the recollection of the Buddha, the Dharma, the Saṅgha, renunciation, morality, and the gods.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ དྲུག་ སྟེ་ ། དྲུག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སངས་རྒྱས་ རྗེས་སུ་ དྲན་པ་ དང་ ། ཆོས་རྗེ་ -ས་ སུ་ དྲན་པ་ དང་ ། དགེ་འདུན་ རྗེས་སུ་ དྲན་པ་ དང་ ། གཏོང་བ་ རྗེས་སུ་ དྲན་པ་ དང་ ། ཚུལ་ཁྲིམས་ རྗེས་སུ་ དྲན་པ་ དང་ ། ལྷ་རྗེ་ -ས་ སུ་ དྲན་པ་ སྟེ་ དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: There are seven factors of the path of deliverance: the factors of awakening, which are correct mindfulness, correct investigation of phenomena, correct vigor, correct joy, correct pliancy, correct meditative absorption, and the factor of awakening that is correct equanimity.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ བདུན་ ཏེ་ ། བདུན་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དྲན་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཆོས་ རྣམ་པ་ -ར་ འབྱེད་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། བརྩོན་འགྲུས་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། དགའ་བ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཤིན་ཏུ་ སྦྱངས་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཏིང་ངེ་འཛིན་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། བཏང་སྙོམས་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ སྟེ་ ། བདུན་པོ་ འདི་དག་ གོ་ ། །

source: There are eight factors of the path of deliverance: correct view, correct intention, correct speech, correct action, correct livelihood, correct effort, correct mindfulness, and correct meditative absorption.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ བརྒྱད་ དེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཡང་དག་པ་ -འི་ ལྟ་བ་ དང་ ། ཡང་དག་པ་ -འི་ རྟོག་པ་ དང་ ། ཡང་དག་པ་ -འི་ ངག་ དང་ ། ཡང་དག་པ་ -འི་ ལས་ ཀྱི་ མཐའ་ དང་ ། ཡང་དག་པ་ -འི་ འཚོ་བ་ དང་ ། ཡང་དག་པ་ -འི་ རྩོལ་བ་ དང་ ། ཡང་དག་པ་ -འི་ དྲན་པ་ དང་ ། ཡང་དག་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཏེ་ ། བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: There are nine factors of the path of deliverance: the first, second, third, and fourth concentrations, the attainments of the absorptions of infinite space, consciousness, nothingness, and neither perception nor nonperception, and the attainment of the cessation of perception and feeling.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ དགུ་སྟེ་ ། དགུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། བསམ་གཏན་ དང་པོ་ དང་ ། བསམ་གཏན་ གཉིས་པ་ དང་ ། བསམ་གཏན་ གསུམ་པ་ དང་ ། བསམ་གཏན་ བཞི་པ་ དང་ ། ནམ་མཁའ་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ ཀྱི་ སྙོམས་པར་ འཇུག་པ་ དང་ ། རྣམ་ཤེས་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ ཀྱི་ སྙོམས་པར་ འཇུག་པ་ དང་ ། ཅི་ཡང་ མེད་པ་ -འི་ སྐྱེ་མཆེད་ ཀྱི་ སྙོམས་པར་ འཇུག་པ་ དང་ ། འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ སྐྱེ་མཆེད་ ཀྱི་ སྙོམས་པར་ འཇུག་པ་ དང་ ། འདུ་ཤེས་ དང་ ཚོར་བ་ འགོག་པ་ -འི་ སྙོམས་པར་ འཇུག་པ་ སྟེ་ ། དགུ་པོ་ འདི་དག་ གོ་ ། །

source: There are ten factors of the path of deliverance.
bo: ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ གྱི་ ཆོས་ བཅུ་ སྟེ་ །

source: What are they?
bo: བཅུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ །

source: They are the ways of the ten virtuous actions.
bo: དགེ་བ་ བཅུ་ -འི་ ལས་ ཀྱི་ ལམ་ རྣམས་ སོ་ ། །

source: What are these?
bo: དེ་དག་ ཀྱང་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ །

source: They are giving up killing, stealing, sexual misconduct, lying, slander, harsh words, idle chatter, covetousness, maliciousness, and wrong views.
bo: སྲོག་གཅོད་པ་ སྤོང་བ་ དང་ ། མ་ བྱིན་པ་ -ར་ ལེན་པ་ སྤོང་བ་ དང་ ། འདོད་པ་ ལ་ ལོག་པ་ -ར་ གཡེམ་པ་ སྤོང་བ་ དང་ ། བརྫུན་ དུ་ སྨྲ་བ་ སྤོང་བ་ དང་ ། ཕྲ་མ་ སྤོང་བ་ དང་ ། ངག་ རྩུབ་པོ་ སྤོང་བ་ དང་ ། ཚིག་ཀྱལ་པ་ སྤོང་བ་ དང་ ། བརྣབ་སེམས་ སྤོང་བ་ དང་ ། གནོད་སེམས་ སྤོང་བ་ དང་ ། ལོག་པ་ -ར་ ལྟ་བ་ སྤོང་བ་ སྟེ་ །

source: These are the ten factors that constitute the path of deliverance.
bo: ངེས་པར་ འབྱེད་པ་ -འི་ ལམ་ གྱི་ ཆོས་ བཅུ་པོ་ འདི་དག་ གོ་ ། །

source: “Thus, the virtuous factors of awakening, whether they belong to the category of moral conduct, meditative absorption, or insight, or whether they belong to the category of liberation, the insight of liberating wisdom, or the noble truths, are said to constitute the path of deliverance.
bo: དེ་ལྟར་ ཇི་ཙམ་ བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ དགེ་བ་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕུང་པོ་ དང་ ལྡན་པ་ -འམ་ ། ཏིང་ངེ་འཛིན་ གྱི་ ཕུང་པོ་ དང་ ལྡན་པ་ -འམ་ ། ཤེས་རབ་ ཀྱི་ ཕུང་པོ་ དང་ ལྡན་པ་ -འམ་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ཕུང་པོ་ དང་ ལྡན་པ་ -འམ་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ -འི་ ཕུང་པོ་ དང་ ལྡན་པ་ -འམ་ ། འཕགས་པ་ -འི་ བདེན་པ་ དང་ ལྡན་པ་ དེ་ཡང་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ ཞེས་ བྱ་ -འོ་ ། །

source: “Moreover, the path of deliverance is to be correctly accomplished.
bo: གཞན་ ཡང་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ ཞེས་ བྱ་བ་ ནི་ གང་ཡང་ ཡང་དག་པ་ -ར་ སྒྲུབ་པ་ -འོ་ ། །

source: Correct accomplishment is the absence of the factors of accumulating or not accumulating, accepting or rejecting, and appropriating or abandoning.
bo: ཡང་དག་པ་ -ར་ སྒྲུབ་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ སོགས་པ་ -འམ་ ། མི་ སོགས་པ་ -འམ་ ། བླང་བ་ -འམ་ ། དོར་བ་ -འམ་ ། གཟུང་བ་ -འམ་ ། སྤོང་བ་ -འི་ ཆོས་ གང་ཡང་ མེད་ དོ་ ། །

source: Why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The correct approach is not to engage the mind in duality.
bo: ཡང་དག་པ་ -ར་ ཞུགས་པ་ ནི་ གཉིས་ ལ་ བློ་ མི་ འཇུག་ སྟེ་ །

source: “Seeing with wisdom all phenomena in a nondual manner and in accordance with reality is the path of deliverance.
bo: ཆོས་ ཐམས་ཅད་ གཉིས་ སུ་ མེད་པ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཡེ་ཤེས་ ཀྱིས་ མཐོང་བ་ ནི་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ སྟེ་ །

source: The tathāgatas teach this path of deliverance to sentient beings.
bo: དེ་བཞིན་ གཤེགས་པ་ ངེས་པར་ འབྱུང་བ་ -འི་ ལམ་ དེ་ སེམས་ཅན་ རྣམས་ ལ་ ཡང་དག་པ་ -ར་ སྟོན་ ཏོ་ ། །

source: When they rely on it, sentient beings are delivered, since created suffering is truly eliminated.
bo: དེ་ ལ་ སྟེན་ ན་ ། དེ་ བྱེད་པ་ -འི་ སྡུག་བསྔལ་ ཡང་དག་པ་ -ར་ ཟད་པར་ འགྱུར་བ་ -འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ངེས་པར་ འབྱུང་ སྟེ་ །

source: This is the fourteenth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་བཞི་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Those who have been purified will gain immeasurable bliss.
bo: གང་ སྦྱངས་ བདེ་བ་ ཚད་ མེད་ འགྱུར་བ་ དང་ །

source: If people rely on this path, they will experience peace.
bo: གང་ བསྟེན་པ་ -ས་ ན་ མི་ -ས་ ནི་ ཞི་ རིག་པ་ ། །

source: The victors know all.
bo: ཐམས་ཅད་ རྒྱལ་བ་ -ས་ མཁྱེན་ ཏེ་

source: Learning and knowing by themselves, they teach the Dharma that leads to immortality.
bo: རང་ ཐོས་ ཤིང་ ། ། མཁྱེན་ ནས་ འཆི་མེད་ འགྲོ་བ་ -འི་ ཆོས་སྟོན་ ཏོ་ ། །

source: “ ‘If they attend to the virtues conducive to awakening, which are praised by the victors,
bo: རྒྱལ་བ་ -ས་ བསྔགས་པ་ དགེ་བ་ བྱང་ཆུབ་ ཕྱོགས་ ། །

source: All the many virtuous factors that there are,
bo: དགེ་ཆོས་ མང་པོ་ ཇི་སྙེད་ ཡོད་པ་ དག་ །

source: There is no way for the intelligent Not to be liberated—so the Sugata has explained.
bo: བློ་གྲོས་ ཅན་ གྱིས་ བསྟེན་ ན་ མི་ འགྲོལ་བ་ -འི་ ། ། གནས་ མེད་ ཅེས་ ནི་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ བཤད་ ། །

source: “ ‘Those who are skilled in the true Dharma
bo: ཡང་དག་ ཆོས་ ལ་ མཁས་ དང་ ཡང་དག་ ལྡན་ ། །

source: Will pacify the mass of afflictive emotions accordingly.
bo: ཚུལ་བཞིན་ གྱིས་ ནི་ ཉོན་མོངས་ རྒྱ་ ཆེན་ ཞི་ ། །

source: Without clinging to non-Dharma or even to Dharma,
bo: ཆོས་ མིན་ མ་ ཞེན་ ཆོས་ ལ་ -འང་ མ་ཡིན་པ་ ། །

source: They will reach the peace of liberation that is free from all ills.
bo: དེ་ ནི་ རྣམ་གྲོལ་ ནད་མེད་ ཞི་ ལ་ རེག་ །

source: “ ‘Those who are skilled in the support consider that phenomena
bo: རྟེན་ ལ་ མཁས་པ་ གང་ཞིག་ ཆོས་ རྣམས་ ལ་ ། །

source: Are deceptive and fake and are like space—
bo: གསོབ་ གསོག་ ཡ་མ་བརླ་ དང་ མཁའ་ འདྲ་ དང་ ། །

source: They are like illusory forms and dreams.
bo: སྒྱུ་མ་ -འི་ གཟུགས་ མཚུངས་ རྨི་ལམ་ འདྲ་ -ར་ རྟོག་པ་ ། །

source: Thus they are liberated from the ocean of existence.
bo: དེ་ ནི་ སྲིད་པ་ -འི་ མཚོ་ ལས་ ཐར་བ་ -ར་ འགྱུར་ ། །

source: “ ‘The activity of the kings of sages, the capable ones,
bo: འདི་ ནི་ དྲང་སྲོང་ རྒྱལ་པོ་ ཐུབ་པ་ -འི་ ལས་ ། །

source: Once they have generated compassion,
bo: སྙིང་རྗེ་ བསྐྱེད་ ནས་ སྐྱེ་བོ་ མྱོས་པ་ དང་ ། །

source: Serves to liberate crazed beings from the wheel of existence.
bo: གང་ ཕྱིར་ སྲིད་པ་ -འི་ འཁོར་ལོ་ ལས་ འགྲོལ་བ་ ། །

source: Therefore they are uncorrupted.’
bo: དེ་ཕྱིར་ དེ་དག་ འདྲེ་བ་ མེད་པ་ ཡིན་ ། །

source: “Moreover, son of noble family, the tathāgatas are without bodily faults that could be reasonably objected to, such as the bodily faults that the immature or even the learned may possess.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ གང་ གི་ ཕྱིར་ དེ་ -འི་ ལུས་ འཁྲུལ་བ་ -ས་ བྱིས་པ་ -འམ་ ། མཁས་པ་ -ས་ ཀྱང་ རུང་ སྟེ་ ། ཆོས་ དང་ འཐུན་པ་ -ས་ རྒོལ་བ་ -ར་ འགྱུར་བ་ -འི་ འཁྲུལ་པ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The physical activity of the blessed buddhas is faultless.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ནི་ སྐུ་ -འི་ འཕྲིན་ལས་ འཁྲུལ་པ་ མེད་པ་ དང་ ལྡན་པ་ སྟེ་ །

source: They display beautiful comportment as they survey the world and behold their surroundings, when they bend and stretch their limbs, as they wear the religious garments consisting of the upper Dharma robe, the outer robe, and the lower robe, and as they hold the alms bowl. The soles of their feet do not touch the ground as they come and go, walk and stand, and sit and recline, or as they enter and depart houses, towns, and hamlets.
bo: ཀུན་ དུ་ གཟིགས་པ་ དང་ ། རྣམ་པ་ -ར་ གཟིགས་པ་ དང་ ། བསྐུམ་པ་ དང་ ། སྨྱང་བ་ དང་ ། ཆོས་གོས་ སྣམ་སྦྱར་ དང་ ། ཐང་བ་ དང་ ། ལྷུང་བཟེད་ དང་ ། ཆོས་གོས་ ཐོགས་པ་ -ས་ སྤྱོད་ལམ་ མཛེས་པ་ ། བཞུད་པ་ དང་ ། བྱོན་པ་ དང་ ། འཆག་པ་ དང་ ། བཞེངས་པ་ དང་ ། བཞུགས་པ་ དང་ ། གཟིམས་པ་ དང་ ། གྲོང་ དང་ ། གྲོང་ཁྱེར་ དང་ ། གྲོང་རྡལ་ དུ་ འཇུག་པ་ དང་ ། འབྱུང་བ་ ན་ ཞབས་ ཀྱི་ མཐིལ་ ས་ ལ་ མི་ རེག་ སྟེ

source: Instead, the tathāgatas’ feet step on thousand-spoked wheels that appear out of the ground, and on the lotus flowers with sweet fragrance that emerge.
bo: འཁོར་ལོ་ རྩིབས་ སྟོང་པ་ ས་ལས་ འབྱུང་ ཞིང་ དྲི་ ཡིད་ དུ་ འོང་བ་ -འི་ པད་མ་ མངོན་པར་ འབྱུང་ སྟེ་ ། དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཞབས་ འཇོག་ གོ་ ། །

source: Those sentient beings, born as animals, who touch the tathāgatas’ footprints experience bliss for a week.
bo: དེ་ ལ་ གང་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སོང་བ་ -འི་ སེམས་ཅན་ གང་དག་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཞབས་ ལ་ རེག་པ་ དེ་དག་ ཞག་ བདུན་ རབ་ཏུ་ བདེ་བ་ དང་ ལྡན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: After death, they will be reborn in the happy destinies of the higher realms.
bo: ཤི་འཕོས་ ན་ ཡང་ བདེ་འགྲོ་ མཐོ་རིས་ ཀྱི་ འཇིག་རྟེན་ དུ་ སྐྱེ་བ་ -ར་ འགྱུར་ རོ་ ། །

source: The tathāgatas’ religious garments do not actually touch their bodies by four finger lengths, but even so, a fierce wind will fail to make them disheveled.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ ལ་ ཆོས་གོས་ སོ་ -ར་ བཞི་ ཙམ་ གྱིས་ མི་ རེག་ མོད་ ཀྱི་ ། རྣམ་པ་ -ར་ འཐོར་རླུང་ གི་ རླུང་ གིས་ ཀྱང་ བཟློག་པ་ -ར་ མི་ ནུས་ སོ་ ། །

source: The radiance of their bodies arouses bliss in sentient beings as far as the lowest hell.
bo: སྐུ་ -འི་ འོད་ ཀྱིས་ མནར་མེད་པ་ -འི་ བར་ གྱི་ སེམས་ཅན་ བདེ་བ་ -ར་ བྱེད་ དེ་ །

source: Therefore, the bodies of the tathāgatas are said to be faultless.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ ལ་ འཁྲུལ་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །
