Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: He intoned the sound of a constant uninterrupted melody accompanied by cymbals, and he praised the Blessed One with these words:
bo: སིལ་སྙན་ དང་ ། སྒྲ་དབྱངས་ རྟག་ ཏུ་ རྒྱུན་ མི་འཆད་པ་ -ར་ སྒྲ་ འབྱུང་བ་ -ར་ བྱིན་ གྱིས་ བརླབས་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “All-illuminating resplendent one!
bo: ཀུན་ དུ་ སྣང་བ་ ཀུན་ ནས་ འོད་ཟེར་ ཅན་ ། །

source: Teacher of all and seer of all!
bo: དོན་ རྣམས་ མ་ ལུས་ སྟོན་པ་ ཀུན་ ནས་ སྤྱན་ ། །

source: You who are skilled in the essence of spontaneously arisen Dharma
bo: རང་བྱུང་ ཆོས་ ཀྱི་ ངོ་བོ་ ཉིད་ ལ་ མཁས་ ། །

source: And endowed with all inconceivable good qualities,
bo: བསམ་ གྱིས་ མི་ ཁྱབ་ ཡོན་ཏན་ ཀུན་ དང་ ལྡན་ ། །

source: “You, leader of beings, emitted a light
bo: སྐྱེས་བུ་ ཁྱུ་མཆོག་ གིས་ ནི་ འོད་ཟེར་ ཕྱུང་ ། །

source: And caused it to purify and illuminate my face.
bo: ཞལ་ ཡང་ རྣམ་པ་ -ར་ སྦྱོང་ ཞིང་ འོད་ མཛད་པ་ ། །

source: O leader, you also caused the light
bo: འདྲེན་པ་ དེ་ ནི་ བདག་ གི་ ལུས་ ལ་ ཡང་ ། །

source: To circle my body a hundred times and come at last to rest at my crown.
bo: ལན་ བརྒྱ་ -ར་ བསྐོར་བ་ བགྱིས་ ནས་ སྤྱི་བོ་ -ར་ ཞི་ ། །

source: “When the light of the leader of humans touched me,
bo: མི་ ཡི་ འདྲེན་པ་ -འི་ འོད་ ཀྱིས་ རེག་པ་ -ས་ ན་ ། །

source: All that I had achieved before in terms of mindfulness,
bo: གང་དག་ བདག་ གིས་ སྔོན་ ཐོབ་ དྲན་པ་ དང་ ། །

source: Intelligence, eloquence, illumination, and retention
bo: བློ་གྲོས་ སྤོབས་པ་ སྣང་བ་ དེ་བཞིན་ གཟུངས་ ། །

source: Was augmented a thousand times.
bo: རྣམ་པ་ སྟོང་ དུ་ ཁྱད་པར་ འཕགས་པ་ -ར་ གྱུར་ ། །

source: “I became physically content, mentally clear,
bo: བདག་ ལུས་ རབ་ སིམ་ སེམས་ ནི་ རྣམ་པ་ -ར་ དག་ །

source: Delightfully fulfilled, and serenely intelligent.
bo: བདག་ གི་ བློ་གྲོས་ དགའ་མགུ་ མཉམ་པ་ -ར་ གྱུར་ ། །

source: Moreover, boundless buddha knowledge
bo: གཞན་ ཡང་ སངས་རྒྱས་ མཁྱེན་པ་ མཐའ་ ཡས་ དང་ ། །

source: And eloquence possessed my body.
bo: སྤོབས་པ་ བདག་ གི་ ལུས་ ལ་ རབ་ཏུ་ ཞུགས་ ། །

source: “The mighty Buddha is difficult to approach,
bo: སངས་རྒྱས་ མཐུ་ཆེན་ བསྙེན་པ་ -ར་ དཀའ་བ་ ལ་ ། །

source: And the meek are unable to please him.
bo: ཉམ་ཆུང་ དག་ གིས་ མཉེས་པ་ -ར་ བགྱིད་ མི་ ནུས་ ། །

source: Having given this to the Buddha,
bo: སངས་རྒྱས་ གནང་ ནས་ འགྲོ་ ཀུན་ ཕན་ སླད་ དུ་ ། །

source: I make this request for the benefit of all beings.
bo: སངས་རྒྱས་ ལ་ ནི་ ཞུ་བ་ ཞུ་བ་ -ར་ འཚལ་ ། །

source: “I request entry into perfect bodhisattva conduct
bo: རྫོགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་འཇུག་ དང་ ། །

source: And the emergence of spiritual leaders,
bo: འཇིག་རྟེན་ རྣམ་འདྲེན་ དག་ གི་ འབྱུང་བ་ དང་ ། །

source: The magical display of illumination and deliverance
bo: སྣང་ དང་ ངེས་འབྱུང་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ དང་ ། །

source: As well as consecration and wisdom.
bo: དབང་ བསྐུར་ ཡེ་ཤེས་ ཡོངས་སུ་ ཞུ་བ་ -ར་ འཚལ་ ། །

source: “In order to benefit those who fully understand the excellent supreme vehicle,
bo: ཐེག་མཆོག་ དམ་པ་ རྟོགས་པ་ -ར་ ཁོང་ཆུད་ ཅིང་ ། །

source: Who have joined the endless vast retinue,
bo: མཐའ་ ཡས་ རྒྱ་ཆེ་བ་ ཡི་ འཁོར་ ལྷགས་ དང་ ། །

source: And who endeavor for vast righteousness,
bo: གང་དག་ རྒྱ་ ཆེན་ ཆོས་ དོན་གཉེར་བ་ དག་ །

source: I make this request to the Buddha.
bo: དེ་དག་ ཕན་ སླད་ སངས་རྒྱས་ ལ་ ཡང་ ཞུ་ ། །

source: “To subjugate the horde of Māra
bo: བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཤིན་ཏུ་ ཚར་ གཅད་ ཅིང་ ། །

source: And to uphold this Dharma of the Buddha,
bo: སངས་རྒྱས་ བསྟན་པ་ འདི་ ནི་ ཤིན་ཏུ་ གཟུང་ ། །

source: Blessed One, this is the time to explain to embodied beings
bo: བཅོམ་ལྡན་ ཕུང་པོ་ མ་ མཆིས་ དམ་ཆོས་ མཛོད་ ། །

source: The noble Dharma treasury in which the aggregates are absent.
bo: ལུས་ཅན་ རྣམས་ ལ་ བཤད་པ་ -འི་ དུས་ འདི་ ལགས་ ། །

source: “The knowledge of the leader of beings is endless.
bo: སྐྱེས་བུ་ ཁྱུ་མཆོག་ མཁྱེན་པ་ མཐའ་ཡས་པ་ -ས་ ། །

source: Blessed One, I cannot fathom it.
bo: བཅོམ་ལྡན་ དེ་ ལ་ བདག་ གི་ བློ་ མི་ ཆུད་ ། །

source: Since my understanding cannot grasp the knowledge of the Sugata,
bo: བདེ་གཤེགས་ མཁྱེན་པ་ ཤེས་པ་ -ས་ མི་ དཔོགས་པ་ -ས་ ། །

source: I make this request to the vastly learned one:
bo: མཁས་པ་ ཡངས་པ་ བདག་ ནི་ ཞུ་བ་ -ར་ འཚལ་ ། །

source: “How does one access the knowledge of the Blessed One,
bo: ཇི་ལྟར་ བཅོམ་ལྡན་འདས་ ཀྱི་ མཁྱེན་ འཇུག་ དང་ ། །

source: And for how long does one train,
bo: ཇི་ལྟར་ ཡུན་རིང་ ནས་ ནི་ བསླབས་པ་ དང་ ། །

source: And what is the training of Dharmeśvara­rāja?
bo: ཆོས་ ཀྱི་ དབང་ཕྱུག་ རྒྱལ་པོ་ རབ་ བསླབས་པ་ ། །

source: Please explain the sphere of activity of the guides.”
bo: འདྲེན་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ བཤད་ དུ་ གསོལ་ ། །

source: After Dhāraṇīśvara­rāja had praised the Blessed One with these verses, he added,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -འི་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Blessed One, the domain of the Tathāgata is inconceivable.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡུལ་ ནི་ བསམ་ གྱིས་ མི་ ཁྱབ་ །

source: The sphere of conduct of bodhisattvas is beyond measure.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་ཡུལ་ ནི་ ཚད་མ་ མཆིས་ ཏེ་ །

source: I understand that the Tathāgata teaches the Dharma untiringly, and I see that he abides in great compassion, which does not leave any sentient being behind.
bo: བཅོམ་ལྡན་འདས་ བདག་ གིས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡོངས་སུ་ མི་ སྐྱོ་བ་ -ར་ ཆོས་སྟོན་པ་ ལགས་པ་ -ར་ རིག་ ཅིང་ ། དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ མི་ གཏོང་བ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ ལ་ གནས་པ་ -ར་ མཐོང་ ནས་

source: So I ask you this:
bo: དོན་ འདི་ ཞུ་བ་ -ར་ འཚལ་ ལོ་ ། །

source: Blessed One, what are the bodhisattva ornaments?
bo: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ རྒྱན་ དག་ ནི་ གང་ ལགས་ །

source: Blessed One, by what ornaments are the bodhisattvas adorned so they become beautiful while performing bodhisattva conduct?
bo: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱན་ གང་དག་ གིས་ བརྒྱན་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ན་ མཛེས་པ་ ལགས་ །

source: “How, Blessed One, do bodhisattvas, who have attained the inconceivable splendor of the Dharma, become free from the darkness of ignorance and doubt, and how do they become fully trained in the great gateway of Dharma?
bo: བཅོམ་ལྡན་འདས་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཀྱི་ སྣང་བ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ ཐོབ་ ནས་ གཏི་མུག་ གི་ མུན་པ་ དང་ བྲལ་ ཞིང་ ཐེ་ཚོམ་ མ་ མཆིས་པ་ དང་ ། ཆོས་ ཀྱི་ སྒོ་ ཆེན་པོ་ ཤིན་ཏུ་ ཡོངས་སུ་ སྦྱངས་པ་ རྣམས་ ལགས་ །

source: How, Blessed One, do bodhisattvas who never abandon any being become endowed with the supreme foundation of great compassion, which never abandons any being?
bo: བཅོམ་ལྡན་འདས་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ཅན་ ཐམས་ཅད་ མི་ གཏོང་བ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ དང་ སྙིང་རྗེ་ ཆེན་པོ་ ལ་ གནས་པ་ མཆོག་ དང་ ལྡན་ ཞིང་ སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མི་ གཏོང་བ་ -ར་ གནས་པ་ རྣམས་ ལགས་ །

source: “How, Blessed One, do bodhisattvas engage in bodhisattva actions, carrying them out well without longing for their conclusion?
bo: བཅོམ་ལྡན་འདས་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ཡང་དག་པ་ ལ་ ཞུགས་པ་ དང་ ། ལེགས་པ་ -ར་ བགྱིད་པ་ -འི་ ལས་ བགྱིད་པ་ དང་ ། ལས་ ཀྱི་ མཐའ་ གདུང་བ་ མ་ མཆིས་པ་ རྣམས་ ལགས་ །

source: Bodhisattvas will by any means conquer evil and opponents, leave behind all doubt, and enter the Tathāgata domain.
bo: བཅོམ་ལྡན་འདས་ ཅི་ ནས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ བདུད་ དང་ ཕྱིར་རྒོལ་བ་ བཅོམ་ ཞིང་ ཐེ་ཚོམ་ དང་ བྲལ་ ནས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡུལ་ ལ་ འཇུག་པ་ -ར་ འགྱུར་བ་ དང་ །

source: They will come to prominence within the bodhisattva domain, engage with the thinking of all sentient beings, and understand the mental conduct of all sentient beings.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཡུལ་ ལ་ མངོན་དུ་ འཕགས་པ་ -ར་ འགྱུར་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ལ་ འཇུག་པ་ -ར་ འགྱུར་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ སྤྱོད་པ་ དག་ ཡོངས་སུ་ འཚལ་བ་ -ར་ འགྱུར་བ་ དང་ །

source: They will purify buddhafields, subjugate the hordes of Māra, fully grasp the Dharma of the Tathāgata, and swiftly attain mastery of all teachings.”
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ རྣམས་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ འགྱུར་བ་ དང་ ། བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཚར་གཅོད་པ་ -ར་ འགྱུར་བ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ བསྟན་པ་ ཡང་དག་པ་ -ར་ འཛིན་པ་ -ར་ འགྱུར་བ་ དང་ ། མྱུར་ དུ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ -ར་

source: Blessed One, I request that the Tathāgata explain The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life with firm determination so that the following may transpire:
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ བློ་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ ངེས་པ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ མངོན་པར་ འཕགས་པ་ -འི་ ཆོས་ ཀྱི་ སྒོ་ དེ་ ལེགས་པ་ -ར་ བཤད་ དུ་ གསོལ་ །

source: The Blessed One responded,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Excellent, noble being, very good!
bo: སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ ལེགས་ སོ་ ། ། ལེགས་ སོ་ ། །

source: It is really excellent that you decided to ask the Tathāgata with such determination, after you had attained certainty about the immeasurable conduct of the Tathāgata.
bo: ཁྱོད་ ཇི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱོད་ཡུལ་ ཚད་ མེད་པ་ ལ་ རྣམ་པ་ -ར་ ངེས་པ་ ཐོབ་ ནས་ ། ཁྱོད་ བློ་ རྣམ་པ་ -ར་ ངེས་པ་ འདི་ ལྟ་བུ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ ལ་དོན་ འདི་ འདྲི་བ་ -ར་ སེམས་པ་ ནི་ སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ ལེགས་ སོ་ ། །

source: Because of that, son of noble family, I shall explain to you how bodhisattva mahāsattvas perfect these qualities, as well as the other immeasurable bodhisattva qualities, and how they achieve mastery over all teachings. So, listen carefully and keep this in mind.”
bo: དེ་ -འི་ ཕྱིར་ རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཤིན་ཏུ་ ལེགས་པ་ -ར་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ -ས་ ཇི་ལྟར་ ཡོན་ཏན་ འདི་དག་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཡོན་ཏན་ ཚད་ མེད་པ་ གཞན་དག་ ཀྱང་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ འགྱུར་བ་ དང་ ། མྱུར་ དུ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ ངས་ ཁྱོད་ ལ་ བཤད་ དོ་ ། །

source: “Very good, Blessed One,” replied Dhāraṇīśvara­rāja.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ བཅོམ་ལྡན་འདས་ ལེགས་ སོ་ ཞེས་ གསོལ་ ཏེ་ །

source: He then listened with full attention as the Blessed One started to teach.
bo: བཅོམ་ལྡན་འདས་ ཀྱི་ ལྟར་ ཉན་པ་ དང་ ། བཅོམ་ལྡན་འདས་ ཀྱིས་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Son of noble family, there are four types of bodhisattva ornaments:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ སྟེ་ །

source: the ornaments of morality, the ornaments of absorption, the ornaments of insight, and the ornaments of retention.
bo: ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ དང་ ། ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ དང་ ། ཤེས་རབ་ ཀྱི་ རྒྱན་ དང་ ། གཟུངས་ ཀྱི་ རྒྱན་ ཏེ་ །

source: Son of noble family, those are the four bodhisattva ornaments.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of morality?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ གང་ཞེ་ན་ །

source: Son of noble family, there is a single bodhisattva ornament of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ གཅིག་ སྟེ་ །

source: not harming any sentient being.
bo: སེམས་ཅན་ ཐམས་ཅད་ ལ་ གནོད་པ་ མི་ བྱེད་པ་ སྟེ་ །

source: A bodhisattva without a hateful disposition, who is pleasant and delightful toward all sentient beings, is endowed with the single bodhisattva ornament of morality.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཞེ་སྡང་བ་ -འི་ སེམས་ མེད་པ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཡིད་ དུ་ འོང་ཞིང་ དགའ་བ་ སྟེ་ ། རིགས་ ཀྱི་ བུ་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ གཅིག་ གོ་ ། །

source: “Son of noble family, there are two types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ གཉིས་པོ་ འདི་དག་ སྟེ་ །

source: closing the gateway to the evil destinies and opening the gateway to the blissful destinies.
bo: ངན་འགྲོ་ -འི་ སྒོ་ གཅོད་པ་ དང་ ། བདེ་འགྲོ་ -འི་ སྒོ་ འབྱེད་པ་ སྟེ་ ། གཉིས་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are three types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ གསུམ་པོ་ འདི་དག་ སྟེ་ །

source: purity in body, purity in speech, and purity in mind.
bo: ལུས་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། ངག་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། ཡིད་ རྣམ་པ་ -ར་ དག་པ་ སྟེ་ ། གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are four types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ སྟེ་ །

source: achieving what one desires, accomplishing what one wishes for, attaining what one longs for, and finishing what one begins.
bo: གང་ འདོད་པ་ དེ་ འབྱོར་པ་ དང་ ། གང་ སྨོན་པ་ དེ་ཡང་ དག་པ་ -ར་ འགྲུབ་པ་ དང་ ། གང་ འདོད་པ་ དེ་ འཐོབ་པ་ དང་ ། གང་ རྩོམ་པ་ དེ་ ཉམས་ འོག་ ཏུ་ ཆུད་པ་ -ར་ བྱེད་པ་ སྟེ་ ། བཞི་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are five types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ ལྔ་པོ་ འདི་དག་ སྟེ་ །

source: nondeceptive absorption, nondeceptive insight, nondeceptive liberation, nondeceptive vision of liberating wisdom, and unsurpassed mahāparinirvāṇa—all endowed with morality.
bo: ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ -འི་ ཏིང་ངེ་འཛིན་ སྒྱུ་ མེད་པ་ ཡིན་ ། ཤེས་རབ་ སྒྱུ་ མེད་པ་ ཡིན་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ སྒྱུ་ མེད་པ་ ཡིན་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ སྒྱུ་ མེད་པ་ ཡིན་ ། ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ ཆེན་པོ་ བླ་ ན་ མེད་པ་ སྒྱུ་ མེད་པ་ ཡིན་ ཏེ་ ལྔ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are six types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ དྲུག་པོ་ འདི་དག་ སྟེ་ །

source: morality that is flawless on account of being without mental attachment, not degenerate on account of being without reproach, not corrupt on account of not being adulterated, free of sin on account of increasing virtuous qualities, unfettered on account of being voluntary, and autonomous on account of being an understanding that does not depend on others.
bo: ཡིད་ ལ་ ཆགས་པ་ མེད་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕྱིར་ སྐྱོན་མེད་པ་ -འི་ ཚུལ་ཁྲིམས་ དང་ ། ཁ་ན་མ་ཐོ་བ་ མེད་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕྱིར་ ཉམས་པ་ མེད་པ་ -འི་ ཚུལ་ཁྲིམས་ དང་ ། འདྲེན་མ་ མ་ཡིན་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕྱིར་ འདྲེས་པ་ མ་ཡིན་པ་ -འི་ ཚུལ་ཁྲིམས་ དང་ ། དགེ་བ་ -འི་ ཆོས་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ འཕེལ་བ་ -འི་ ཕྱིར་ སྲ་སྲེ་ མ་ཡིན་པ་ -འི་ ཚུལ་ཁྲིམས་ དང་ ། གང་ གིས་ འདོད་པ་ -ར་ འགྲོ་བ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕྱིར་ རང་ དགའ་ -འི་ ཚུལ་ཁྲིམས་ དང་ ། གཞན་ ལ་ རག་ མ་ལུས་པ་ -འི་ ཤེས་པ་ -ས་ རང་ གི་ དབང་ སྒྱུར་བ་ -འི་ ཚུལ་ཁྲིམས་ ཏེ་ དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are seven types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ བདུན་པོ་ འདི་དག་ སྟེ་ །

source: pure generosity, pure patience, pure vigor, pure concentration, pure insight, pure method, and pure conscientiousness—all endowed with morality.
bo: ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ -འི་ སྦྱིན་པ་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། བཟོད་པ་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། བརྩོན་འགྲུས་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། བསམ་གཏན་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། ཤེས་རབ་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། ཐབས་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། བག་ ཡོད་པ་ རྣམ་པ་ -ར་ དག་པ་ སྟེ་ ། བདུན་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are eight types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: excellence in eloquence, excellence in the spiritual levels, excellence in lack of distractedness, excellence in lack of idleness, excellence in lack of vindictiveness, excellence in appreciating the appearance of a buddha, excellence in ease, and excellence in venerating one’s spiritual friends.
bo: སྤོབས་པ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། ས་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། རྣམ་པ་ -ར་ འཕྲོ་བ་ མེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། ལྷོད་པ་ མེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། འཁོན་ དུ་ འཛིན་པ་ མེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། སངས་རྒྱས་ འབྱུང་བ་ མཉེས་པ་ -ར་ བྱེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། དལ་བ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ ། དགེ་བ་ -འི་ བཤེས་གཉེན་ མགུ་བ་ -ར་ བྱེད་པ་ ཕུན་སུམ་ ཚོགས་པ་ སྟེ་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are nine types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ དགུ་པོ་ འདི་དག་ སྟེ་ །

source: being fearless, being without anxiety, being determined, being tranquil, being cool, being released from bondage, being flexible, being well bred, and being accomplished in the stage of being restrained.
bo: འཇིགས་པ་ མེད་པ་ ཡིན་ ། སྐྲག་པ་ མེད་པ་ ཡིན་ ། བསམ་པ་ ངེས་པ་ ཡིན་ ། ཉེ་བར་ ཞི་བ་ ཡིན་ ། བསིལ་བ་ ཡིན་ ། བཅིངས་པ་ ལྷོད་པ་ ཡིན་ ། སེམས་ལས་ སུ་ རུང་བ་ ཡིན་ ། སེམས་ ཅང་ཤེས་པ་ ཡིན་ ། དུལ་བ་ -འི་ ས་ རྗེས་སུ་ འཐོབ་པ་ ཡིན་ ཏེ་ ། དགུ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are ten types of bodhisattva ornaments of morality:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནི་ བཅུ་པོ་ འདི་དག་ སྟེ་ །

source: the ornaments of body, since bodhisattvas accomplish the auspicious thirty-two major marks and eighty minor signs; speech, since they act on their word; mind, since they lack afflictive emotions; buddhafields, since they accomplish their aspirations; maturing sentient beings, since the bodhisattva intention is pure; birth, since they do not commit any sinful deeds; bodhisattva conduct, since they emulate the tathāgata conduct; understanding, since they lack pride; the seat of awakening, since they dedicate their roots of virtue; and the ornaments of the strengths, the fearlessnesses, and unique buddha qualities, since they do not discard their grounding in the root of moral conduct.
bo: མཚན་ དང་ དཔེ་བྱད་ བཟང་པོ་ ཡོངས་སུ་ རྫོགས་པ་ -འི་ ཕྱིར་ ལུས་ ཀྱི་ རྒྱན་ དང་ ། ཇི་སྐད་ སྨྲས་པ་ དེ་བཞིན་ བྱེད་པ་ -འི་ ཕྱིར་ ངག་ གི་ རྒྱན་ དང་ ། ཉོན་མོངས་པ་ མེད་པ་ -འི་ ཕྱིར་ སེམས་ ཀྱི་ རྒྱན་ དང་ ། སྨོན་ལམ་ ཡོངས་སུ་ རྫོགས་པ་ -འི་ ཕྱིར་ཞིང་ གི་ རྒྱན་ དང་ ། བསམ་པ་ ཡོངས་སུ་ སྤྱོད་པ་ -འི་ ཕྱིར་ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ -འི་ རྒྱན་ དང་ ། སྡིག་པ་ ཐམས་ཅད་ མི་ བྱེད་པ་ -འི་ ཕྱིར་ སྐྱེ་བ་ -འི་ རྒྱན་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱོད་པ་ ལ་ རྗེས་སུ་ སློབ་པ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ -འི་ རྒྱན་ དང་ ། ང་རྒྱལ་ མེད་པ་ -འི་ ཕྱིར་ ཤེས་པ་ -འི་ རྒྱན་ དང་ ། དགེ་བ་ -འི་ རྩ་བ་ ཡོངས་སུ་ བསྔོ་བ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ -འི་ རྒྱན་ དང་ ། ཚུལ་ཁྲིམས་ ཀྱི་ རྩ་བ་ ལ་ གནས་པ་ མི་ འདོར་བ་ -འི་ ཕྱིར་ སྟོབས་ དང་ ། མི་ འཇིགས་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཆོས་མ་ འདྲེས་པ་ -འི་ རྒྱན་ ཏེ་ །

source: Son of noble family, these are the ten types of bodhisattva ornaments of morality.
bo: རིགས་ ཀྱི་ བུ་ བཅུ་པོ་ འདི་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ ཀྱི་ རྒྱན་ ནོ་ ། །

source: “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of meditative absorption?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ གང་ཞེ་ན་ །

source: Son of noble family, there is a single bodhisattva ornament of absorption: loving all sentient beings.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ གཅིག་ སྟེ་ ། གཅིག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ བྱམས་པ་ སྟེ་ འདི་ ནི་ གཅིག་ གོ་ ། །

source: “Son of noble family, there are two types of bodhisattva ornaments of absorption: honesty and suppleness.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ གཉིས་པོ་ འདི་དག་ སྟེ་ ། གཉིས་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དྲང་བ་ དང་ ། མཉེན་པ་ སྟེ་ གཉིས་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are three types of bodhisattva ornaments of absorption: lack of deception, cunning, and hypocrisy.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ གསུམ་པོ་ འདི་དག་ སྟེ་ ། གསུམ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྒྱུ་ མེད་པ་ དང་ ། གཡོ་མེད་པ་ དང་ ། བཅོས་མ་ མེད་པ་ སྟེ་ གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are four types of bodhisattva ornaments of absorption: not being immobilized by desire, hatred, delusion, and fear.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ སྟེ་ ། བཞི་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། འདུན་པ་ -ས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ མི་ འགྲོ་བ་ དང་ ། ཞེ་སྡང་ གིས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ མི་ འགྲོ་བ་ དང་ ། གཏི་མུག་ གིས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ མི་ འགྲོ་བ་ དང་ ། འཇིགས་པ་ -ས་ འགྲོ་བ་ མ་ཡིན་པ་ -ར་ མི་ འགྲོ་བ་ སྟེ་ བཞི་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are five types of bodhisattva ornaments of absorption: abandoning the five obstructions of sensual desire, ill will, drowsiness and torpor, agitation and regret, and doubt.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ ལྔ་པོ་ འདི་དག་ སྟེ་ ། ལྔ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྒྲིབ་པ་ ལྔ་ སྤོང་བ་ སྟེ་ ། ལྔ་པོ་ དེ་དག་ གང་ཞེ་ན་ ། འདོད་པ་ ལ་ འདུན་པ་ དང་ ། གནོད་སེམས་ དང་ ། རྨུགས་པ་ དང་ ། གཉིད་ དང་ ། རྒོད་པ་ དང་ ། འགྱོད་པ་ དང་ ། ཐེ་ཚོམ་ སྟེ་ །

source: These five obstructions are abandoned.
bo: སྒྲིབ་པ་ ལྔ་པོ་ འདི་དག་ སྤོང་བ་ -འོ་ ། །

source: “Son of noble family, there are six types of bodhisattva ornaments of absorption: recollecting the Buddha, the Dharma, the Saṅgha, generosity, morality, and the gods.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ དྲུག་པོ་ འདི་དག་ སྟེ་ ། དྲུག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སངས་རྒྱས་ རྗེས་སུ་ དྲན་པ་ དང་ ། ཆོས་རྗེ་ -ས་ སུ་ དྲན་པ་ དང་ ། དགེ་འདུན་ རྗེས་སུ་ དྲན་པ་ དང་ ། གཏོང་བ་ རྗེས་སུ་ དྲན་པ་ དང་ ། ཚུལ་ཁྲིམས་ རྗེས་སུ་ དྲན་པ་ དང་ ། ལྷ་རྗེ་ -ས་ སུ་ དྲན་པ་ སྟེ་ དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are seven types of bodhisattva ornaments of absorption: cultivating the seven factors of awakening without forgetting the thought of awakening: correct mindfulness, correct investigation of phenomena, correct vigor, correct joy, correct pliancy, correct absorption, and correct equanimity.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ བདུན་པོ་ འདི་དག་ སྟེ་ ། བདུན་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། བྱང་ཆུབ་ ཀྱི་ སེམས་ མི་ བརྗེད་པ་ -འི་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ བདུན་ བསྒོམ་པ་ སྟེ་ ། དྲན་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཆོས་ རབ་ཏུ་ འབྱེད་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། བརྩོན་འགྲུས་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། དགའ་བ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཤིན་ཏུ་ སྦྱངས་པ་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། ཏིང་ངེ་འཛིན་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ། བཏང་སྙོམས་ ཡང་དག་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ སྟེ་ ། བདུན་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are eight types of bodhisattva ornaments of absorption: cultivating the noble eightfold path, that is to say, correct view, correct intention, correct speech, correct action, correct livelihood, correct effort, correct mindfulness, and correct absorption.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། འཕགས་པ་ -འི་ ལམ་ ཡན་ལག་ བརྒྱད་པ་ བསྒོམ་པ་ སྟེ་ ། འདི་ལྟར་ ཡང་དག་པ་ -འི་ ལྟ་བ་ དང་ ། ཡང་དག་པ་ -འི་ རྟོག་པ་ དང་ ། ཡང་དག་པ་ -འི་ ངག་ དང་ ། ཡང་དག་པ་ -འི་ ལས་ ཀྱི་ མཐའ་ དང་ ། ཡང་དག་པ་ -འི་ འཚོ་བ་ དང་ ། ཡང་དག་པ་ -འི་ རྩོལ་བ་ དང་ ། ཡང་དག་པ་ -འི་ དྲན་པ་ དང་ ། ཡང་དག་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཏེ་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are nine types of bodhisattva ornaments of absorption:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ དགུ་པོ་ འདི་དག་ སྟེ་ །

source: that of bodhisattvas who, without being forgetful, dwell on the foundation of great compassion, never abandon any sentient being, and then, detached from desire, sin, and nonvirtues attain to and abide in the first concentration, which has applied and sustained thought and is joyful and blissful through detachment;
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྗེད་པ་ མེད་པ་ -འི་ སེམས་ ཀྱིས་ སྙིང་རྗེ་ ཆེན་པོ་ -འི་ གནས་ ལ་ གནས་ ཏེ་ ། སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མི་ གཏོང་བ་ -ར་ གནས་ ནས་ འདོད་པ་ དག་ ལས་ དབེན་པ་ ། སྡིག་པ་ མི་དགེ་བ་ -འི་ ཆོས་ རྣམས་ ལས་ དབེན་པ་ ། རྟོག་པ་ དང་ བཅས་པ་ ། དཔྱོད་པ་ དང་ བཅས་པ་ དབེན་པ་ ལས་ སྐྱེས་པ་ -འི་ དགའ་བ་ དང་ ། བདེ་བ་ ཅན་ བསམ་གཏན་ དང་པོ་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །
