Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of all kinds of ornaments, precious bells, and tinkling bells.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ རྒྱན་ ཐམས་ཅད་ བཀོད་པ་ དང་ ། རིན་པོ་ཆེ་ -འི་ དྲིལ་བུ་ གཡེར་ ཀ་ -འི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “The physical activity of the Sugata defies measure.
bo: བདེ་གཤེགས་ སྐུ་ ཡི་ འཕྲིན་ལས་ མཐའ་ དང་ དབུང་ མ་ མཆིས་ ། །

source: The speech, mind, and conduct of the unsurpassed ones are limitless.
bo: བླ་མེད་ རྣམས་ ཀྱི་ གསུང་ ཐུགས་ སྤྱོད་ཡུལ་ མཐའ་ཡས་པ་ ། །

source: The Buddha knows that, but other beings do not,
bo: དེ་ ནི་ སངས་རྒྱས་ མཁྱེན་ གྱི་ སེམས་ཅན་ གཞན་ གྱིས་ མིན་ ། །

source: Just as ordinary beings cannot grasp the limits of space.
bo: དཔེར་ན་ ནམ་མཁའ་ -འི་ མཐའ་མ་ སྐྱེ་བོ་ -ས་ མི་ རྙེད་ བཞིན་ ། །

source: “Just as the conduct of the incomparable one defies measure,
bo: མཚུངས་མེད་ སྤྱོད་པ་ མཐའ་ དབུང་ མེད་པ་ ཇི་བཞིན་ དུ་ ། །

source: So the wheel of awakening is nothing but nirvāṇa.
bo: བྱང་ཆུབ་ འཁོར་ལོ་ དེ་བཞིན་ འོན་ཏེ་ མྱ་ངན་ འདས་ ། །

source: Just as fruits emerge according to the seeds sown,
bo: ས་བོན་ ཇི་བཞིན་ དེ་ལྟར་ འབྲས་བུ་འབྱུང་བ་ ལྟར་ ། །

source: So the state of the Victor knows no bounds anywhere in the ten directions.”
bo: དེ་བཞིན་ ཕྱོགས་ བཅུར་ རྒྱལ་བ་ -འི་ གནས་ ཀྱང་ ཚད་མ་ མཆིས་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew into the space above the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ སྟེང་ གི་ བར་སྣང་ ལ་ དོང་ སྟེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Thus the light rays invited the ten bodhisattvas of the ten directions, together with their entourages of countless other bodhisattvas. They arrived in an instant in this world system of Endurance, and they sat before the Blessed One within the pavilion Jeweled Array.
bo: དེ་ལྟར་ ཕྱོགས་ བཅུ་ དག་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ བཅུ་ འདུས་པ་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚད་ མེད་པ་ དག་ འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེའཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འཁོད་ དོ་ ། །

source: As the Blessed One mindfully and deliberately rose from that absorption, he cleared his throat and produced a sound, a melodious sound heard throughout the entire trichiliocosm.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ དྲན་པ་ དང་ ལྡན་ ཞིང་ མཁྱེན་ བཞིན་ དུ་ ཏིང་ངེ་འཛིན་ དེ་ལས་ བཞེངས་ ཏེ་ ། གསུང་ བསལ་བ་ -འི་ སྒྲ་ མཛད་ ནས་ ། གསུང་ བསལ་བ་ -འི་ སྒྲ་ དེ་ -ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ གྱུར་ ཏེ་ །

source: Once all the faithful in the entire trichiliocosm, including the monks and nuns, the laymen and laywomen, and the humans and nonhumans, heard the sound of the Blessed One clearing his throat, they grew satisfied in body and mind.
bo: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ན་ གང་དག་ དད་པ་ དང་ ལྡན་ ཞིང་ སྣོད་ དུ་ གྱུར་པ་ -འི་ དགེ་སློང་ དང་ ། དགེ་སློང་ མ་ དང་ ། དགེ་བསྙེན་ དང་ ། དགེ་བསྙེན་མ་ དང་ ། མི་ དང་ མི་མ་ཡིན་པ་ དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ ཀྱི་ གསུང་ བསལ་བ་ -འི་ སྒྲ་ དེ་ ཐོས་ ནས་ ལུས་ དང་ ། སེམས་ ཚིམ་པ་ -ར་ གྱུར་ ཏེ

source: By the power of the Buddha, they also arrived at the pavilion Jeweled Array in an instant, that very moment, by means of the miraculously manifesting staircases.
bo: སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ ཇི་ལྟར་ བྱུང་བ་ -འི་ ཐེམ་སྐས་ དག་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ ཕྱིན་ ཏེ་ །

source: They prostrated at the Blessed One’s feet and took their designated seats off to the side.
bo: དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ ཕྱོགས་ གཅིག་ ཏུ་ ཇི་ལྟར་ འཐུན་པ་ -འི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: The sound of the Blessed One clearing his throat also inspired the gods of the following realms: Brahmā, Brahmakāyika, Brahma­purohita, Brahma­pariṣadya, and Mahābrahmā; Mahāprabha, Parīttābha, Apramāṇābha, and Ābhāsvara; Parīttaśubha, Apramāṇaśubha, and Śubhakṛtsna; and Anabhraka, Puṇyaprasava, Bṛhatphala, Asaṃjñisattva, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha.
bo: གསུང་ བསལ་བ་ -འི་ སྒྲ་ དེ་ཉིད་ ཀྱིས་ ཚངས་པ་ -འི་ ལྷ་ རྣམས་ དང་ ། ཚངས་རིས་ དང་ ། ཚངས་པ་ -འི་ མདུན་ན་འདོན་ དང་ ། ཚངས་ འཁོར་ དང་ ། ཚངས་ཆེན་ དང་ ། འོད་ ཆེན་ དང་ ། འོད་ཆུང་ དང་ ། ཚད་ མེད་ འོད་ དང་ ། འོད་གསལ་ དང་ ། དགེ་ཆུང་ དང་ ། ཚད་ མེད་ དགེ་ དང་ ། དགེ་རྒྱས་ དང་ ། སྤྲིན་ མེད་ དང་ ། བསོད་ནམས་ སྐྱེས་ དང་ ། འབྲས་བུ་ཆེ་བ་ དང་ ། འདུ་ཤེས་ མེད་པ་ -འི་ སེམས་ཅན་ དང་ ། མི་ཆེ་བ་ དང་ ། མི་གདུང་བ་ དང་ ། གྱ་ནོམ་ སྣང་ དང་ ། ཤིན་ཏུ་ མཐོང་ དང་ ། འོག་མིན་ གྱི་ ལྷ་ རྣམས་ ཀྱང་ བསྐུལ་ ནས་

source: They too hastened in an instant, that very moment, to the pavilion Jeweled Array.
bo: སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ ཕྱིན་ ཏེ

source: They too prostrated at the Blessed One’s feet and took their seats.
bo: དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ སྟན་ རབ་ཏུ་ བརྟན་པ་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then, when the Blessed One had comprehended that this large retinue had assembled, a light called display of the strength of bodhisattvas sprang from his forehead.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ འཁོར་ འདུས་པ་ ཆེན་པོ་ དེ་ འདུས་པ་ -ར་ མཁྱེན་ ནས་ སྨིན་མཚམས་ ཀྱི་ མཛོད་སྤུ་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྟོབས་ ཉེ་བར་ སྟོན་པ་ ཞེས་ བྱ་བ་ -འི་ འོད་ཟེར་ ཕྱུང་ སྟེ་ །

source: That light swirled around the whole group of bodhisattvas seven times and disappeared into the crowns of their heads.
bo: དེ་ -ས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ལ་ ལན་ བདུན་ བསྐོར་བ་ བྱས་ ནས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ དེ་ཉིད་ ཀྱི་ སྤྱི་བོ་ -ར་ མི་སྣང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: Then, as soon as the light had touched the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin, by the power of the Buddha he attained the bodhisattva absorption called array of all ornaments.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ མེ་ཏོག་ དཔལ་ གྱི་ སྙིང་པོ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ འོད་ དེ་ -ས་ རེག་ མ་ ཐག་ ཏུ་ ། དེ་ -འི་ ཚེ་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་ངེ་འཛིན་ རྒྱན་ ཐམས་ཅད་ བཀོད་པ་ ཞེས་ བྱ་བ་ ལ་ སྙོམས་པར་ ཞུགས་ སོ་ ། །

source: As soon as he had entered that absorption, a beautiful throne for the Blessed One appeared in the center of the pavilion Jeweled Array.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ མེ་ཏོག་ དཔལ་ གྱི་ སྙིང་པོ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་ངེ་འཛིན་ རྒྱན་ ཐམས་ཅད་ བཀོད་པ་ ལ་ སྙོམས་པར་ ཞུགས་ མ་ ཐག་ ཏུ་ །

source: It was a raised lion throne the height of a gigantic palmyra tree. It rested on different types of embellished supports and was decorated with all kinds of precious things.
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -འི་ དབུས་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ གདན་ སེང་གེ་ -འི་ ཁྲི་འཕང་ དུ་ ཤིང་ ཏ་ལ་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ ཙམ་ དུ་ མཐོ་བ་ ། རིན་པོ་ཆེ་ ཐམས་ཅད་ ཀྱིས་ སྤྲས་པ་ ། ཁ་ཁྱེར་ རྒྱན་ ཐམས་ཅད་ ལས་ བྱས་པ་ །

source: It was draped in various types of cotton cloth and sprinkled with a variety of flower petals.
bo: རས་ བཀོད་པ་ ཐམས་ཅད་ བཏིང་བ་ ། མེ་ཏོག་སིལ་མ་ སྣ་ཚོགས་ ཐམས་ཅད་ བཀྲམ་པ་ །

source: The bodhisattvas held up an incredibly attractive parasol above the seat, and the seat was visible to the entire assembly.
bo: བླ་རེ་ ཡིད་ དུ་ འོང་བ་ ཐམས་ཅད་ བྲེས་པ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལུས་ ཐམས་ཅད་ ཀྱིས་ ཡང་དག་པ་ -ར་ བཟུང་བ་ ། འཁོར་ ཐམས་ཅད་ ཀྱི་ མིག་ གིས་ བལྟས་པ་ །

source: It delighted and deeply gratified all sentient beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སྟོན་པ་ ། བསམ་པ་ ཚིམ་པ་ -ར་ བྱེད་པ་ ཞིག་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ །

source: After the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin had conjured up the tathāgata seat, the great lion throne called limitless inspiring praise, he mindfully and deliberately emerged from that absorption.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ མེ་ཏོག་ དཔལ་ གྱི་ སྙིང་པོ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གདན་ སེང་གེ་ -འི་ ཁྲི་ཆེན་པོ་ བསྐུལ་བ་ -ར་ བསྔགས་པ་ མཐའ་ ཡས་ ཞེས་ བྱ་བ་ མངོན་པར་ སྤྲུལ་ ནས་ དྲན་པ་ དང་ ལྡན་ ཞིང་ ཤེས་བཞིན་ དུ་ ཏིང་ངེ་འཛིན་ དེ་ལས་ ལངས་ ཏེ

source: He spoke to the Blessed One, his palms joined in reverence, and said the following:
bo: གུས་པ་ དང་ བཅས་ ཤིང་ ཞེ་ས་ དང་ བཅས་པ་ -ར་ ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་ དེ་ གསོལ་པ་ །

source: “Sunlight sustains the needs of sentient beings.
bo: ཉི་མ་ -འི་ འོད་ ཀྱིས་ འགྲོ་བ་ -འི་ དགོས་པ་ རབ་ཏུ་ བགྱིད་ ། །

source: The radiant qualities of Indra delight the gods of Trāyastriṃśa.
bo: ལྷ་དབང་ གཟི་བརྗིད་ ཡོན་ཏན་ སུམ་ཅུ་རྩ་གསུམ་ དགའ་ ། །

source: The voice of Brahmā embellishes the realm of Brahmā.
bo: ཚངས་པ་ -འི་ དབྱངས་ ཀྱིས་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ རྣམ་པ་ -ར་ མཛེས་ ། །

source: The domain of the Buddha’s power brings forth this manifestation.
bo: སངས་རྒྱས་ མཐུ་ ཡི་ ཡུལ་ གྱིས་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ འདི་ ། །

source: “Phenomena are immovable, space-like and void,
bo: ཆོས་ རྣམས་ མི་ གཡོ་ ནམ་མཁའ་ -འི་ རང་བཞིན་ ཡ་མ་བརླ་ ། །

source: Illusory like a mirage and the reflection of the moon in water,
bo: སྒྱུ་མ་ སྨིག་རྒྱུ་ ལྟ་བུ་ ཆུ་ ཡི་ ཟླ་ འདྲ་ ཞིང་ ། །

source: And without a master, creator, or agent of experience.
bo: རྗེ་ མེད་ བྱེད་པ་པོ་ དང་ ཚོར་བ་པོ་ མེད་པ་ -ར་ ། །

source: Knowing this, the Protector displayed his accomplishment in this world.
bo: མཁྱེན་ ནས་ མགོན་པོ་ འདི་ -ར་ ནི་ རྣམ་པ་ -ར་ སྒྲུབ་པ་ སྟོན་ ། །

source: “The mind with its powers of creation is itself formless.
bo: བཀོད་པ་ -འི་ སེམས་ ཀྱི་ དབང་ འགྲོ་ སེམས་ ནི་ གཟུགས་ཅན་ མིན་ ། །

source: All accomplishments are subject to the nature of the mind.
bo: རྣམ་ སྒྲུབ་ ཐམས་ཅད་ སེམས་ ཀྱི་ རང་བཞིན་ དབང་ དུ་ འགྲོ་ ། །

source: Everything that is created in this world resembles an illusion.
bo: བཀོད་པ་ ཐམས་ཅད་ འདི་ -ར་ ནི་ སྒྱུ་མ་ -འི་ རང་བཞིན་ འདྲ་ ། །

source: These accomplishments are not my own and do not exist anywhere.
bo: རྣམ་ སྒྲུབ་ བདག་ གིས་ མ་ མཆིས་ གང་ ན་ -འང་ གནས་མ་ མཆིས་ ། །

source: “For the one who knows the pure nature of the mind that has ceased
bo: གང་ གིས་ སེམས་རྒྱུན་ མ་ མཆིས་ རང་བཞིན་ དག་ འཚལ་བ་ ། །

source: There are no adventitious afflictive emotions.
bo: དེ་ ལ་ གློ་བུར་ གནས་པ་ -འི་ ཉོན་མོངས་ མ་ མཆིས་ སོ་ ། །

source: A mind free of discursive thought, concepts, and discriminations
bo: རྟོག་ དང་ ཀུན་རྟོག་ ཡོངས་སུ་ རྟོག་ ལས་ སེམས་ གྲོལ་བ་ ། །

source: Displays different illusory manifestations.
bo: དེ་ ནི་ སྒྱུ་མ་ -འི་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ སྣ་ཚོགས་ སྟོན་ ། །

source: “In this place where no dust rises from the ground
bo: ས་སྟེང་ རྡུལ་ ཙམ་ མངོན་པར་ འཕགས་པ་ མ་ མཆིས་ ཀྱང་ ། །

source: And different types of jewels are displayed,
bo: ས་སྟེང་ ནོར་བུ་ རིན་ཆེན་ སྣ་ཚོགས་ ཀུན་ ཏུ་ བསྟན་ ། །

source: Seated upon which you will tame millions of beings.
bo: གདན་ གང་ བཞུགས་ ནས་ སེམས་ཅན་ བྱེ་བ་ འདུལ་ འགྱུར་བ་ ། །

source: I made you a beautiful lion throne,
bo: ཁྱོད་ ཀྱི་ སེང་གེ་ -འི་ ཁྲི་གདན་ རབ་ མཛེས་ བདག་ གིས་ བགྱིས་ ། །

source: “I hoisted parasols, victory banners, and tassels made of silk
bo: གདུགས་ དང་ རྒྱལ་མཚན་ མཆོག་ དང་ དར་ གྱི་ ཕྲེང་བ་ བསྒྲེང་ ། །

source: That neither come from nor go anywhere.
bo: དེ་ ནི་ གང་ དུའང་ འགྲོ་བ་ མ་ མཆིས་ འོང་ མ་ མཆིས་ ། །

source: While knowing whence phenomena come together,
bo: ཁྱོད་ ཀྱིས་ གང་ ནས་ ཆོས་ རྣམས་ འདུ་བ་ མཁྱེན་ ནས་ ཀྱང་ ། །

source: You display the different manifestations of a noble being.
bo: སེམས་ཅན་ དམ་པ་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ སྣ་ཚོགས་ སྟོན་ ། །

source: “Possessing the voice of Brahmā, your words are fine and reassuring.
bo: ཚངས་པ་ -འི་ དབྱངས་ ལྡན་ ལེགས་ ཤིང་ ཤིན་ཏུ་ བསྲུངས་པ་ -འི་ གསུང་ ། །

source: Since you are the lamp of the world, your deeds are filled with the brilliance of merit.
bo: འཇིག་རྟེན་ སྒྲོན་མ་ མཛད་པ་ བསོད་ནམས་ གཟི་བརྗིད་ མང་ ། །

source: Ascend the throne and be seated there, out of compassion for me.
bo: བདག་ ལ་ ཐུགས་ བརྩེའི་ སླད་ དུ་ འཛེགས་ ཏེ་ གདན་ ལ་ བཞུགས་ ། །

source: Please teach the Dharma that severs old age, sickness, and death.
bo: རྒ་ དང་ འཆི་ དང་ ན་བ་ གཅོད་པ་ -འི་ ཆོས་ བཤད་ གསོལ་ ། །

source: In order to pay homage to you and hear the Dharma.
bo: ཁྱོད་ ལ་ བསྙེན་བཀུར་ བགྱི་ དང་ ཆོས་ ནི་ མཉན་ སླད་ དུ་ ། །

source: “These pure beings have come together from all quarters
bo: རྣམ་དག་ སེམས་ཅན་ འདི་ རྣམས་ ཕྱོགས་ བཅུ་ དག་ ནས་ ལྷགས་ ། །

source: Please fulfil the aspirations for which they have come,
bo: གང་ གི་ དོན་ དུ་ ལྷགས་པ་ -འི་ དོན་ དེ་ སྩལ་ དུ་ གསོལ་ ། །

source: And explain the Dharma while seated on this lion throne.”
bo: སེང་གེ་ -འི་ ཁྲི་ ལ་ བཞུགས་ ཏེ་ ཆོས་ ཀྱང་ བཤད་ དུ་ གསོལ་ ། །

source: Recognizing the determination of the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin, the Blessed One took his seat on the lion throne.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ མེ་ཏོག་ དཔལ་ གྱི་ སྙིང་པོ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ -འི་ ལྷག་པ་ -འི་ བསམ་པ་ མཁྱེན་ ནས་ གདན་ སེང་གེ་ -འི་ ཁྲི་ དེ་ ལ་ བཞུགས་ སོ་ ། །

source: The Blessed One, who had attained unobstructed liberation, thus sat on the lion throne to teach the Dharma discourse The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ སྒྲིབ་པ་ མེད་པ་ -འི་ རྣམ་པ་ -ར་ ཐར་པ་ བརྙེས་ ནས་ །

source: This discourse focuses on setting out on the bodhisattva path that accomplishes all profound buddha qualities: the strengths and four types of fearlessness.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལམ་ བཀོད་པ་ ལ་ དམིགས་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཆོས་ ཟབ་མོ་ ཐམས་ཅད་ དང་ ། སྟོབས་ བཅུ་ དང་ ། མི་ འཇིགས་པ་ ཡོངས་སུ་ སྒྲུབ་པ་ དང་ །

source: It is the source of wisdom, the gateway to the dhāraṇī seal that grants mastery of all teachings.
bo: ཡེ་ཤེས་ ཀྱི་ འབྱུང་གནས་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ -འི་ གཟུངས་ ཀྱི་ ཕྱག་རྒྱ་ -འི་ སྒོར་ འཇུག་པ་ །

source: It is a gateway that establishes the four types of discriminating knowledge.
bo: སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ལ་ རྣམ་པ་ -ར་ གཏན་ ལ་ དབབ་པ་ ལ་ གཞོལ་བ་ -འི་ སྒོར་ འཇུག་པ་ །

source: It is a gateway to the wisdom of great superknowledge.
bo: མངོན་པར་ ཤེས་པ་ ཆེན་པོ་ -འི་ ཡེ་ཤེས་ ལ་ གཞོལ་བ་ -འི་ སྒོར་ འཇུག་པ་ །

source: It teaches the Dharma of nonorigination to the retinue of those who will not be turned back from awakening.
bo: ཕྱིར་ མི་ ལྡོག་པ་ -འི་ འཁོར་ ལ་ མི་ སྐྱེ་བ་ -འི་ ཆོས་སྟོན་པ་ །

source: It condenses all vehicles into sameness, into a single vehicle.
bo: ཐེག་པ་ ཐམས་ཅད་ ཐེག་པ་ གཅིག་ ཏུ་ མཉམ་པ་ཉིད་ དུ་ ཡང་དག་པ་ -ར་ འདུ་བ་ །

source: It enters the uncontaminated, unique realm of phenomena.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ཚུལ་ གཅིག་ ཅིང་ མ་ འདྲེས་པ་ ལ་ འཇུག་པ་ །

source: It engages the dispositions and faculties of all sentient beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ དང་ དབང་པོ་ ལ་ འཇུག་པ་ །

source: This discourse is an essential teaching.
bo: སྟོན་པ་ སྙིང་པོ་ དང་ ལྡན་པ་ །

source: It is a Dharma of total certainty.
bo: ཆོས་ རྣམ་པ་ -ར་ གདོན་ མི་ ཟ་བ་ །

source: It destroys the entire retinue of Māra.
bo: བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཇོམས་པ་ -ར་ བྱེད་པ་ །

source: It leads to engagement in the appropriate Dharma methods.
bo: ཚུལ་བཞིན་ གྱི་ ཆོས་ ཀྱི་ ཚུལ་ ལ་ གཞོལ་བ་ -ར་ འཇུག་པ་ །

source: It overcomes all afflictive emotions and views.
bo: ཉོན་མོངས་པ་ དང་ ལྟ་བ་ -ར་ གྱུར་པ་ ཐམས་ཅད་ འདུལ་བ་ །

source: It accords with wisdom free of attachment.
bo: ཆགས་པ་ མེད་པ་ -འི་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ །

source: It teaches skill in means and the wisdom of unobstructed dedication to the roots of virtue.
bo: ཐུབ་པ་ མེད་པ་ -ར་ ཡོངས་སུ་ བསྔོ་བ་ ལ་ མཁས་པ་ -འི་ ཐབས་ དང་ ཡེ་ཤེས་ སྟོན་པ་ །

source: It leads to the wisdom of the sameness of all buddhas.
bo: སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ མཉམ་པ་ཉིད་ ཀྱི་ ཡེ་ཤེས་ ལ་ འཇུག་པ་ །

source: It is the gateway to the blessings of nonattachment.
bo: ཆགས་པ་ མེད་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ཀྱི་ སྒོར་ འཇུག་པ་ །

source: It elaborates on the exact nature of all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རྣམ་པ་ -ར་ ངེས་པ་ སྟོན་པ་ །

source: This discourse leads to sameness free of discursive thought and concepts.
bo: རྟོག་པ་ མེད་པ་ དང་ རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ མཉམ་པ་ཉིད་ དུ་ འཇུག་པ་ །

source: It brings about understanding of the sameness of the twelve links of profound dependent arising due to accumulating all the collections of merit and wisdom.
bo: བསོད་ནམས་ དང་ ཡེ་ཤེས་ ཀྱི་ ཚོགས་ ཐམས་ཅད་ བསགས་པ་ -འི་ ཕྱིར་ རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ ཟབ་མོ་ མཉམ་པ་ཉིད་ རྟོགས་པ་ -ར་ བྱེད་པ་ །

source: It is furnished with the ornament of the sameness of the body, speech, and mind of the buddhas.
bo: སངས་རྒྱས་ ཀྱི་ སྐུ་ དང་ ། གསུང་ དང་ ། ཐུགས་ མཉམ་པ་ཉིད་ ཀྱི་ རྒྱན་ དང་ ལྡན་པ་ །

source: It accomplishes inexhaustible mindfulness, intelligence, realization, devotion, and wisdom.
bo: དྲན་པ་ དང་ ། བློ་གྲོས་ དང་ ། རྟོགས་པ་ དང་ ། མོས་པ་ དང་ ། ཤེས་རབ་ ཟད་ མི་ ཤེས་པ་ མངོན་པར་ སྒྲུབ་པ་ །

source: It engages the method of the noble truths in order to tame beings through the vehicle of the śrāvakas.
bo: ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -ས་ འདུལ་བ་ -འི་ ཕྱིར་ འཕགས་པ་ -འི་ བདེན་པ་ -འི་ ཚུལ་ ལ་ འཇུག་པ་ །

source: It knows the solitude of body, speech, and mind in order to tame beings through the vehicle of the pratyekabuddhas.
bo: རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -ས་ འདུལ་བ་ -འི་ ཕྱིར་ ལུས་ དང་ ། ངག་ དང་ ། སེམས་ རབ་ཏུ་ དབེན་པ་ -ར་ ཤེས་པ་ །

source: It attains the consecration at the stage of the wisdom of omniscience in order to tame beings through the Great Vehicle.
bo: ཐེག་པ་ ཆེན་པོ་ -ས་ འདུལ་བ་ -འི་ ཕྱིར་ ཐམས་ཅད་ མཁྱེན་པ་ -འི་ ཡེ་ཤེས་ ཀྱི་ ས་ -ར་ དབང་ བསྐུར་བ་ རབ་ཏུ་ ཐོབ་པ་ །

source: Such a Dharma discourse leads to the mastery of all teachings in order to express all the qualities of the Tathāgata. so that this discourse could be taught, elucidated, explained, recited, memorized, and understood.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡོན་ཏན་ ཐམས་ཅད་ བརྗོད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ -འི་ ཚུལ་ ལ་ འཇུག་པ་ འདི་ ལྟ་བུ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་པ་ -ར་ རབ་ཏུ་ བསྟན་པ་ དང་ ། བསྙད་པ་ དང་ ། བཤད་པ་ དང་ ། བཀླག་པ་ དང་ ། གཟུང་བ་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ དང་ །

source: He did this to satisfy all the hosts of bodhisattvas, to display the miraculous power of the Tathāgata, and to eliminate the doubts of the retinue.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཡོངས་སུ་ བསྐང་བ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ ཡང་དག་པ་ -ར་ བསྟན་པ་ དང་ ། འཁོར་ གྱི་ ཐེ་ཚོམ་ ཐམས་ཅད་ གཅད་པ་ དང་ །

source: He did it to defeat the entire retinue of Māra, to allow the teaching of the Tathāgata blaze forth, and to perform great buddha activity.
bo: བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཐམས་ཅད་ ཚར་ གཅད་པ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ བསྟན་པ་ འབར་བ་ -ར་ བྱ་བ་ དང་ ། སངས་རྒྱས་ ཀྱི་ མཛད་པ་ ཆེན་པོ་ ཡོངས་སུ་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ །

source: The Blessed One took his seat on the lion throne
bo: བཅོམ་ལྡན་འདས་ གདན་ སེང་གེ་ -འི་ ཁྲི་ དེ་ ལ་ བཞུགས་ སོ་ །། །།

source: Then, by the power of the Buddha, the following events occurred. The bodhisattva known as Ratnayaṣṭi attained the array of buddha ornaments absorption and magically adorned the entire retinue with buddha ornaments.
bo: དེ་ནས་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ སྲོག་ཤིང་ ཞེས་ བྱ་བ་ -ས་ སངས་རྒྱས་ ཀྱི་ རྒྱན་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ སངས་རྒྱས་ ཀྱི་ རྒྱན་ གྱིས་ བརྒྱན་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: Then the bodhisattva Sovereign of Powerful Reverberating Sound attained the lotus array absorption and conjured up flower garlands and bouquets and placed them in the hands of the entire retinue.
bo: དེ་ནས་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྒྲ་ བསྒྲགས་ སྟོབས་ ཀྱི་ རྒྱལ་པོ་ -ས་ པདྨ་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ གྱི་ ལག་པ་ རྣམས་ སུ་ མེ་ཏོག་ གི་ ལྡ་ལྡི་ དག་ དང་ ། མེ་ཏོག་ གི་ སྐོན་བུ་ རྣམས་ བྱིན་ གྱིས་ བརླབས་ ཏེ་ །

source: They proceeded to toss the flower garlands and the bouquets toward the Blessed One and the gathering of bodhisattvas.
bo: མེ་ཏོག་ གི་ ལྡ་ལྡི་ དང་ ། མེ་ཏོག་ གི་ སྐོན་བུ་ དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ཐམས་ཅད་ ལ་ མངོན་པར་ འཐོར་ རོ་ ། །

source: The bodhisattva named Ocean of Supreme Intelligence attained the fragrance array absorption and magically infused the fragrance of sandalwood into all the pores of the entire retinue.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ བློ་ མཆོག་ རྒྱ་མཚོ་ -ས་ དྲི་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ གྱི་ སྤུ་ -འི་ ཁུང་བུ་ ཐམས་ཅད་ དུ་ ཙན་དན་ སྦྲུལ་ གྱི་ སྙིང་པོ་ -འི་ དྲི་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva named Light-Web Bearer attained the light array absorption and magically imbued the entire retinue with limitless physical radiance.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ཟེར་ དྲ་བ་ ཅན་ གྱིས་ འོད་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ ལ་ ལུས་ ཀྱི་ འོད་ མཐའ་ཡས་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva named Mind of Great Compassion attained the unblinking gaze absorption and conjured upon the retinue an unblinking gaze when in the presence of the Tathāgata.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སྙིང་རྗེ་ ཆེན་པོ་ སེམས་པ་ -ས་ མིག་ མི་ འཛུམས་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མངོན་པར་ ཕྱོགས་ ཤིང་ མིག་ མི་ འཛུམས་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva named Immaculate Limitless Intelligence attained the absorption supremely delighted by the Dharma and magically imbued the entire retinue with the zeal for righteousness and with delight in and devotion toward the Dharma.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ བློ་ མཐའ་ ཡས་ དྲི་མེད་ ཀྱིས་ ཆོས་ ལ་ མཆོག་ ཏུ་ དགའ་བ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ ཆོས་ དོན་ དུ་ གཉེར་ ཞིང་ ཆོས་ ལ་ དགའ་བ་ དང་ མོས་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva called Ornamental Display of Courage attained the completely peaceful absorption and magically imbued the entire retinue with the removal of the five obstructions.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སྤོབས་པ་ -འི་ རྒྱན་ བཀོད་པ་ -ས་ རབ་ཏུ་ ཞི་བ་ དང་ ལྡན་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ སྒྲིབ་པ་ ལྔ་ རྣམ་པ་ -ར་ སེལ་བ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva called Sovereign Who Emanates All Phenomena attained the action devoid of forgetfulness absorption and magically imbued the entire retinue with mindfulness of the thought of awakening and with remembrance of the Tathāgata as the object of attention.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ -ས་ བརྗེད་པ་ མེད་པ་ -ར་ སྤྱོད་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ བྱང་ཆུབ་ ཀྱི་ སེམས་ དྲན་ ཞིང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ མི་ བརྗེད་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: The bodhisattva mahāsattva Illuminator attained the undefeatable absorption and magically imbued the entire retinue with the conquest of Māra and all adversaries.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཀུན་ ནས་ སྣང་བ་ ཞེས་ བྱ་བ་ -ས་ ཟིལ་ གྱིས་ མི་ ནོན་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནསཐམས་ ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ བདུད་ དང་ ། ཕྱིར་རྒོལ་བ་ བཅོམ་པ་ -ར་ བྱིན་ གྱིས་ བརླབས་ སོ་ ། །

source: Then, at that time, by the power of the Buddha, the bodhisattva Māra­pramardaka attained the conquering the entire retinue of Māra absorption.
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ བདུད་ རབ་ཏུ་ འཇོམས་པ་ -ས་ བདུད་ ཀྱི་ དཀྱིལ་འཁོར་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཇོམས་པ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ཏེ་ །
