Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: They know conditioned elements to be fabricated and unconditioned elements to be unfabricated.
bo: འདུས་བྱས་ ཀྱི་ ཁམས་ ནི་ མངོན་པར་ འདུ་བྱེད་པ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། འདུས་མ་བྱས་ ཀྱི་ ཁམས་ ནི་ མངོན་པར་ འདུ་ མི་ བྱེད་པ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that the elements of pollution are characterized by adventitious afflictive emotion and that the elements of purification are characterized by natural luminosity.
bo: ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ ཁམས་ ནི་ གློ་བུར་ གྱི་ ཉོན་མོངས་པ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། རྣམ་པ་ -ར་ བྱང་བ་ -འི་ ཁམས་ ནི་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that the realm of saṃsāra is characterized by incorrect ignorance and that the sphere of nirvāṇa is characterized by correct knowing.
bo: འཁོར་བ་ -འི་ ཁམས་ ནི་ ཚུལ་བཞིན་ མ་ཡིན་པ་ མ་རིག་པ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། མྱ་ངན་ ལས་ འདས་པ་ -འི་ དབྱིངས་ ནི་ ཚུལ་བཞིན་ རིག་པ་ -འི་ མཚན་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “In this way, the tathāgatas fully understand which elements establish the world, which elements fully establish it, which elements facilitate, and which elements obstruct.
bo: དེ་ལྟར་ ན་ འཇིག་རྟེན་ གནས་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། རབ་ཏུ་ གནས་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། རྗེས་སུ་ ཁྲིད་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། ཐོགས་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ །

source: They know which elements belong to engagement, which belong to reflection, which belong to determination, and which elements are supports.
bo: སྦྱོར་བ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། བསམ་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། ངེས་པར་ སེམས་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དང་ ། རྟེན་པ་ -འི་ ཁམས་ གང་ཡིན་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: With this understanding they teach the Dharma accordingly.
bo: མཁྱེན་ ནས་ ཀྱང་ དེ་བཞིན་ དུ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the fourth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཞི་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The lions among humans are skilled in the ways of all the elements.
bo: མི་ ཡི་ སེང་གེ་ ཁམས་ རྣམས་ ཀུན་ གྱི་ ཚུལ་ ལ་ མཁས་ ། །

source: Which elements are engaged where and in what ways
bo: གང་ དུ་ གང་ གི་ ཁམས་ ནི་ ཅི་འདྲ་ འཇུག་པ་ དང་ ། །

source: And which elements are the source of extensive virtue.
bo: ཁམས་ གང་ དགེ་བ་ རྒྱ་ ཆེན་ ཀུན་ དུ་ འབྱུང་བྱེད་པ་ ། །

source: “ ‘With their great insight, the sugatas know these elements:
bo: དེ་ ཀུན་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ མ་ ལུས་ རབ་ མཁྱེན་ ཏོ་ ། །

source: The experiences that propel merit, nonmerit, and neutrality,
bo: བསོད་ནམས་ བསོད་ནམས་ མིན་ དང་ མི་ གཡོ་ རྒྱུས་ བྱུང་ མྱོང་ ། །

source: And the element of peace that brings the attainment of deliverance
bo: གང་ གིས་ འབྱུང་བ་ ཐོབ་པ་ -ར་ འགྱུར་བ་ ཞི་བ་ -འི་ ཁམས་ ། །

source: And that, when established, brings liberation from the elements.
bo: ཁམས་ གང་ གནས་ ནས་ ཁམས་ ལས་ རྣམ་པ་ -ར་ གྲོལ་ འགྱུར་བ་ ། །

source: The sugatas know without exception
bo: ཁམས་ དེ་ ཤེས་རབ་ ཆེན་པོ་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ མཁྱེན་ ། །

source: “ ‘Knowing the elements of the eye, form, and mind to be naturally empty Is the essential conduct of the victors.
bo: མིག་ གི་ ཁམས་ དང་ དེ་བཞིན་ གཟུགས་ དང་ ཡིད་ ཀྱི་ ཁམས་ ། ། རང་བཞིན་ སྟོང་པ་ -ར་ རྒྱལ་བ་ -ས་ སྤྱོད་པ་ -འི་ བདག་ཉིད་ མཁྱེན་ ། །

source: Likewise, the elements of the ear, nose, tongue, and body,
bo: དེ་བཞིན་ རྣ་བ་ སྣ་ དང་ ལྕེ་ དང་ དེ་བཞིན་ ལུས་ ། །

source: And the elements of the mind and phenomena, are known to be perpetually empty.
bo: ཡིད་ དང་ ཆོས་ ཀྱི་ ཁམས་ ཀྱང་ རྟག་ ཏུ་ སྟོང་པ་ -ར་ མཁྱེན་ ། །

source: “ ‘The lions among humans know The elements of water, fire, earth, and air to be like space.
bo: ཆུ་ དང་ མེ་ དང་ ས་ དང་ རླུང་ གི་ ཁམས་ འདི་དག་ ། ནམ་མཁའ་ མཉམ་པ་ -ར་ མི་ ཡི་ སེང་གེ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: They know without exception that the realms of desire, form, and formlessness Emerge from conceptuality.
bo: འདོད་པ་ དང་ ནི་ གཟུགས་ དང་ གཟུགས་ མེད་ ཁམས་ འདི་དག་ ། ཡོངས་སུ་ རྟོག་ ལས་ ཡང་དག་ བྱུང་བ་ -ར་ མ་ ལུས་ མཁྱེན་ ། །

source: “ ‘The victors know the elements of pollution to lack a true nature.
bo: ཉོན་མོངས་ ཁམས་ ནི་ རྒྱལ་བ་ -ས་ རང་བཞིན་ མེད་པ་ -ར་ མཁྱེན་ ། །

source: The sugatas know the elements of purification to be like this as well.
bo: རྣམ་བྱང་ རང་བཞིན་ འདྲ་བ་ -ར་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ མཁྱེན་ ། །

source: The unskillful go on creating saṃsāra,
bo: མི་ མཁས་ དག་ གིས་ འཁོར་བ་ རྟག་ ཏུ་ འདུས་བྱས་ དང་ ། །

source: While nirvāṇa lacks the three characteristics of the conditioned.
bo: མྱ་ངན་ འདས་པ་ གང་ ལ་ མཚན་ཉིད་གསུམ་ མེད་ དང་ ། །

source: “ ‘Some elements are characterized by being engaged through nonvirtue,
bo: ཁམས་ གང་ མི་དགེ་བ་ -ས་ ནི་ འཇུག་པ་ -འི་ མཚན་ཉིད་ དང་ ། །

source: While others terminate all forms of engagement by means of virtue.
bo: གང་ཡང་ དགེ་བ་ -ས་ འཇུག་པ་ ཐམས་ཅད་ གཅོད་པ་ དང་ ། །

source: Though the buddhas understand this world comprised of various and manifold elements,
bo: སྣ་ཚོགས་ ཁམས་ དང་ དུ་མ་ -འི་ ཁམས་ ཅན་ འཇིག་རྟེན་ འདི་ ། ། སངས་རྒྱས་ མཁྱེན་ ཀྱང་

source: They are not conceited, thinking, “I know!”
bo: ངས་ མཁྱེན་ སྙམ་ དུ་ རློམ་སེམས་ མེད་ ། །

source: “ ‘These lions among humans fully understand the elements, Which are limitless like space.
bo: ནམ་མཁའ་ ཇི་ལྟ་ བཞིན་ དུ་ མཐའ་ ཡས་ ཕྱོགས་ རྣམས་ ཀྱི་ ། ། ཁམས་ རྣམས་ དེ་བཞིན་ མི་ ཡི་ སེང་གེ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: The sacred wisdom of the victors is unobstructed—
bo: རྒྱལ་བ་ -འི་ ཡེ་ཤེས་ དམ་པ་ དེ་ ནི་ ཐུག་པ་ མེད་ ། །

source: Beings are unable to fathom its range.
bo: དེ་ ཡི་ མཐའ་ ནི་ འགྲོ་བ་ རྣམས་ ཀྱིས་ ཤེས་ མི་ ནུས་ ། །

source: “ ‘This is the fourth activity of the pure protectors.
bo: འདི་ ནི་ སྐྱོབ་པ་ རྡུལ་མེད་ རྣམས་ ཀྱི་ འཕྲིན་ལས་ བཞི་ ། །

source: They know the procedure in terms of the elements for taming beings.
bo: དེ་ ཡིས་ སེམས་ཅན་ འདུལ་བ་ -འི་ ཁམས་ རྣམས་ ཆོ་ག་ མཁྱེན་ ། །

source: In the process of taming them, through the proper performance of acts,
bo: གང་དག་ ལས་ ལེགས་བྱས་པ་ -ས་ དུལ་ གྱུར་ དེ་དག་ ལ་ ། །

source: Even though there exist myriad delusions, these never occur to them.’
bo: འཁྲུལ་པ་ བརྒྱ་ལམ་ ན་ ཡང་ ནམ་ཡང་ མི་ འབྱུང་ ངོ་ ། །

source: “Son of noble family, the tathāgatas know, in accordance with reality, the levels of the faculties of other beings and individuals.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སེམས་ཅན་ གཞན་དག་ དང་ ། གང་ཟག་ གཞན་ རྣམས་ ཀྱི་ དབང་པོ་ -འི་ རིམ་པ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཇི་ལྟར་ སེམས་ཅན་ གཞན་དག་ དང་ །

source: You may ask, how do they know them in accordance with reality?
bo: གང་ཟག་ གཞན་ རྣམས་ ཀྱི་ དབང་པོ་ -འི་ རིམ་པ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: Son of noble family, they know, in accordance with reality, which beings are less gifted.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སེམས་ཅན་ དབང་པོ་ རྟུལ་པོ་ རྣམས་ ཀྱང་ སེམས་ཅན་ དབང་པོ་ རྟུལ་པོ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: Likewise, they know whose faculties are average, whose are sharp, whose are extraordinary, and whose are poor.
bo: དེ་བཞིན་ དུ་ དབང་པོ་ འབྲིང་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དབང་པོ་ རྣོ་བ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དབང་པོ་ ཁྱད་པར་ དུ་ འཕགས་པ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དབང་པོ་ དམན་པ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “They know how consummate attachment, aversion, and delusion arise from the dominant influence of conceptuality.
bo: ཡོངས་སུ་ རྟོག་པ་ -འི་ དབང་པོ་ ཇི་ལྟ་བུ་ -ས་ མཐའ་ -ར་ ཕྱིན་པ་ -འི་ འདོད་ཆགས་ སྐྱེ་བ་ དང་ ། མཐའ་ -ར་ ཕྱིན་པ་ -འི་ ཞེ་སྡང་ སྐྱེ་བ་ དང་ ། མཐའ་ -ར་ ཕྱིན་པ་ -འི་ གཏི་མུག་ སྐྱེ་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know how contrived attachment, aversion, and delusion arise from the dominant influence of conceptuality.
bo: ཡོངས་སུ་ རྟོག་པ་ -འི་ དབང་པོ་ ཇི་ལྟ་བུ་ -ས་ འདོད་ཆགས་ དང་ ། ཞེ་སྡང་ དང་ ། གཏི་མུག་ བཅོས་མ་ སྐྱེ་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know how perverted attachment, aversion, and delusion arise from the dominant influence of conceptuality.
bo: ཡོངས་སུ་ རྟོག་པ་ -འི་ དབང་པོ་ ཇི་ལྟ་བུ་ -ས་ སྣྲེལ་ ཞི་ -འི་ འདོད་ཆགས་ དང་ ། ཞེ་སྡང་ དང་ ། གཏི་མུག་ སྐྱེ་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know how destructive attachment, aversion, and delusion arise from the dominant influence of conceptuality.
bo: ཡོངས་སུ་ རྟོག་པ་ -འི་ དབང་པོ་ ཇི་ལྟ་བུ་ -ས་ ཚར་ བཅད་ ཅིང་ འདོད་ཆགས་ དང་ ། ཞེ་སྡང་ དང་ ། གཏི་མུག་ སྐྱེ་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: The tathāgatas know comprehensively how, from the dominant influence of conceptuality, some faculties originate from virtuous causes, some from nonvirtuous causes, some from neutral causes, and others from the causes of deliverance.
bo: ཡོངས་སུ་ རྟོག་པ་ -འི་ དབང་པོ་ ཇི་ལྟ་བུ་ -ས་ དབང་པོ་ གང་དག་ དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ དང་ ། དབང་པོ་ གང་དག་ མི་དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ དང་ ། དབང་པོ་ གང་དག་ མི་གཡོ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ དང་ ། དབང་པོ་ གང་དག་ འབྱུང་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “Moreover, son of noble family, the tathāgatas know the sense faculties of the eyes, ears, nose, tongue, body, and mind.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མིག་ གི་ དབང་པོ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། རྣ་བ་ -འི་ དབང་པོ་ དང་ ། སྣ་ -འི་ དབང་པོ་ དང་ ། ལྕེ་ -འི་ དབང་པོ་ དང་ ། ལུས་ ཀྱི་ དབང་པོ་ དང་ ། ཡིད་ ཀྱི་ དབང་པོ་ དང་ །

source: They know the male faculty, the female faculty, and the vital force.
bo: ཕོ་ -འི་ དབང་པོ་ དང་ ། མོ་ -འི་ དབང་པོ་ དང་ ། སྲོག་ གི་ དབང་པོ་ དང་ །

source: They understand the propensity for physical pleasure and pain, mental joy and grief, and equanimity.
bo: བདེ་བ་ -འི་ དབང་པོ་ དང་ ། སྡུག་བསྔལ་ གྱི་ དབང་པོ་ དང་ ། ཡིད་ བདེ་བ་ -འི་ དབང་པོ་ དང་ ། ཡིད་ མི་ བདེ་བ་ -འི་ དབང་པོ་ དང་ ། བཏང་སྙོམས་ ཀྱི་ དབང་པོ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the spiritual faculties of faith, vigor, mindfulness, absorption, and insight.
bo: དད་པ་ -འི་ དབང་པོ་ དང་ ། བརྩོན་འགྲུས་ ཀྱི་ དབང་པོ་ དང་ ། དྲན་པ་ -འི་ དབང་པོ་ དང་ ། ཏིང་ངེ་འཛིན་ གྱི་ དབང་པོ་ དང་ ། ཤེས་རབ་ ཀྱི་ དབང་པོ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the faculty that changes unknowing into omniscience, the faculty of omniscience, and the faculty endowed with omniscience.
bo: མི་ ཤེས་པ་ ཀུན་ཤེས་པ་ -ར་ བྱེད་པ་ -འི་ དབང་པོ་ དང་ ། ཀུན་ཤེས་པ་ -འི་ དབང་པོ་ དང་ ། ཀུན་ཤེས་པ་ དང་ ལྡན་པ་ -འི་ དབང་པོ་ རབ་ཏུ་ མཁྱེན་ ཏེ་ ། །

source: The tathāgatas understand which capacity caused by the sense power of the eyes will transform into a sense power for the ear, rather than into a sense power for the nose, tongue, or body.
bo: དབང་པོ་ གང་ མིག་ གི་ དབང་པོ་ -འི་ རྒྱུ་ལས་ བྱུང་ ལ་ རྣ་བ་ -འི་ དབང་པོ་ ལ་ གནས་པ་ -ར་ གྱུར་ ཏེ་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ ཀྱི་ དབང་པོ་ ལ་མ་ ཡིན་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They understand which capacity caused by the sense power of the ear will transform into a sense power for the nose, which capacity caused by the sense power of the nose will transform into a sense power for the tongue, which capacity caused by the sense power of the tongue will transform into a sense power for the body, and which capacity caused by the sense power of the body will transform into a sense power for the eye.
bo: དབང་པོ་ གང་ རྣ་བ་ -འི་ དབང་པོ་ -འི་ རྒྱུ་ལས་ བྱུང་ ལ་ སྣ་ -འི་ དབང་པོ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དང་ ། དབང་པོ་ གང་ སྣ་ -འི་ དབང་པོ་ -འི་ རྒྱུ་ལས་ བྱུང་ ལ་ ལྕེ་ -འི་ དབང་པོ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དང་ ། དབང་པོ་ གང་ ལྕེ་ -འི་ དབང་པོ་ -འི་ རྒྱུ་ལས་ བྱུང་ ལ་ ལུས་ ཀྱི་ དབང་པོ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དང་ ། དབང་པོ་ གང་ ལུས་ ཀྱི་ དབང་པོ་ -འི་ རྒྱུ་ལས་ བྱུང་ ལ་ མིག་ གི་ དབང་པོ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “To people who are capable of generosity and who apply themselves to moral conduct, the tathāgatas, understanding the range of capacities, give discourses on generosity.
bo: སེམས་ཅན་ གང་ སྦྱིན་པ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ཡང་ ཚུལ་ཁྲིམས་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ སྦྱིན་པ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who are capable of moral conduct and who apply themselves to generosity, the tathāgatas, understanding the range of capacities, give discourses on moral conduct.
bo: སེམས་ཅན་ གང་ ཚུལ་ཁྲིམས་ ཀྱི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ཡང་ སྦྱིན་པ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ ཚུལ་ཁྲིམས་ ཀྱི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who have the capacity for patience and who apply themselves to vigor, the tathāgatas, understanding the range of capacities, give discourses on patience.
bo: སེམས་ཅན་ གང་ བཟོད་པ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ བརྩོན་འགྲུས་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ བཟོད་པ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who are capable of vigor and who apply themselves to patience, the tathāgatas, understanding the range of capacities, give discourses on vigor.
bo: སེམས་ཅན་ གང་ བརྩོན་འགྲུས་ ཀྱི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ བཟོད་པ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ བརྩོན་འགྲུས་ ཀྱི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who have the capacity for concentration and who apply themselves to insight, the tathāgatas, understanding the range of capacities, give discourses on concentration.
bo: སེམས་ཅན་ གང་ བསམ་གཏན་ གྱི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ ཤེས་རབ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ བསམ་གཏན་ གྱི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who have the capacity for insight and who apply themselves to concentration, the tathāgatas, understanding the range of capacities, give discourses on insight.
bo: སེམས་ཅན་ གང་ ཤེས་རབ་ ཀྱི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ བསམ་གཏན་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ ཤེས་རབ་ ཀྱི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: Likewise, all factors of awakening should be comprehended in detail.
bo: དེ་བཞིན་ དུ་ བྱང་ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ལ་ ཡང་ རྒྱས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ ། །

source: “To people who have the capacity for the Śrāvaka Vehicle but apply themselves to the Pratyekabuddha Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Śrāvaka Vehicle.
bo: སེམས་ཅན་ གང་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who have the capacity for the Pratyekabuddha Vehicle but apply themselves to the Śrāvaka Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Pratyekabuddha Vehicle.
bo: སེམས་ཅན་ གང་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people who have the capacity for the Great Vehicle but apply themselves to the Śrāvaka Vehicle and the Pratyekabuddha Vehicle, the tathāgatas, understanding the range of capacities, give discourses on the Great Vehicle.
bo: སེམས་ཅན་ གང་ ཐེག་པ་ ཆེན་པོ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ ཐེག་པ་ ཆེན་པོ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people of the highest capacity who apply themselves to the Great Vehicle, the tathāgatas, understanding the range of capacities, give the final discourses.
bo: སེམས་ཅན་ གང་ ཐ་མ་ -འི་ དབང་པོ་ ཅན་ ཡིན་ ལ་ དེ་ -འང་ ཐེག་པ་ ཆེན་པོ་ ལ་ སྦྱོར་བ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ མཁྱེན་པ་ -ས་ ཐ་མ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: “When the tathāgatas know that those who are subject to a lack of fortune and who appear unfortunate are not receptive, they remain in equanimity.
bo: སེམས་ཅན་ སྐལ་བ་ མེད་པ་ -འི་ དབང་པོ་ ཅན་ སྐལ་བ་ མེད་པ་ -ར་ སྣང་བ་ དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སྣོད་ མ་ཡིན་པ་ -ར་ རིག་ ནས་ བཏང་སྙོམས་ སུ་ འཇོག་ གོ་ ། །

source: When the tathāgatas know that those who have the power of good fortune and who appear fortunate are worthy, they teach them the Dharma as they are venerated by them.
bo: སེམས་ཅན་ སྐལ་བ་ ཡོད་པ་ -འི་ དབང་པོ་ ཅན་ སྐལ་བ་ ཡོད་པ་ -ར་ སྣང་བ་ དག་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སྐལ་བ་ ཡོད་པ་ -ར་ རིག་ ནས་ རི་མོ་ -ར་ བྱས་ ཤིང་ ཆོས་སྟོན་ ཏེ་ །

source: “Son of noble family, in this way the tathāgatas know the developed and the undeveloped capacities of all sentient beings.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དབང་པོ་ ཡོངས་སུ་ སྨིན་པ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ །

source: They know the capacities that have not yet emerged as well as those that have emerged.
bo: དབང་པོ་ ཡོངས་སུ་ མ་ སྨིན་པ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ། འབྱུང་བ་ མ་ཡིན་པ་ -འི་ དབང་པོ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ །

source: The tathāgatas know in accordance with reality the capacities of beings, their aspects, their applications, their intentions, the causes from which they arise, their conditions, their reference points, their concordant causes, and their limits.
bo: འབྱུང་བ་ དང་ བཅས་པ་ -འི་ དབང་པོ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏེ་ ། སེམས་ཅན་ གྱི་ དབང་པོ་ -འི་ རྣམ་པ་ གང་ཡིན་པ་ དང་ ། སྦྱོར་བ་ གང་ཡིན་པ་ དང་ ། བསམ་པ་ གང་ཡིན་པ་ དང་ ། གང་ གི་ རྒྱུ་ལས་ བྱུང་བ་ དང་ ། རྐྱེན་ གང་ཡིན་པ་ དང་ ། དམིགས་པ་ གང་ཡིན་པ་ དང་ ། རྒྱུ་ འཐུན་པ་ གང་ཡིན་པ་ དང་ ། སེམས་ཅན་ གྱི་ དབང་པོ་ -འི་ མཐའ་ གང་ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏེ

source: This is the fifth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ལྔ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘With transcendent knowledge of faculties, they are wise regarding the intentions of beings.
bo: གང་ཞིག་ དབང་པོ་ ཤེས་པ་ -འི་ ཕ་རོལ་ སོན་པ་ སེམས་ཅན་ བསམ་པ་ རྣམས་ ལ་ མཁས་ ། །

source: The victors know well how beings’ conduct accords with their faculties.
bo: གང་ གི་ དབང་པོ་ -འི་ སྤྱོད་པ་ ཅི་འདྲ་ -ར་ གྱུར་པ་ ཐམས་ཅད་ རྒྱལ་བ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: The victors know the methods for those of exceptional, average, or poor faculties.
bo: རྒྱལ་བ་ དབང་པོ་ ཁྱད་པར་ཅན་ དང་ འབྲིང་ དང་ ཐ་མ་ -འི་ ཆོ་ག་ མཁྱེན་ གྱུར་ ཏེ་ ། །

source: Their incomparable deeds for liberating beings are outstanding.
bo: གང་ གིས་ འགྲོ་བ་ གྲོལ་ བྱེད་ མཚུངས་པ་ མེད་པ་ -འི་ ལས་ འདི་ ཁྱད་པར་ འཕགས་པ་ ཡིན་ ། །

source: “ ‘They know the faculties by which afflictive emotions are consummated, contrived, Accumulated, and perverted.
bo: གང་ གིས་ མཐའ་ -ར་ ཕྱིན་པ་ ཡི་ ཉོན་མོངས་ གྱུར་ དང་ གང་ གིས་ བཅོས་པ་ -ར་ གྱུར་པ་ དང་ ། ། དབང་པོ་ གང་ གིས་ གསོག་ ཏུ་ གྱུར་པ་ དང་ ནི་ གང་ གིས་ སྣྲེལ་ ཞི་ -ར་ གྱུར་པ་ དང་ ། །

source: They know the faculties of destructive afflictive emotions and those of virtue, Those that are neutral, those that are nonvirtuous, and those that are liberating.
bo: ཉོན་མོངས་པ་ དག་ ཚར་གཅོད་ འགྱུར་ དང་ དགེ་བ་ -འི་ དབང་པོ་ དང་ ནི་ མི་ གཡོ་ དང་ ། ། དེ་བཞིན་ མི་དགེ་བ་ དང་ གཞན་ ཡང་ གྲོལ་བ་ -ར་ འགྱུར་བ་ དག་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘They understand the sense faculties from the eye to the mind, the male and female faculties, The vital force, the propensities for pleasure and pain, joy, grief, and equanimity, The spiritual faculties of faith, vigor, mindfulness, insight, and one-pointedness, The method for the faculties for omniscience and for making all known, and the faculty for liberation.
bo: གང་ གིས་ མིག་ དང་ ཡིད་ དང་ ཕོ་མོ་ སྲོག་ གི་ དབང་པོ་ དང་ ནི་ བདེ་བ་ དང་ ། ། སྡུག་བསྔལ་ དང་ ནི་ ཡིད་ བདེ་བ་ དང་ གང་ གིས་ ཡིད་ མི་ བདེ་བ་ -ར་ འགྱུར་བ་ དང་ ། ། གང་ གིས་ བཏང་སྙོམས་ དད་ དང་ བརྩོན་འགྲུས་ དྲན་ དང་ ཤེས་རབ་ དེ་བཞིན་ རྩེ་གཅིག་ འགྱུར་ ། ། ཀུན་ཤེས་ བྱེད་ དང་ ཀུན་ཤེས་ དབང་པོ་ -འི་ ཆོ་ག་ དང་ ནི་ གྲོལ་བ་ -འི་ དབང་པོ་ གང་ཡིན་ མཁྱེན་ ། །

source: “ ‘They know what occurs due to the cause of the eye and is made present to the ear rather than to the nose and the tongue,
bo: མིག་ གི་ རྒྱུ་ལས་ བྱུང་ ལ་ རྣ་བ་ -ར་ གནས་པ་ -ར་ བྱེད་ ཀྱི་ སྣ་ དང་ ལྕེ་ ལ་ མིན་ ། །

source: And what occurs due to causes up to the body and in turn is present to the eye.
bo: ལུས་ ཀྱི་ བར་ གྱི་ རྒྱུ་ལས་ བྱུང་བ་ -ར་ གྱུར་ ལ་ དེ་ཡང་ མིག་ ལ་ གནས་པ་ དང་ ། །

source: To people with the capacity for generosity who exemplify moral conduct they give talks on generosity.
bo: སྦྱིན་པ་ -འི་ དབང་པོ་ ཡིན་ ལ་ ཚུལ་ཁྲིམས་ སྣང་བ་ -འི་ མི་ དེ་ ལ་ ནི་ སྦྱིན་པ་ -འི་ གཏམ་ ། །

source: To people with the capacity for moral conduct who exemplify generosity they give talks on moral conduct.
bo: ཚུལ་ཁྲིམས་ དབང་པོ་ ཡིན་ ལ་ སྦྱིན་པ་ -འི་ སྣང་བ་ -འི་ མི་ དེ་ ལ་ ནི་ ཚུལ་ཁྲིམས་ གཏམ་ ། །

source: “ ‘To people with the capacity for patience who exemplify vigor they give talks on patience.
bo: བཟོད་པ་ -འི་ དབང་པོ་ ཡིན་ ལ་ བརྩོན་འགྲུས་ སྣང་བ་ -འི་ མི་ལ་ བཟོད་པ་ -འི་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people with the capacity for vigor who exemplify patience they give talks on vigor.
bo: བརྩོན་འགྲུས་ དབང་པོ་ ཡིན་ ལ་ བཟོད་པ་ -ར་ སྣང་བ་ -འི་ མི་ དེ་ ལ་ ནི་ བརྩོན་འགྲུས་ གཏམ་ ། །

source: To people with the capacity for concentration who exemplify insight they give talks on concentration.
bo: བསམ་གཏན་ དབང་པོ་ ཡིན་ ལ་ ཤེས་རབ་ སྣང་བ་ -འི་ མི་ དེ་ ལ་ ནི་ བསམ་གཏན་ གཏམ་ སྟོན་ ཏོ་ ། །

source: To people with the capacity for insight who exemplify concentration they give talks on insight.
bo: ཤེས་རབ་ དབང་པོ་ ཡིན་ ལ་ བསམ་གཏན་ སྣང་བ་ -འི་ མི་ དེ་ ལ་ ནི་ ཤེས་རབ་ གཏམ་ སྟོན་ ཏོ་ ། །

source: “ ‘To people who have the capacity for the Śrāvaka Vehicle but apply themselves to the Pratyekabuddha Vehicle
bo: གང་དག་ ཉན་ཐོས་ ཐེག་པ་ -འི་ དབང་པོ་ ཡིན་ ལ་ རང་རྒྱལ་ སྦྱོར་བ་ -ར་ བྱེད་པ་ -འི་ མི་ ། །

source: They will give discourses on śrāvakas but cease those about pratyekabuddhas.
bo: དེ་དག་ ལ་ ནི་ ཉན་ཐོས་ གཏམ་ སྟོན་ བྱེད་ ཀྱི་ རང་རྒྱལ་ གཏམ་ ནི་ སྤོང་བ་ -ར་ བྱེད་ ། །

source: To those whose capacity is definitely for the Pratyekabuddha Vehicle but who apply themselves to words They teach the methods and faculties suited to the Dharma of the Pratyekabuddha Vehicle.
bo: གང་ གི་ དབང་པོ་ རྐྱེན་ གྱི་ ཐེག་པ་ -ར་ ངེས་ ལ་ སྒྲ་ ལ་ སྦྱོར་བྱེད་ གནས་བྱེད་པ་ ། ། དེ་དག་ ལ་ ནི་ རྐྱེན་ གྱི་ ཐེག་པ་ བསྟན་པ་ -འི་ ཆོ་ག་ དག་ དབང་ རབ་ཏུ་ སྟོན་ ། །

source: “ ‘To those whose capacity is definitely for the Great Vehicle but who resort to something inferior
bo: གང་དག་ དབང་པོ་ ཐེག་པ་ ཆེན་པོ་ -ར་ ངེས་ ལ་ སྦྱོར་བ་ དམན་པ་ -འི་ མི་ རྣམས་ གང་ཡིན་པ་ ། །

source: They discourse on the transcendent perfections of the victors who abide in great compassion.
bo: དེ་དག་ ལ་ ནི་ ཐུགས་རྗེ་ ཆེ་ ལ་ གནས་པ་ -འི་ རྒྱལ་བ་ -འི་ ཕ་རོལ་ ཕྱིན་ གཏམ་ སྟོན་ ། །

source: Knowing who is ready and who is not, victors teach the former and are equanimous toward the latter.
bo: སྐལ་བ་ ཡོད་མེད་ མཁྱེན་ ནས་ རྒྱལ་བ་ གསུང་ ཞིང་ཁ་ ཅིག་ ལ་ ནི་ བཏང་སྙོམས་ འཇོག་ །

source: Through the ten strengths they know which capacities have developed and which have not.
bo: དབང་པོ་ ཡོངས་སུ་ སྨིན་ དང་ གང་ཡང་ དབང་པོ་ ཡོངས་ མ་ སྨིན་པ་ སྟོབས་ བཅུ་ -ས་ མཁྱེན་ ། །

source: “ ‘They know the form of conduct of peoples’ capacities and how it is applied,
bo: མི་ ཡི་ དབང་པོ་ -འི་ སྤྱོད་པ་ -འི་ རྣམ་པ་ གང་དང་གང་ གི་ སྦྱོར་བ་ ཇི་ལྟ་ དང་ ། །

source: Likewise their intentions and what their circumstances and their causes are,
bo: བསམ་པ་ ཇི་ལྟ་བ་ དང་ རྐྱེན་ གང་ཡིན་ དང་ ཇི་ལྟར་ རྒྱུ་ གང་ཡིན་པ་ -འང་ མཁྱེན་ ། །

source: And likewise their reference points, their limits, and their corresponding causes.
bo: དམིགས་པ་ ཇི་ལྟ་བ་ དང་ མཐར་ཐུག་ ཇི་ འདྲ་ -ར་ གྱུར་ དང་ རྒྱུ་ འཐུན་ དེ་བཞིན་ དུ་ ། །

source: Knowing with spontaneous wisdom, their buddha activity of teaching is unerring.’
bo: རང་བྱུང་ ཡེ་ཤེས་ ཀྱིས་ མཁྱེན་ སྟོན་པ་ -འི་ འཕྲིན་ལས་ འདི་ ན་ ནོར་བ་ ཡོད་ མ་ ཡིན་ ། །

source: “Son of noble family, the tathāgatas know in accordance with reality the paths that lead to all destinies.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཐམས་ཅད་ དུ་ འགྲོ་བ་ -འི་ ལམ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, how do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །
