Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: Even though the knowledge of the guide of all beings expands, Their praise remains inconceivable for many eons.”
bo: སེམས་ཅན་ ཐམས་ཅད་ འདྲེན་པ་ ཤེས་རབ་ ཆེ་ -ར་ གྱུར་ ཀྱང་ ། ། དེ་ ཡི་ བསྔགས་པ་ བསྐལ་པ་ མང་པོ་ -ར་ བསམ་ མི་ ཁྱབ་ །། །།

source: At this time, the Blessed One expressed his approval to the bodhisattva mahāsattva Dhāraṇīśvara­rāja:
bo: ཐ་མ་ ། དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ ལེགས་ སོ་བྱ་བ་ གནང་ སྟེ་ །

source: “Dhāraṇīśvara­rāja, it is excellent that you have explained this dhāraṇī teaching so well, that you have assumed responsibility for these teachings, and that you were motivated to request the profound words on the dhāraṇī gateway from previous tathāgatas.
bo: གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཁྱོད་ ཀྱིས་ གཟུངས་ རྣམ་པ་ -ར་ ངེས་པར་ བསྟན་པ་ འདི་ ལེགས་པ་ -ར་ བཤད་པ་ དང་ ། ཇི་ལྟར་ ཡང་ ཁྱོད་ ཆོས་ འདི་དག་ ལ་ གཞན་ གྱི་ དྲིང་ མི་ འཇོག་པ་ དང་ ། ཇི་ལྟར་ ཡང་ ཁྱོད་ སྔོན་ གྱི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ལ་ གཟུངས་ ཀྱི་ སྒོ་ -འི་ ཚིག་ ཟབ་མོ་ རྣམས་ ཡོངས་སུ་ འདྲི་བ་ -འི་ རང་བཞིན་ ཅན་ དུ་ གྱུར་པ་

source: It is very good!
bo: ལེགས་ སོ་ ལེགས་ སོ་ ། །

source: Therefore, Dhāraṇīśvara­rāja, you should also know what has transpired by way of the following discourse.
bo: དེ་ -འི་ ཕྱིར་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཁྱོད་ ཀྱིས་ རྣམ་ གྲངས་ འདི་ -ས་ ཀྱང་ འདི་ལྟར་ རིག་པ་ -ར་ བྱ་ -འོ་ ། །

source: “Once, in times past, inconceivably many eons ago, during the eon Illuminating, in a world called Stainless, a tathāgata, a buddha, a blessed one known as Stainless Illumination appeared in the world.
bo: གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ སྔོན་བྱུང་བ་ འདས་པ་ -འི་ དུས་ ན་ བསྐལ་པ་ གྲངས་མེད་པ་ -འི་ ཡང་ ཆེས་ གྲངས་མེད་པ་ རྒྱས་པ་ ཚད་ མེད་པ་ ། བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -ར་ གྱུར་པ་ ། དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ རྣམ་པ་ -ར་ སྣང་བྱེད་ ཀྱི་ བསྐལ་པ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་མ་ མེད་པ་ -ར་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ ཞེས་ བྱ་བ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཞེས་ བྱ་བ་ -འི་ བར་ དུ་ གྱུར་པ་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ ། །

source: The world Stainless was pure like lapis lazuli.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་མ་ མེད་པ་ དེ་ཡང་ བཻ་ དཱུརྱ་ ལྟར་ དག་པ་ -ར་ གྱུར་ ཏེ་ །

source: It was like a mirror wiped completely free of dust and was as smooth as the palm of a hand.
bo: མེ་ལོང་ ལྟ་བུ་ -ར་ ཤིན་ཏུ་ བྱི་དོར་ བྱས་པ་ ། ལག་མཐིལ་ ལྟར་ མཉམ་པ་ -འོ་ ། །

source: In that world grew fruit trees of the seven precious substances with jeweled branches, leaves, flowers, and fruits.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ -ར་ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱི་ ཤིང་ ལྗོན་པ་ རིན་པོ་ཆེ་ -འི་ ཡལ་ག་ དང་ ། ལོ་མ་ དང་ ། མེ་ཏོག་ དང་ ། འབྲས་བུ་ -ར་ ལྡན་པ་ དག་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: There were many different beautiful lotus flowers the size of chariot wheels made of gold extracted from the Jambu River.
bo: འཛམ་བུ་ -འི་ ཆུ་བོ་ -འི་ གསེར་ གྱི་ པད་མ་ ཚད་ཤིང་ རྟ་ -འི་ ཕང་ལོ་ ཙམ་ དུ་ གྱུར་པ་ སྣ་ཚོགས་པ་ ། བལྟ་ ན་ སྡུག་པ་ དག་ ཀྱང་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: “In that world divine and human beings enjoyed themselves in opulent multistoried mansions.
bo: ལྷ་ དང་ མི་ དེ་དག་ ཀྱང་ རིན་པོ་ཆེ་ -འི་ ཁང་པ་ བརྩེགས་པ་ ལ་ ཡོངས་སུ་ ལོངས་སྤྱོད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: Food and drink appeared at the mere thought of it.
bo: ཟས་ དང་ སྐོམ་ ཡང་ བསམས་པ་ ཙམ་ གྱིས་ འབྱོར་ ཏེ་ །

source: The amusements enjoyed by these divine and human beings resembled the amusements enjoyed by the gods of the Para­nirmitavaśavartin heaven.
bo: འདི་ལྟ་སྟེ་ ། དཔེར་ན་ གཞན་འཕྲུལ་ དབང་ བྱེད་ ཀྱི་ ལྷ་ རྣམས་ ཀྱི་ ལོངས་སྤྱོད་ དག་ ཡོངས་སུ་ སྤྱོད་པ་ ལྟར་ ལྷ་ དང་ མི་ དེ་དག་ གི་ ལོངས་སྤྱོད་ དང་ ། ཡོངས་སུ་ སྤྱོད་པ་ ཡང་ དེ་ འདྲ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: These divine and human beings had only a modicum of attachment, aversion, and delusion. They were handsome and refined.
bo: ལྷ་ དང་ མི་ དེ་དག་ ཀྱང་ འདོད་ཆགས་ ཆུང་བ་ ། ཞེ་སྡང་ ཆུང་བ་ ། གཏི་མུག་ ཆུང་བ་ ། རྣམ་པ་ བཟང་བ་ ། ཤིན་ཏུ་ རྣམ་པ་ -ར་ རིག་པ་ -ར་ བྱེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “This world had neither sun nor moon.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ནི་ ཉི་མ་ དང་ ཟླ་བ་ -ར་ བཏགས་པ་ རྣམས་ མེད་པ་ -ར་ གྱུར་ ཏེ་ །

source: The Blessed Tathāgata Stainless Illumination lit up the entire buddhafield with a glow that emanated from his body.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ དེ་ ནི་ ལུས་ ཀྱི་ འོད་ ཀྱིས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གསལ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: The world even lacked names for day and night; the closing of the lotus flowers marked nighttime and their opening marked daytime.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ པད་མ་ ཁ་ ཟུམ་པ་ -ས་ མཚན་མོ་ ཞེས་ བྱ་བ་ དང་ པད་མ་ ཁ་ བྱེ་ བས་ ཉིན་ མོ་ -ར་ བགྲང་བ་ མ་གཏོགས་པ་ -ར་ ཉིན་མཚན་ དུ་ གདགས་པ་ མེད་ དོ་ ། །

source: “This tathāgata’s bodhisattva saṅgha comprised countless ordained bodhisattvas in a state of equipoise.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ དེ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ དགེ་འདུན་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རབ་ཏུ་ བྱུང་བ་ སྙོམས་པར་ ཞུགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱེ་བ་ བརྒྱ་ ཕྲག་ དྲུག་ཅུ་ -ར་ གྱུར་ ཏོ་ ། །

source: There were innumerable householders who had embarked on unsurpassed perfect awakening.
bo: ཁྱིམ་པ་ ཚད་ མེད་པ་ དག་ ནི་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ལ་ ཡང་དག་པ་ -ར་ ཞུགས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: Here, no vehicles except the Great Vehicle were disseminated.
bo: དེ་ ནི་ ཐེག་པ་ ཆེན་པོ་ མ་གཏོགས་པ་ -ར་ ཐེག་པ་ རྣམ་པ་ -ར་ དགོད་པ་ གཞན་ མེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: The Blessed One taught the pure irreversible sermon, and his lifespan lasted half an eon.
bo: བཅོམ་ལྡན་འདས་ དེ་ ནི་ ཕྱིར་ མི་ ལྡོག་པ་ དག་པ་ -འི་ གཏམ་ ཡང་དག་པ་ -ར་ སྟོན་ ཏོ་ ། ། བཅོམ་ལྡན་འདས་ དེ་ -འི་ སྐུ་ཚེ་ -འི་ ཚད་ ནི་ བསྐལ་པ་ ཕྱེད་ དུ་ གྱུར་ ཏོ་ ། །

source: It was a world in which people did not grow old or die.
bo: མི་ རྣམས་ ཀྱང་ བར་མ་དོ་ -ར་ འཆི་བ་ -འི་ དུས་ བྱེད་པ་ མེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: In this buddhafield, those who dwelled in multistoried houses located on the ground were considered ‘human’ beings, while those who dwelled in multistoried houses located in the sky were considered ‘divine’ beings. Other than that, there was no distinction between the divine and the human beings in terms of their complexions or enjoyments.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ གང་དག་ ས་ ལ་ གནས་པ་ -འི་ ཁང་པ་ བརྩེགས་པ་ རྣམས་ ན་ གནས་པ་ དེ་དག་ ནི་ མི་ ཞེས་ བྱ་བ་ -འི་ གྲངས་ སུ་ འགྲོ་ ། གང་དག་ ནམ་མཁའ་ ལ་ གནས་པ་ -འི་ ཁང་པ་ བརྩེགས་པ་ རྣམས་ ན་ གནས་པ་ དེ་དག་ ནི་ ལྷ་ ཞེས་ བྱ་བ་ -འི་ གྲངས་ སུ་ འགྲོ་བ་ མ་གཏོགས་པ་ -ར་ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ཁ་དོག་ དང་ ། ཡོངས་སུ་ སྤྱོད་པ་ ཐ་དད་ དུ་ བྱ་བ་ མེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “In that world there were no kings, except for the blessed, unsurpassed Dharma king.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ བཅོམ་ལྡན་འདས་ ཆོས་ ཀྱི་ རྒྱལ་པོ་ བླ་ ན་ མེད་པ་ དེ་ མ་གཏོགས་པ་ -ར་ རྒྱལ་པོ་ གཞན་ གང་ཡང་ མེད་ དོ་ ། །

source: In that world, there was no one except for the divine and human beings who performed acts of worship to that tathāgata.
bo: ལྷ་ དང་ མི་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་པ་ དང་ །

source: There were no gods except for those who aspired to listen to the Dharma.
bo: ཆོས་ ཉན་པ་ ལ་ འདུན་པ་ -ར་ གྱུར་པ་ མ་གཏོགས་པ་ -ར་ ལྷ་ གཞན་ མེད་ །

source: There were no other teachers. No one kowtowed to others, performed superfluous deeds, or thought of anything else.
bo: སྟོན་པ་ གཞན་ མེད་ ། གཞན་ ལ་ ཕྱག་ མི་ འཚལ་ ། ལས་ གཞན་ མི་ བྱེད་ ། གཞན་ ཡིད་ ལ་ མི་ བྱེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “In this world no one was designated ‘a woman.’ Among its beings, no one was designated ‘a sinner,’ and no one was designated ‘a transgressor of the training.’
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ བུད་མེད་ དུ་ གདགས་པ་ མེད་ དོ་ ། ། སེམས་ཅན་ དེ་དག་ བསླབ་པ་ གསུམ་པོ་ དག་ ལ་ སློབ་པ་ མ་གཏོགས་པ་ -ར་ ལྟུང་བ་ -ར་ གདགས་པ་ མེད་ དོ་ ། །

source: There were only those who trained in the three precepts.
bo: བསླབ་པ་ ལས་ འདའ་བ་ -ར་ གདགས་པ་ མེད་ དོ་ ། །

source: What are the three precepts?
bo: བསླབ་པ་ གསུམ་ གང་ཞེ་ན་ །

source: They are the precepts of advanced morality, advanced contemplation, and advanced insight.
bo: འདི་ལྟ་སྟེ་ ། ལྷག་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ བསླབ་པ་ དང་ ། ལྷག་པ་ -འི་ སེམས་ ཀྱི་ བསླབ་པ་ དང་ ། ལྷག་པ་ -འི་ ཤེས་རབ་ ཀྱི་ བསླབ་པ་ -འོ་ ། །

source: “What is the precept of advanced morality?
bo: དེ་ ལ་ ལྷག་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ བསླབ་པ་ གང་ཞེ་ན་ །

source: It consists in not forsaking the mind of omniscience and in abandoning everything conditioned.
bo: གང་ ཐམས་ཅད་ མཁྱེན་པ་ -འི་ སེམས་ མི་ གཏོང་བ་ དང་ ། མངོན་པར་ འདུ་བྱེད་པ་ ཐམས་ཅད་ རྣམ་པ་ -ར་ སྤོང་བ་ -འོ་ ། །

source: What is the precept of advanced contemplation?
bo: དེ་ ལ་ ལྷག་པ་ -འི་ སེམས་ ཀྱི་ བསླབ་པ་ གང་ཞེ་ན་ །

source: It consists in attaining advanced understanding through settling in absorption.
bo: གང་ ཏིང་ངེ་འཛིན་ ལ་ རབ་ཏུ་ གནས་ ནས་ ལྷག་པ་ -འི་ ཤེས་རབ་ ཐོབ་པ་ -འོ་ ། །

source: What is the precept of advanced insight?
bo: དེ་ ལ་ ལྷག་པ་ -འི་ ཤེས་རབ་ ཀྱི་ བསླབ་པ་ གང་ཞེ་ན་ །

source: It consists in attaining discriminating knowledge through being established in the perfection of insight.
bo: གང་ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ལ་ རབ་ཏུ་ གནས་ ནས་ ། སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ཐོབ་པ་ -འོ་ ། །

source: “Those bodhisattvas engaged in precepts like these without prior scriptural transmission.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ནི་ ལུང་ ཕོག་པ་ མེད་པ་ -ར་ བསླབ་པ་ འདི་ ལྟ་བུ་ དག་ ལ་ སློབ་པ་ དག་ གོ་ ། །

source: This world realm was pure in this way.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ནི་ དེ་ལྟ་ བུར་ ཡོངས་སུ་ དག་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: The doctrinal exposition of this blessed one was pure in this way.
bo: བཅོམ་ལྡན་འདས་ དེ་ -འི་ ཆོས་ བསྟན་པ་ ཡང་ དེ་ལྟ་ བུར་ ཡོངས་སུ་ དག་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “At that time, a bodhisattva known as Glorious Light was present in the retinue that had gathered.
bo: དེ་ -འི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ ཞེས་ བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་ ཏེ་ །

source: He rose from his seat and asked the Tathāgata,
bo: འདུག་པ་ -ར་ གྱུར་པ་ དེ་ སྟན་ ལས་ ལངས་ ཏེ་ །

source: ‘Blessed One, if one speaks of retaining dhāraṇī, what is the dhāraṇī in which the blessed bodhisattvas are established so that everything taught by all the blessed buddhas is upheld, the Dharma does not fade away once it has been taught, and all sentient beings are satisfied through its eloquent explanation?’
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། ། བཅོམ་ལྡན་འདས་ གཟུངས་ གཟུངས་ ཞེས་ བགྱི་ ན་ ། བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ ། གཟུངས་ གང་ ལ་ རབ་ཏུ་ གནས་ ནས་ ། སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་པ་ དང་ ། ཆོས་ བསྟན་པ་ ན་ ཟད་པར་ མི་འགྱུར་བ་ དང་ ། ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བགྱིད་པ་ -འི་ གཟུངས་ དེ་ གང་ ལགས་ ། དེ་སྐད་ ཅེས་ གསོལ་པ་ དང་ །

source: “That blessed one replied,
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ དེ་ -ས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: ‘Son of noble family, it is good that you thought to ask the Tathāgata about this point. There is a dhāraṇī called jewel lamp.
bo: རིགས་ ཀྱི་ བུ་ ཁྱོད་ གང་ གི་ ཕྱིར་ ། དེ་བཞིན་ གཤེགས་པ་ ལ་དོན་ འདི་ ཡོངས་སུ་ དྲི་བ་ -ར་ སེམས་པ་ ལེགས་ སོ་ ལེགས་ སོ་ ། ། རིགས་ ཀྱི་ བུ་ རིན་ཆེན་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ ཡོད་ དེ་ །

source: Bodhisattvas who are established in this dhāraṇī retain all the buddha teachings and appease all sentient beings through eloquent explanation.’
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དག་ གཟུངས་ དེ་ ལ་ རབ་ཏུ་ གནས་ ནས་ ། སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་ ཏོ་ ། ། ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་ དོ་ ། །

source: “Then Glorious Light requested the Tathāgata,
bo: དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ ལ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ གྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: ‘Blessed One, please introduce the jewel lamp dhāraṇī so that we may practice accordingly what we hear and so that we may attain this dhāraṇī.’
bo: བཅོམ་ལྡན་འདས་ གང་ ཐོས་པ་ -ས་ བདག་ཅག་ དེ་བཞིན་ དུ་ སྒྲུབ་ ཅིང་ ། གཟུངས་ འདི་ འཐོབ་པ་ -ར་ འགྱུར་བ་ -ར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ལ་ གང་ ཆུང་ ཟད་ འཇུག་པ་ ཙམ་ ཞིག་ ལེགས་པ་ -ར་ བཤད་ དུ་ གསོལ་ །

source: In reply the Tathāgata uttered the following verses:
bo: དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ -ས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ ལ་ཚིགས་ སུ་ བཅད་ དེ་ བཀའ་ སྩལ་པ་ །

source: “ ‘Freed from the dregs of afflictive emotions,
bo: ཉོན་མོངས་ རྣམས་ ཀྱི་ རྡུལ་ དང་ བྲལ་ གྱུར་ ཏེ་ །

source: Stainless and purged of all defilements,
bo: དྲི་མ་ མེད་ ཅིང་ དྲི་མ་ ཀུན་ དུ་ སྤངས་ ། །

source: The mind is stainless and perpetually pure.
bo: སེམས་ ནི་ རྟག་ ཏུ་ དག་ ཅིང་ དྲི་མེད་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Through body, verbal expressions, and mind, One is luminous, stainless, and free of blemish like the moon.
bo: ལུས་ ཀྱིས་ ངག་ རྣམས་ དག་ ཅིང་ ཡིད་ ཀྱིས་ ནི་ ། ། ཟླ་བ་ ལྟ་བུ་ -ར་ དྲི་བྲལ་ དྲི་མེད་ འོད་ ། །

source: One has a loving intent and mental equanimity. Such is the jewel lamp dhāraṇī.
bo: བྱམས་པ་ -འི་ སེམས་ དང་ ཡིད་ ཀྱང་ སྙོམས་ གྱུར་པ་ ། ། འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Released from dualistic views And freed from all thoughts and conceptualizing, One comprehends all conceptions.
bo: གཉིས་ སུ་ ལྟ་བ་ དག་ ལས་ རྣམ་གྲོལ་ ཞིང་ ། ། རྟོག་ དང་ རྣམ་པ་ -ར་ རྟོག་ དང་ ཀུན་ དུ་ བྲལ་ ། ། འདུ་ཤེས་ རྣམས་ ནི་ ཡོངས་སུ་ ཤེས་ གྱུར་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Engaged in mindfulness, intelligence, and understanding
bo: དྲན་ དང་ བློ་གྲོས་ རྟོག་ ལ་ འཇུག་པ་ འགྲུབ་ ། །

source: And endowed with qualities and vast insight,
bo: ཤེས་རབ་ ཆེ་ ལྡན་ ཡོན་ཏན་ རྣམས་ དང་ ལྡན་ ། །

source: One is pure and stainless like the center of the sky.
bo: ནམ་མཁའ་ -འི་ དཀྱིལ་ ལྟར་ དྲི་མ་ མེད་ ཅིང་ དག་ །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘The Three Jewels are an unbroken continuity. One is freed from the three existences, the three stains having been relinquished,
bo: དཀོན་མཆོག་ གསུམ་པོ་ རྒྱུན་ མི་འཆད་པ་ དང་ ། ། དྲི་ གསུམ་ རྣམ་ སྤངས་ སྲིད་པ་ གསུམ་ ལས་ གྲོལ་ ། །

source: And the duality of a doubting dualistic mind is terminated.
bo: གཉིས་ ལ་ ཡིད་གཉིས་ ཟ་བ་ མཐའ་ -ར་ འབྱིན་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ནི་ དག་པ་ ཡིན་ ། །

source: “ ‘Desire, aversion, and ignorance conquered,
bo: འདོད་ཆགས་ དང་ ནི་ ཞེ་སྡང་ གཏི་མུག་ བཅོམ་ ། །

source: One is endowed with all qualities, the dregs of degenerate times left behind,
bo: དུས་ ངན་ རྙོག་ སྤངས་ ཡོན་ཏན་ ཀུན་ དང་ ལྡན་ ། །

source: And the visual distortion of obstructing afflictive emotions is removed.
bo: ཉོན་མོངས་ མུན་པ་ རབ་རིབ་ སེལ་ བྱེད་པ་ ། །

source: Such is the supreme jewel lamp dhāraṇī.
bo: རིན་ཆེན་ སྒྲོན་མ་ གཟུངས་ ཀྱི་ མཆོག་ ཡིན་ ནོ་ ། །

source: “ ‘One having become immersed in all languages, As many as there are in the worlds, The lowest, the mediocre, and the highest,
bo: འཇིག་རྟེན་ དག་ ན་ སྒྲ་ སྐད་ ཐ་མ་ དང་ ། ། འབྲིང་ དང་ མཆོག་ ནི་ ཇི་སྙེད་ ཡོད་པ་ དག་ ། སྒྲ་ རྣམས་ ཀུན་ ལ་ ཤིན་ཏུ་ ཞུགས་ གྱུར་པ་ ། །

source: The jewel lamp dhāraṇī remains unsullied.
bo: རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ནི་ རྡུལ་ དང་ བྲལ་ ། །

source: “ ‘Endowed with profound teachings And with infinite and multifarious words and syllables,
bo: ཟབ་མོ་ -འི་ ཆོས་ རྣམས་ དང་ ནི་ ལྡན་ གྱུར་ ཅིང་ ། ། ཚིག་ དང་ ཡིག་འབྲུ་ སྣ་ཚོགས་ མཐའ་ ཡས་ མང་ ། །

source: One is without failure for oneself or others.
bo: བདག་ དང་སེམས་ ཅན་ དག་ ཏུ་ ལྷུང་བ་ མེད་ ། །

source: Such is this dhāraṇī that is endowed with nonduality.
bo: གཉིས་ མེད་ ལྡན་པ་ འདི་ ནི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘The four types of discriminating knowledge are attained,
bo: སོ་སོ་ ཡང་དག་ རིག་པ་ ཐོབ་ གྱུར་ ཅིང་ ། །

source: The four bases of miraculous powers are established,
bo: རྐང་པ་ སྙིང་པོ་ བཞི་ ལ་ རབ་གནས་ ཏེ་ ། །

source: And the four concentrations are embodied.
bo: བསམ་གཏན་ བཞི་ དང་ ཡང་དག་ རབ་ ལྡན་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Being the system of teachings of the ultimate meaning, And possessing the four abodes of Brahmā and the means of attraction,
bo: དམ་པ་ -འི་ དོན་ གྱི་ ཆོས་ ཀྱི་ ཚུལ་ གྱུར་ ཅིང་ ། ། ཚངས་པ་ -འི་ གནས་པ་ བཞི་ དང་ བསྡུ་ དང་ ལྡན་ ། །

source: One sets in motion the five kinds of superknowledge.
bo: མངོན་པར་ ཤེས་པ་ ལྔ་ ལ་ འགྲོ་བྱེད་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Being established in the applications of mindfulness And in harmony with the correct exertions,
bo: དྲན་པ་ ཉེ་བར་ གཞག་པ་ རྣམས་ ལ་ གནས་ ། ། ཡང་དག་ སྤོང་བ་ རྣམས་ དང་ རྟག་ ཏུ་ འཐུན་ ། །

source: One activates the four bases of miraculous powers.
bo: རྫུ་འཕྲུལ་ རྐང་པ་ བཞི་ ལ་ སྤྱོད་ བྱེད་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Endowed with the five spiritual faculties And established with five strengths,
bo: དབང་པོ་ ལྔ་པོ་ དག་ དང་ ལྡན་ གྱུར་ ཅིང་ ། ། སྟོབས་ ལྔ་ དག་ ལ་ གནས་པ་ མི་ གཡོ་ -འི་ ཤུགས་ ། །

source: One is endowed with the factors of awakening, an unwavering force.
bo: བྱང་ཆུབ་ ཡན་ལག་ རྣམས་ དང་ རབ་ ལྡན་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Motivated by the eightfold path, Supreme tranquil abiding and special insight are united, And one is motivated by awareness and liberation.
bo: ཡན་ལག་ བརྒྱད་པ་ -འི་ ལམ་ གྱིས་ འགྲོ་བྱེད་ ཅིང་ ། ། ཞི་གནས་ མཆོག་ དང་ ལྷག་མཐོང་ ཟུང་ དུ་ འབྲེལ་ ། ། རིག་ དང་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ འགྲོ་བྱེད་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘One being endowed with the spiritual levels to be mastered And in harmony with the unifying path of freedom, All faults are totally abandoned.
bo: ས་ རྣམས་ གནོན་པ་ དག་ ནི་ རབ་ ལྡན་ ཞིང་ ། ། མཚམས་ སྦྱོར་ གྲོལ་བ་ -འི་ ལམ་ དང་ རྗེས་སུ་ འཐུན་ ། ། ཉེས་པ་ རྣམས་ ནི་ ཀུན་ དུ་ སྤངས་ གྱུར་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘One sheds light on all worlds Like the luminous orbs of the sun and the moon, Which are pure and eye opening.
bo: འཇིག་རྟེན་ ཐམས་ཅད་ ན་ ནི་ སྣང་བྱེད་ ཅིང་ ། ། ཉི་ དང་ ཟླ་ ཡི་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ལྟར་ ། ། རྣམ་པ་ -ར་ དག་ ཅིང་ མིག་ ནི་ འབྱེད་ བྱེད་པ་ ། །

source: Such is the jewel lamp dhāraṇī.
bo: འདི་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ ཡིན་ ནོ་ ། །

source: “ ‘Here the pure divine eye is without visual distortion,
bo: འདི་ -ར་ ནི་ ལྷ་ མིག་ དག་ སྟེ་ རབ་རིབ་ མེད་ ། །

source: And the eyes of supreme insight are pure. Here, the eyes of Dharma are likewise pure,
bo: ཤེས་རབ་ མཆོག་ གི་ མིག་ ཀྱང་ རྣམ་དག་པ་ ། ། འདི་ -ར་ ནི་ ཆོས་ ཀྱི་ མིག་ ཀྱང་ དག་ གྱུར་ ཏེ་ ། །

source: And the authentic vision of the Victor is pure.
bo: རྒྱལ་བ་དམ་པ་ -འི་ སྤྱན་ ནི་ རྣམ་པ་ -ར་ དག་ །

source: “ ‘Here the māra of afflictive emotions is purified,
bo: འདི་ -ར་ ནི་ ཉོན་མོངས་ བདུད་ ཀྱང་ དག་པ་ -ར་ གྱུར་ ། །

source: And the māra of aggregates is purified.
bo: ཕུང་པོ་ ལྔ་ ཡི་ ཉེས་པ་ འདི་ -ར་ ཡོངས་ དག་ །

source: Here the māra of the Lord of Death is purified, And here the māra of sectarianism is also conquered.
bo: འདི་ -ར་ ནི་ འཆི་བདག་ བདུད་ ཀྱང་ དག་ གྱུར་ ཅིང་ ། ། འདི་ -ར་ ནི་ སྡེ་ དང་ བཅས་པ་ -འི་ བདུད་ ཀྱང་ བཅོམ་ ། །

source: “ ‘One who abides in this dhāraṇī May travel to many different realms,
bo: འདི་ -ར་ ནི་ གཟུངས་ ལ་ རབ་ཏུ་ གནས་ ནས་ སུ་ ། ། བྱེ་བ་ ཁྲག་ཁྲིག་ དག་ གི་ ཞིང་ དུ་ འགྲོ་ ། །

source: Behold vast numbers of buddhas, And listen to the highest Dharma.
bo: སངས་རྒྱས་ ཁྲག་ཁྲིག་ དག་ ཀྱང་ མཐོང་ འགྱུར་ ཞིང་ ། ། བླ་ ན་ མེད་པ་ -འི་ ཆོས་ ཀྱང་ ཉན་པ་ -ར་ བྱེད་ ། །

source: “ ‘Hearing extensive teachings, One retains them through the power of mindful dhāraṇī.
bo: རྒྱ་ ཆེན་ ཆོས་ ནི་ ཐོས་པ་ -ར་ གྱུར་ ནས་ ཀྱང་ ། ། གཟུངས་ ཀྱི་ དྲན་པ་ -འི་ སྟོབས་ ཀྱིས་ འཛིན་པ་ -ར་ བྱེད་ ། །

source: One even manages to retain the meanings and syllables And thereby teach all beings.
bo: དོན་ དང་ ཚིག་འབྲུ་ དག་ ཀྱང་ གཟུངས་ ལྡན་པ་ -ར་ ། ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ ནི་ སྟོན་པ་ -ར་ བྱེད་ ། །

source: “ ‘When classified by way of causes and conditions,
bo: རྒྱུ་ དང་ རྐྱེན་ གྱིས་ རྣམ་པ་ -ར་ ཕྱེ་བ་ -ས་ ན་ ། །

source: Mind is understood to disintegrate moment by moment.
bo: སེམས་ ནི་ སྐད་ཅིག་ འཇིག་པ་ -ར་ ཤེས་ གྱུར་ ཏེ་ ། །

source: Attaining knowledge of how phenomena are classified, One abides in this dhāraṇī.
bo: ཆོས་ རྣམས་ རབ་ཏུ་ དབྱེ་བ་ ཤེས་ ཐོབ་པ་ ། ། གཟུངས་ འདི་ ལ་ ནི་ གནས་པ་ -ར་ གྱུར་པ་ ཡིན་ ། །

source: “ ‘One attains eloquence and is unobstructed in threefold awareness.
bo: སྤོབས་པ་ ཐོབ་ ཅིང་ གསུམ་ རིག་ ཆགས་པ་ མེད་ ། །

source: One attains purification of the three eyes
bo: མིག་ གསུམ་ རྣམ་པ་ -ར་ དག་པ་ -འང་ རབ་ཏུ་ ཐོབ་ ། །

source: And the goal of the three liberations.
bo: རྣམ་པ་ -ར་ ཐར་པ་ གསུམ་ གྱི་ དོན་ ཀྱང་ ཐོབ་ ། །

source: Here, one is endowed with attainment of dhāraṇīs.
bo: འདི་ -ར་ ནི་ གཟུངས་ རྣམས་ ཐོབ་པ་ -ར་ གྱུར་ དང་ ལྡན་ ། །

source: “ ‘Although the exegesis of the many dhāraṇīs Is unfathomable and boundless, Having attained this excellent dhāraṇī, They are all mastered.
bo: གང་དག་ གཟུངས་ རྣམས་ མང་པོ་ གཞལ་ཡས་ ཤིང་ ། ། ཚད་ མེད་པ་ དག་ ངེས་པར་ བསྟན་པ་ ཡང་ ། ། གཟུངས་ ཀྱི་ དམ་པ་ འདི་ ནི་ ཐོབ་ གྱུར་ ན་ ། ། དེ་དག་ ཐམས་ཅད་ རབ་ཏུ་ ཐོབ་པ་ -ར་ འགྱུར་ ། །

source: “ ‘One enters the infinite concentrations and liberations, Equipoises and absorptions, The playful expressions of superknowledge, And the infinite dhāraṇīs.
bo: བསམ་གཏན་ གང་ དང་ རྣམ་ཐར་ གང་དག་ དང་ ། ། སྙོམས་འཇུག་ ཏིང་འཛིན་ གང་དག་ མཐའ་ ཡས་ དང་ ། ། མངོན་པར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ རོལ་ དང་ གཟུངས་ ། ། མཐའ་ ཡས་ དེ་དག་ ལ་ ནི་ རབ་ཏུ་ འཇུག་ །

source: “ ‘Just as rivers, lakes, and ponds Flow into the vast and endless ocean through limitless channels,
bo: ཇི་ལྟར་ རྒྱ་མཚོ་ དཔག་ ཏུ་ མེད་པ་ ལ་ ། ། མཐའ་ ཡས་ སྒོ་ ནས་ ཀླུང་ མཚོ་ མཚེའུ་ འཇུག་པ་ ། །

source: Those who uphold this dhāraṇī Pass through gateways of infinite teachings.
bo: དེ་ལྟར་ གཟུངས་ འདི་ འཛིན་པ་ -ར་ བྱེད་པ་ ཡང་ ། ། མཐའ་ ཡས་ ཆོས་ རྣམས་ ཀྱི་ ནི་ སྒོ་མོ་ -ར་ འཇུག་ །

source: “ ‘Engaging in countless languages, One masters them all through boundless understanding.
bo: ཟད་པ་ མེད་པ་ -འི་ སྒྲ་ ལ་ འཇུག་པ་ ཡང་ ། ། ཟད་པ་ མེད་པ་ -འི་ ཤེས་པ་ -ས་ ཁོང་ དུ་ ཆུད་ ། །

source: For those who proclaim this dhāraṇī, Merit will never be exhausted.
bo: གཟུངས་ འདི་ སྨྲ་བ་ -ར་ བྱེད་པ་ དེ་ ཡི་ ནི་ ། ། བསོད་ནམས་ ཐམས་ཅད་ ཟད་པར་ མི་ འགྱུར་ རོ་ ། །

source: “ ‘Those who attain this dhāraṇī Will hold a supreme, flawless jewel in their hands.
bo: གཟུངས་ འདི་ རབ་ཏུ་ ཐོབ་པ་ -ར་ གྱུར་པ་ ནི་ ། ། རིན་ཆེན་ དམ་པ་ དྲི་མེད་ ལག་ ཏུ་ འགྱུར་ ། །

source: Their bodies, names, families, Clans, and births will be pure.
bo: གཟུགས་ དང་ མཚན་ རྣམས་ དང་ ནི་ རིགས་ དང་ ཡང་ ། ། རུས་ དང་ སྐྱེ་བ་ དག་ ནི་ རྣམ་པ་ -ར་ དག་ །

source: “ ‘The engagement in profound methods, The acceptance of nonarising, And the levels of understanding the unoriginated and irreversible Are definitively taught to be this dhāraṇī.
bo: ཟབ་མོ་ -འི་ ཚུལ་ དག་ ལ་ ནི་ འཇུག་པ་ དང་ ། ། མི་ སྐྱེ་བ་ ལ་ བཟོད་ དང་ མ་ སྐྱེས་ དང་ ། ། ཕྱིར་ མི་ ལྡོག་པ་ -འི་ ཤེས་པ་ -འི་ ས་ དག་ ཀྱང་ ། ། གཟུངས་ འདི་ ཡིན་པ་ -ར་ ངེས་པར་ བསྟན་པ་ ཡིན་ ། །

source: “ ‘When all bodhisattvas who seek Unsurpassed supreme awakening Have attained this dhāraṇī, The highest awakening will not be hard to find.
bo: བྱང་ཆུབ་ བླ་མེད་ མཆོག་ འདི་ ཚོལ་ བྱེད་པ་ -འི་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ མང་པོ་ གང་དག་ གིས་ ། ། གཟུངས་ འདི་ རབ་ཏུ་ ཐོབ་པ་ -ར་ གྱུར་ ན་ ནི་ ། ། བྱང་ཆུབ་ བླ་ ན་ མེད་པ་ རྙེད་ མི་ དཀའ་ ། །

source: “ ‘Once the sugatas of the ten directions, Who teach Dharma to benefit and delight people, Have attained the excellence of this dhāraṇī,
bo: གང་དག་ ཕྱོགས་ བཅུ་ རྣམས་ ན་ བདེ་བ་ -ར་ གཤེགས་ ། ། འགྲོ་ ལ་ ཕན་ དང་ བདེ་ ཕྱིར་ ཆོས་སྟོན་པ་ ། ། གཟུངས་ ཀྱི་ དམ་པ་ འདི་ ནི་ ཐོབ་ གྱུར་ ན་ ། །

source: Their eloquence will be uninterrupted.
bo: དེ་དག་ སྤོབས་པ་ རྒྱུན་ ཆད་ མི་ འགྱུར་ རོ་ ། །

source: “ ‘When those who have attained this dhāraṇī Understand the joys, aspirations, and thoughts of beings, They will teach them the fruition that is ever-present,
bo: གཟུངས་ འདི་ རབ་ཏུ་ ཐོབ་པ་ -ར་ གྱུར་པ་ དག་ ། དགའ་ དང་ མོས་ དང་ བསམ་པ་ ཤེས་ ནས་ ནི་ ། ། དེ་དག་ འབྲས་བུ་ ཡོད་པ་ སྟོན་པ་ -ས་ ན་ ། །
