Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Son of noble family, there are ten types of bodhisattva ornaments of retention: knowing how to teach without doubt to skeptics, letting the mind be a gate for the arising of Dharma, letting the lamp of insight shine completely for others, inexhaustibly teaching words, uninterruptedly teaching meanings, perfectly expressing boundless praise of the Buddha, describing the endless flaws of moral pollution, teaching the immeasurable praise of moral purification, engaging assiduously and without attachment in accordance with all beings’ faculties, and understanding the application of the discriminating knowledge bestowed on the level of buddhahood.”
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ བཅུ་པོ་ འདི་དག་ སྟེ་ ། བཅུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དོགས་པ་ ཐམས་ཅད་ ལ་ ཐེ་ཚོམ་ མེད་པ་ -ར་ སྟོན་པ་ ཤེས་པ་ དང་ ། བློ་ -ས་ ཆོས་ སྐྱེ་བ་ -འི་ སྒོ་ དང་ ། ཤེས་རབ་ ཀྱི་ སྣང་བ་ གཞན་ ལ་ ལྷག་མ་ མ་ལུས་པ་ དང་ ། ཡི་གེ་ བསྟན་པ་ མི་ཟད་པ་ དང་ ། དོན་ བསྟན་པ་ རྒྱུན་ ཆད་པ་ མེད་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ བསྔགས་པ་ མཐའ་ཡས་པ་ ཡང་དག་པ་ -ར་ རབ་ཏུ་ བརྗོད་པ་ དང་ ། ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ སྐྱོན་ མུ་མེད་ བར་ བརྗོད་པ་ དང་ ། རྣམ་པ་ -ར་ བྱང་བ་ -འི་ བསྔགས་པ་ ཚད་ མེད་པ་ སྟོན་པ་ དང་ ། དབང་པོ་ ཐམས་ཅད་ ལ་ གཞོལ་བ་ -ར་ འཇུག་པ་ ཆགས་པ་ མེད་པ་ དང་ ། སངས་རྒྱས་ ཀྱིས་ གནང་བ་ -འི་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ལ་ འཇུག་པ་ ཤེས་པ་ སྟེ་ །

source: Then, in order to elaborate on these points, the Blessed One spoke the following verses:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དོན་ དེ་ཉིད་ རྒྱ་ ཆེ་ -ར་ བསྟན་པ་ -འི་ ཕྱིར་ ཚིགས་ སུ་ བཅད་བ་ འདི་དག་ གསུངས་ སོ་ ། །

source: “What adorn the supreme and noble path
bo: གང་ གིས་ ཐེག་མཆོག་ དམ་པ་ འདི་ མཛེས་པ་ ། །

source: Are the four ornaments of those of great intelligence:
bo: བློ་གྲོས་ ཆེན་པོ་ རྣམས་ ཀྱི་ རྒྱན་ བཞི་ སྟེ་ །

source: Morality, absorption, supreme insight,
bo: ཚུལ་ཁྲིམས་ ཏིང་འཛིན་ དེ་བཞིན་ ཤེས་རབ་ མཆོག་ །

source: And retention of the definitive meaning.
bo: ཤིན་ཏུ་ རྣམ་ ངེས་དོན་ དང་ དེ་བཞིན་ གཟུངས་ ། །

source: “Being pleasant and delightful toward all creatures
bo: དེ་ ནི་ ལུས་ཅན་ ཀུན་ གྱི་ ཡིད་ འོད་ དགའ་ ། །

source: And pure in body, speech, and mind,
bo: ལུས་ དང་ ངག་ རྣམས་ དང་ ནི་ ཡིད་ དག་ ཅིང་ །

source: Thus eliminating all downfalls—
bo: དེ་ ཡི་ རྣམ་པ་ -ར་ ལྷུང་བ་ ཀུན་ ཆད་པ་ ། །

source: These are the ornaments of morality.
bo: འདི་ ནི་ ཚུལ་ཁྲིམས་ ལྡན་པ་ -འི་ རྒྱན་ ཡིན་ ནོ་ ། །

source: “Being born as a learned being among gods or humans,
bo: ལྷ་ མི་ རྣམས་ ཀྱི་ ནང་ དུ་ མཁས་པ་ སྐྱེ་ ། །

source: Accomplishing what one wishes according to one’s aspiration,
bo: དེ་ ཡི་ སྨོན་ལམ་ ཇི་ལྟར་ འདོད་ བཞིན་ འགྲུབ་ ། །

source: And being endowed with persistence and sincerity—
bo: ནན་ཏན་ སྙིང་པོ་ -ར་ བྱེད་ དང་ ཡང་དག་ ལྡན་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ཡིན་ ནོ་ ། །

source: “Absorption that is not illusory,
bo: དེ་ ཡི་ ཏིང་འཛིན་ སྒྱུ་མ་ མ་ ཡིན་ ཏེ་ ། །

source: Insight, liberation, and the vision of liberating wisdom,
bo: ཤེས་རབ་ རྣམ་གྲོལ་ དེ་བཞིན་ ཡེ་ཤེས་ མཐོང་ །

source: And nirvāṇa that is not illusory—
bo: དེ་ ཡི་ མྱ་ངན་ ལས་ འདས་པ་ སྒྱུ་མ་ མིན་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ ཚུལ་ཁྲིམས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Flawless and pure morality,
bo: ཚུལ་ཁྲིམས་ སྐྱོན་མེད་ ཚུལ་ཁྲིམས་ རྣམ་པ་ -ར་ དག་ །

source: Morality that is not sinful or adulterated,
bo: ཚུལ་ཁྲིམས་ སྲ་སྲེ་ མ་ ཡིན་ འདྲེན་མ་ མེད་ ། །

source: And that which is voluntary and autonomous—
bo: དེ་ ཡི་ རང་ དགའ་ དེ་བཞིན་ རང་དབང་ ཡིན་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Generosity and patience,
bo: ཚུལ་ཁྲིམས་ ཀྱིས་ ནི་ སྦྱིན་པ་ དག་པ་ -ར་ འགྱུར་ ། །

source: Vigor, concentration, and insight,
bo: བཟོད་པ་ དག་ ཅིང་ དེ་བཞིན་ བརྩོན་འགྲུས་ དག་ །

source: Methods and vigilance—
bo: བསམ་གཏན་ དག་ ཅིང་ དེ་བཞིན་ ཤེས་རབ་ དག་ །

source: All are purified by morality.
bo: ཐབས་ དང་ དེ་བཞིན་ བག་ ཡོད་ དག་པ་ ཡིན་ ། །

source: “Remaining completely unwavering and still,
bo: གཡོ་བ་ མེད་ ཅིང་ བརྟན་ ལ་ ཤིན་ཏུ་ གནས་ ། །

source: Attaining the supreme levels and remaining focused in spiritual practice,
bo: ས་མཆོག་ ཐོབ་ ཅིང་ རྣལ་འབྱོར་ རྣམ་ འཕྲོ་ མེད་ ། །

source: Abandoning laxity, and being at ease—
bo: ལྷོད་པ་ སྤངས་ ཤིང་ དགང་ སླ་ གསོ་ ཡང་ སླ་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Igniting vigor and praising morality,
bo: བརྩོན་འགྲུས་ འབར་ ཞིང་ ཚུལ་ཁྲིམས་ བསྔགས་པ་ སྟེ་ ། །

source: Being without mental anguish at all times,
bo: དེ་ ཡི་ སེམས་ ནི་ ནམ་ཡང་ གདུང་ མི་ འགྱུར་ ། །

source: And being free of attachment—
bo: དེ་ ལ་ ཡིད་ ལ་ གཅགས་པ་ -ར་ འགྱུར་མེད་ དེ་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Being determined, tranquil, and serene,
bo: འཇིགས་པ་ མེད་ ཅིང་ མི་ སྐྲག་ མི་ ཞུམ་ སྟེ་ ། །

source: Without fear and neither anxious nor fainthearted,
bo: བསམ་པ་ དེ་ -ས་ ཤིང་ ཞི་ ལ་ ཡིད་ རབ་ ཞི་ ། །

source: And to thus be released from bondage to these—
bo: འདི་ -ར་ ནི་ དེ་ ཡི་ བཅིངས་པ་ ལྷོད་པ་ -ར་ གྱུར་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Having a most praiseworthy mind that is flexible,
bo: གྲགས་ཆེན་ སེམས་ ནི་ལས་ སུ་ རུང་བ་ ཡིན་ ། །

source: Being disciplined and well bred,
bo: དེ་ ནི་ དུལ་ ཞིང་ དེ་བཞིན་ ཅང་ཤེས་ ཡིད་ ། །

source: And thus having one’s own body adorned by the marks—
bo: འདི་ -ར་ ནི་ རང་ ལུས་ མཚན་ གྱིས་ བརྒྱན་ བྱེད་པ་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Through conduct that is true to their word,
bo: དེ་ ནི་ ཇི་སྐད་ སྨྲས་པ་ དེ་བཞིན་ བྱེད་ ། །

source: The skilled attain the ornament of speech.
bo: མཁས་པ་ དེ་ ནི་ ངག་ གི་ རྒྱན་ ཐོབ་ སྟེ་ ། །

source: And are adorned by a steady mind free of afflictive emotion—
bo: དེ་ ནི་ ཉོན་མོངས་ མེད་པ་ -ས་ རྟག་ སེམས་ བརྒྱན་ ། །

source: These are the ornaments of pure morality.
bo: འདི་ ནི་ གང་དག་ ཚུལ་ཁྲིམས་ དག་པ་ -འི་ རྒྱན་ ། །

source: “Excellently adorning the superb buddhafields,
bo: ཁྱད་པར་ འཕགས་པ་ -འི་ ཞིང་ ནི་ ལེགས་པ་ -ར་ བརྒྱན་ ། །

source: Bringing sentient beings to maturity in the supreme vehicle,
bo: ཐེག་པ་ མཆོག་ ལ་ སེམས་ཅན་ ཡོངས་ སྨིན་ བྱེད་ ། །

source: And refraining from all sinful deeds—
bo: གང་ ཕྱིར་ སྡིག་པ་ ཐམས་ཅད་ མི་ བྱེད་པ་ -ས་ ། །

source: These will cause one’s births to be well adorned.
bo: རང་ གི་ སྐྱེ་བ་ ལེགས་པ་ -ར་ བརྒྱན་པ་ -ར་ བྱེད་ ། །

source: “Being constantly adorned by awakened conduct,
bo: བྱང་ཆུབ་ སྤྱོད་པ་ རྟག་ ཏུ་ བརྒྱན་ བྱེད་ ཅིང་ ། །

source: Being adorned by the noble seat of awakening,
bo: བྱང་ཆུབ་ སྙིང་པོ་ དམ་པ་ བརྒྱན་པ་ -ར་ བྱེད་ ། །

source: And being adorned by the strengths and the fearlessnesses
bo: སྟོབས་ དང་ མི་ འཇིགས་པ་ དག་ བརྒྱན་ བྱེད་ ཅིང་ ། །

source: Is to be well adorned by understanding due to lack of pride.
bo: ང་རྒྱལ་ མེད་པ་ -ས་ ཤེས་པ་ ལེགས་པ་ -ར་ བརྒྱན་ ། །

source: “To embrace all sentient beings with love,
bo: དེ་ ནི་ བྱམས་པ་ -ས་ སེམས་ཅན་ ཀུན་ཁྱབ་ བྱེད་ ། །

source: The skilled are ever honest and flexible.
bo: མཁས་པ་ རྟག་ ཏུ་ དྲང་ དང་ མཉེན་པ་ ཡིན་ ། །

source: Being free of deception, cunning, and hypocrisy
bo: གཡོ་ ནི་ མེད་ ཅིང་ སྒྱུ་ མེད་ བཅོས་པ་ མེད་ ། །

source: Is not to be driven by delusion, desire, hatred, and fear.
bo: གཏི་མུག་ འདོད་ སྡང་ འཇིགས་པ་ -ས་ འགྲོ་ མ་ ཡིན་ ། །

source: “Removing the five obstructions,
bo: དེ་ ནི་ སྒྲིབ་པ་ ལྔ་པོ་ རྣམ་པ་ -ར་ སེལ་ ། །

source: Vigilantly cultivating the six recollections,
bo: བག་ ཡོད་ གྱུར་ ནས་ རྗེས་སུ་ དྲན་ དྲུག་ བསྒོམ་ ། །

source: And cultivating the seven factors of awakening and the eightfold path
bo: བྱང་ཆུབ་ ཡན་ལག་ བདུན་ དང་ ལམ་ སྒོམ་ སྟེ་ ། །

source: Yields the concentrations of meditative absorption and, finally, the ninth.
bo: མཐར་གྱིས་ དགུ་ དང་ ཏིང་འཛིན་ བསམ་གཏན་ བྱེད་ ། །

source: “For the practitioner to focus and abide in tranquility,
bo: རྣལ་འབྱོར་པ་ ནི་ ཞི་གནས་ ངེས་ སེམས་ སྦྱོར་ ། །

source: To avoid letting correct behavior and virtue go to waste,
bo: དེ་ ནི་ ཚུལ་བཞིན་ དགེ་བ་ ཆུད་ མི་ གསོན་ ། །

source: And to be detached, pliant, and discerning
bo: དབེན་ དང་ ཤིན་ཏུ་ སྦྱངས་ དང་ སོ་སོ་ -ར་ རྟོག་ །

source: Is to uphold the noble lineage.
bo: འཕགས་པ་ -འི་ རིགས་ ལ་ དབང་ ནི་ སྒྱུར་བ་ ཡིན་ ། །

source: “Being without doubt regarding phenomena,
bo: ཆོས་ རྣམས་ ལ་ ནི་ ཐེ་ཚོམ་ མེད་པ་ -ར་ གྱུར་ ། །

source: Having neither regret nor agitation,
bo: དེ་ ལ་ ཀུན་ ནས་ ལྡང་ དང་ འགྱོད་པ་ མེད་ ། །

source: And being without ignorance, delusion, and confusion,
bo: དེ་ ལ་མ་ རིག་ གཏི་མུག་ མུན་པ་ མེད་ ། །

source: One knows the deep understanding of the illumination of truth.
bo: བདེན་པ་ སྣང་བ་ ཡོངས་སུ་ ཤེས་པ་ ཤེས་ ། །

source: “Being without objectification purifies morality,
bo: ཚུལ་ཁྲིམས་ དག་པ་ དམིགས་པ་ མེད་པ་ སྟེ་ ། །

source: True insight purifies concentration and absorption,
bo: ཤེས་རབ་ དམ་པ་ བསམ་གཏན་ ཏིང་འཛིན་ དག་ །

source: Eliminating dualism purifies liberation,
bo: གཉིས་ བསལ་ ནས་ ནི་ རྣམ་པ་ -ར་ གྲོལ་བ་ དག་ །

source: And being without excessive pride purifies understanding.
bo: ལྷག་པ་ -འི་ ང་རྒྱལ་ མེད་ ཅིང་ ཤེས་པ་ དག་ །

source: “Purifying the three times, one is not attached to the vision of wisdom.
bo: དུས་གསུམ་ དག་ ལ་ ཡེ་ཤེས་ མཐོང་ མི་ ཆགས་ ། །

source: Phenomena are purified by understanding free of desire.
bo: འདོད་ཆགས་ བྲལ་བ་ -འི་ ཤེས་པ་ -ས་ ཆོས་ ཀྱང་ དག་ །

source: Having been purified, one has no arrogance about it.
bo: དག་ ནས་ འདི་ -ར་ ནི་ དེ་ ལ་ རློམ་སེམས་ མེད་ ། །

source: These are the ornaments of those possessing insight.
bo: འདི་ ནི་ གང་དག་ ཤེས་རབ་ ལྡན་པ་ -འི་ རྒྱན་ ། །

source: “Insight that adorns generosity
bo: ཤེས་རབ་ ཀྱིས་ ནི་ སྦྱིན་པ་ བརྒྱན་ གྱུར་ ཏེ་ ། །

source: Purifies three aspects: Agent, awakening, and sentient beings, Since they are known to be illusory, unfindable, and dreamlike.
bo: རྨི་ལམ་ སྒྱུ་མ་ ཚོལ་བ་ མེད་པ་ -འི་ ཕྱིར་ ། ། བདག་ དང་ བྱང་ཆུབ་ དེ་བཞིན་ སེམས་ཅན་ རྣམས་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་དག་ རྣམ་པ་ -ར་ སྦྱོང་ ། །

source: “Insight that adorns morality
bo: ཤེས་རབ་ ཀྱིས་ ནི་ ཚུལ་ཁྲིམས་ བརྒྱན་ གྱུར་ ཏེ་ ། །

source: Purifies three aspects: Body, speech, and mind, Since they are known to be like a reflection, an echo, and an illusion.
bo: གཟུགས་བརྙན་ སྒྱུ་མ་ བྲག་ཅ་ འདྲ་བ་ -འི་ ཕྱིར་ ། ། ལུས་ དང་ ངག་ རྣམས་ དང་ ནི་ དེ་བཞིན་ སེམས་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་ ། །

source: “Insight that adorns patience
bo: ཤེས་རབ་ ཀྱིས་ ནི་ བཟོད་པ་ བརྒྱན་ གྱུར་ ཏེ་ ། །

source: Purifies three aspects: The learned are neither elated nor dejected, And they maintain the steady realization of true dharmakāya.
bo: མཁས་ དང་ མཐོ་ མིན་ དམའ་བ་ -ར་ འགྱུར་ མིན་ དང་ ། ། དམ་པ་ -འི་ ཆོས་སྐུ་ རྟག་ ཏུ་ རབ་ རྟོག་པ་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་ ། །

source: “Insight that adorns vigor
bo: ཤེས་རབ་ ཀྱིས་ ནི་ བརྩོན་འགྲུས་ བརྒྱན་ གྱུར་ ཏེ་ ། །

source: Purifies three aspects: Not being disheartened, keeping a stable intention, And neither accepting nor rejecting.
bo: སྐྱོ་བ་ མེད་ ཅིང་ བསམ་པ་ བརྟན་པ་ དང་ ། ། དེ་ ནི་ བླང་བ་ མེད་ ཅིང་ དོར་ མེད་པ་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་ ། །

source: “Insight that adorns concentration
bo: ཤེས་རབ་ ཀྱིས་ ནི་ བསམ་གཏན་ བརྒྱན་ གྱུར་ ཏེ་ ། །

source: Purifies three aspects: Nonattachment, special insight, And gaining mastery and superknowledge.
bo: དེ་ ལ་མ་ ཆགས་ གྱུར་ དང་ ལྷག་མཐོང་ དང་ ། ། མཁས་ དང་ མངོན་པར་ ཤེས་པ་ སྐྱེད་པ་ དང་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་ ། །

source: “Insight that adorns method
bo: ཤེས་རབ་ ཀྱིས་ ནི་ ཐབས་ ཀྱང་ བརྒྱན་ བྱེད་ དེ་ ། །

source: Purifies three aspects: The means of attraction, retention, and aspirations Related to beings, the Dharma, and the buddhafields.
bo: ཤིན་ཏུ་ སྡུད་ དང་ གཟུངས་ དང་ ཡང་དག་ སྨོན་ ། ། འཁོར་གསུམ་པོ་ དག་ དེ་ ནི་ རྣམ་ སྦྱོང་ ཞིང་ ། ། སེམས་ཅན་ ཆོས་ དང་ དེ་བཞིན་ ཞིང་ རྣམས་ སྦྱོང་ ། །

source: “One does not engage mindfully in the applications of mindfulness,
bo: དྲན་པ་ ཉེ་བར་ གཞག་ ལ་ དྲན་ མི་ འཇུག་ །

source: One is free from duality regarding the correct exertions,
bo: ཡང་དག་ སྤོང་བ་ རྣམས་ ལ་ གཉིས་ མེད་ དེ་ ། །

source: One is physically and mentally detached through the miraculous powers,
bo: རྫུ་འཕྲུལ་ གྱིས་ ནི་ ལུས་ དང་སེམས་ ཀྱང་ དབེན་ ། །

source: And one has all the spiritual faculties that are not known to sentient beings.
bo: སེམས་ཅན་ གྱིས་ ནི་ དབང་པོ་ ཀུན་ མི་ ཤེས་ ། །

source: “One is not overpowered by the māras or afflictive emotions,
bo: བདུད་ དང་ ཉོན་མོངས་ རྣམས་ ཀྱིས་ ཟིལ་ མི་ ནོན་ ། །

source: Correctly realizes the nature of phenomena,
bo: ཆོས་ ཀྱི་ རང་བཞིན་ ཚུལ་བཞིན་ རྗེས་སུ་ རྟོགས་ ། །

source: And is without coming and going with regard to the paths—
bo: དེ་བཞིན་ ལམ་ ལ་ འོང་ མེད་ འགྲོ་བ་ མེད་ ། །

source: These are the ornaments of those endowed with insight.
bo: འདི་ ནི་ གང་དག་ ཤེས་རབ་ ལྡན་པ་ -འི་ རྒྱན་ ། །

source: “One understands tranquil abiding through serenity,
bo: དེ་ ནི་ ཤིན་ཏུ་ ཞི་བ་ -ས་ ཞི་གནས་ ཤེས་ ། །

source: And the special insight based on this is boundless in scope.
bo: དེ་ ཡི་ ལྷག་མཐོང་ སྤྱོད་ཡུལ་ མཐའ་ ཡས་ ཏེ་ ། །

source: One understands the aggregates just as one does the collections of Dharma
bo: ཆོས་ ཀྱི་ ཕུང་པོ་ ཅི་ བཞིན་ ཕུང་པོ་ ཤེས་ ། །

source: And that the elements are similar to space.
bo: ཁམས་ ནི་ ནམ་མཁའ་ མཚུངས་ ཤིང་ འདྲ་བ་ -ར་ ཤེས་ ། །

source: “One understands the sense fields to be like a void
bo: དེ་ -ས་ ནི་ སྟོང་པ་ ལྟ་བུ་ -ར་ སྐྱེ་མཆེད་ ཤེས་ ། །

source: And that phenomena are unoriginated because they come together dependently.
bo: རྟེན་པ་ -ས་ བསགས་པ་ -ས་ ཆོས་ རྣམས་ འབྱུང་ མེད་ དེ་ ། །

source: One understands the ultimate truth without turmoil,
bo: དོན་དམ་ བདེན་པ་ -ར་ འཁྲུགས་པ་ མེད་པ་ -ར་ ཤེས་ ། །

source: And one properly understands definitive realization.
bo: ཚུལ་བཞིན་ གྱིས་ ནི་ ངེས་པར་ རྟོགས་པ་ -ར་ ཤེས་ ། །

source: “Engaging in wisdom unattached to the three times,
bo: དུས་གསུམ་ ལ་ ནི་ ཆགས་ མེད་ ཡེ་ཤེས་ འཇུག་ །

source: One understands the three collections in terms of their classification
bo: རྣམ་པ་ -ར་ གཞག་ ཕྱིར་ ཕུང་པོ་ གསུམ་ ཡང་ ཤེས་ ། །

source: And the single characteristic of the Three Jewels.
bo: དཀོན་མཆོག་ གསུམ་ ནི་ མཚན་ཉིད་ གཅིག་ ཏུ་ ཤེས་ ། །

source: These are the ornaments of those endowed with insight.
bo: འདི་ ནི་ གང་དག་ ཤེས་རབ་ ལྡན་པ་ -འི་ རྒྱན་ ། །

source: “One understands that the characteristics of fabrications are like an illusion,
bo: རྣམ་ བསྒྲུབས་ མཚན་ཉིད་ སྒྱུ་མ་ ལྟ་བུ་ -ར་ ཤེས་ ། །

source: That the root of false imaginings is just like a dream,
bo: ཡོངས་ བརྟགས་ རྩ་བ་ རྨི་ལམ་ ཇི་བཞིན་ ནོ་ ། །

source: That the characteristics of projections are like a mirage,
bo: རྣམ་འཕྲུལ་ མཚན་ཉིད་ སྨིག་རྒྱུ་ འདྲ་བ་ སྟེ་ ། །

source: And that motionless phenomena have the characteristics of a reflection.
bo: འཕོ་ མེད་ ཆོས་ རྣམས་ གཟུགས་བརྙན་ མཚན་ཉིད་ དོ་ ། །

source: “Composite things are like a hallucination.
bo: འདུ་འཕྲོད་ བྱུང་བ་ མིག་ཡོར་ ལྟ་བུ་ སྟེ་ ། །

source: Dependent on conditions, they are just like an echo.
bo: རྐྱེན་ རྣམས་ ཀྱིས་ ནི་ བྲག་ཅ་ ཇི་བཞིན་ ནོ་ ། །

source: One understands the realm of phenomena to be always uncorrupted—
bo: ཆོས་ ཀྱི་ དབྱིངས་ ནི་ རྟག་ ཏུ་ མ་ འདྲེས་ ཤེས་ ། །

source: It is suchness, which is groundless.
bo: དེ་བཞིན་ཉིད་ ནི་ གནས་ མེད་ དེ་ རབ་ ཤེས་ ། །

source: “The limit of reality, the ever-motionless reality,
bo: ཡང་དག་ མཐའ་ ནི་ རྟག་ ཏུ་ མི་ གཡོ་ ཆོས་ ། །

source: Is without the duality of the conditioned and unconditioned.
bo: འདུས་མ་བྱས་ དང་ འདུས་བྱས་ གཉིས་ སུ་ མེད་ ། །

source: Adorned with such deep and vast understanding,
bo: ཤེས་རབ་ ཟབ་ ཅིང་ བློ་ ནི་ རབ་ ཡངས་པ་ -ར་ ། །

source: One seeks out the qualities of a buddha.
bo: བརྒྱན་ ནས་ སངས་རྒྱས་ ཆོས་ རྣམས་ ཚོལ་ བར་ བྱེད་ ། །

source: “Having memory that never forgets,
bo: དེ་ ནི་ ནམ་ཡང་ དྲན་པ་ བརྗེད་པ་ མེད་ ། །

source: One strives to retain and fully retains the teachings.
bo: ཆོས་ རྣམས་ ཀུན་ ཏུ་ འཛིན་ ཅིང་ འཛིན་པ་ -ར་ བྱེད་ ། །

source: Ever learned in meanings and phonemes,
bo: དོན་ དང་ ཚིག་འབྲུ་ ལ་ ནི་ རྟག་ ཏུ་ མཁས་ ། །

source: One knows etymologies and always gains comprehension.
bo: ངེས་ཚིག་ ཤེས་པ་ རྟག་པ་ -ར་ རྟོགས་ ཁོང་ཆུད་ ། །

source: “One speaks words that are dispassionate and refined,
bo: ཆགས་ མེད་ ཚིག་ དང་ རྩུབ་པ་ མ་ ཡིན་ དང་ ། །

source: Liberating and without falsehood.
bo: རབ་ཏུ་ གྲོལ་བ་ -འི་ ཚིག་ དང་ བརྫུན་ མེད་ ཚིག་ །

source: Always realizing the meaning of what has been studied,
bo: ཐོས་པ་ ཀུན་ དོན་ རྟག་ ཏུ་ རྟོག་པ་ དང་ ། །

source: The learned rely on wisdom.
bo: མཁས་པ་ དེ་ ནི་ ཡེ་ཤེས་ རྟོན་པ་ -ར་ བྱེད་ ། །

source: “Being well acquainted with and understanding sūtras of definitive meaning,
bo: ངེས་དོན་ མདོ་སྡེ་ རྟོགས་པ་ -ར་ རབ་ཏུ་ ཤེས་ ། །

source: Relying on the true nature that is devoid of any person,
bo: གང་ཟག་ མེད་པ་ -འི་ ཆོས་ཉིད་ རྟོན་ བྱེད་ ཅིང་ ། །

source: And relying also on the true nature that is supramundane,
bo: འཇིག་རྟེན་ འདས་པ་ -འི་ ཆོས་ཉིད་ ལ་ ཡང་ རྟོན་ ། །

source: One is adorned with retention.
bo: དེ་ ནི་ གཟུངས་ ཀྱིས་ བརྒྱན་པ་ -ར་ གྱུར་པ་ ཡིན་ ། །

source: “One’s words correspond with the truth—
bo: དེ་ ཡི་ ཚིག་ ནི་ བདེན་པ་ -འི་ རྗེས་སུ་ འཐུན་ ། །

source: They are suitable to keep in mind and suitable to the occasion.
bo: གཟུང་བ་ -ར་ འོས་ དང་ དུས་ སུ་ འོས་པ་ ཡིན་ ། །

source: One’s teaching of the Dharma bears fruit,
bo: དེ་ ཡི་ ཆོས་ བསྟན་ དེ་ ནི་ འབྲས་བུ་ ཡོད་ ། །

source: Is appropriate, and is always delivered in a timely manner.
bo: ཕྱེད་པ་ དང་ ནི་ དུས་ སུ་ རྒྱུན་ཆགས་ འཇུག་ །

source: “One’s eloquence is swift,
bo: དེ་ ཡི་ སྤོབས་པ་ མགྱོགས་པ་ སྐྱེ་བ་ སྟེ་ ། །

source: Forceful, quick, and always dispassionate.
bo: ཤུགས་ཅན་ དང་ ནི་ མྱུར་ དང་ རྟག་ མི་ ཆགས་ ། །

source: It is uninterrupted, undistorted, and replete with etymologies.
bo: རྒྱུན་ ཆད་ མེད་ དང་ འཁྲུལ་ མེད་ ངེས་པ་ -འི་ ཚིག་ །

source: It is ornamented like a nicely threaded rosary.
bo: ལེགས་པ་ -ར་ བརྒྱུས་པ་ -འི་ ཕྲེང་བ་ -ས་ ལེགས་ བརྒྱན་ བཞིན་ ། །

source: “One knows the languages of all beings: Devas and nāgas, Yakṣas, gandharvas, asuras, Garuḍas, kiṃnaras, and mahoragas.
bo: ལྷ་ དང་ ཀླུ་ ཡི་ སྐད་ ནི་ རབ་ཏུ་ ཤེས་ ། ། གནོད་སྦྱིན་ དག་ དང་ དྲི་ཟ་ ལྷ་མིན་ དང་ ། ། མཁའ་ལྡིང་ མི་ འམ་ ཅི་ དང་ ལྟོ་འཕྱེ་ ཆེ་ ། ། སེམས་ཅན་ ཀུན་ གྱི་ སྐད་ ཀྱང་ རབ་ཏུ་ ཤེས་ ། །

source: “Knowing how to join a gathering without being intimidated
bo: འཁོར་ ལྷགས་ ཤེས་ ནས་ སྤ་ གོང་ མེད་པ་ སྟེ་ ། །

source: And not being dejected when watching orators,
bo: སྨྲ་བ་ མཐོང་ ནས་ ཞུམ་པ་ -ར་ གྱུར་པ་ -འང་ མེད་ ། །

source: One gives Dharma lectures fearlessly,
bo: འཇིགས་པ་ མེད་པ་ -ར་ ཆོས་ ཀྱི་ གཏམ་ ཡང་ རྗོད་ ། །

source: Exercising discretion toward questioners.
bo: འདྲི་བ་ རྣམས་ ལ་ ངེས་འབྱུང་ རབ་ཏུ་ ཤེས་ ། །

source: “One gives a loosely organized lecture when noticing the arrogant
bo: ལྷག་པ་ -འི་ ང་རྒྱལ་ཅན་ མཐོང་ སྣྲེལ་ ཞི་ ཡི་ ། །

source: And a well-organized lecture when noticing practitioners.
bo: གཏམ་ བརྗོད་ རྣལ་འབྱོར་ མཐོང་ ནས་ རྗེས་སུ་ འཐུན་ ། །

source: One manifests as Vajrapāṇi to the proud
bo: ང་རྒྱལ་ཅན་ ལ་ ལག་ ན་ རྡོ་རྗེ་ སྟོན་ ། །

source: And the end of the eon to those who cling to objects.
bo: ཡུལ་ མངོན་ ཆགས་ ལ་ སྲེག་པ་ -འི་ བསྐལ་པ་ སྟེ་ ། །

source: “Giving lectures about the progression of the three vehicles,
bo: ཐེག་པ་ གསུམ་ གྱི་ རིམ་པ་ -འི་ གཏམ་ ཡང་ རྗོད་ ། །

source: Eliminating the doubts of all the skeptics,
bo: དོགས་པ་ ཀུན་ གྱི་ ཐེ་ཚོམ་ གཅོད་པ་ སྟེ་ ། །

source: And revealing the Dharma teachings with one’s mind,
bo: བློ་ ཡི་ ཆོས་ རྣམས་ མངོན་སུམ་ འགྱུར་བ་ ཡིན་ ། །

source: One never allows one’s understanding to depend on others.
bo: དེ་ ཡི་ ཤེས་རབ་ ནམ་ཡང་ གཞན་ མི་ ལྟོས་ ། །

source: “One never runs out of words,
bo: ཡི་གེ་ ཐམས་ཅད་ རྟག་ ཏུ་ ཟད་ མི་ ཤེས་ ། །

source: And one keeps the subject matter decisive and consistent.
bo: དོན་ རྣམས་ ངེས་པ་ དག་ ལ་ རྒྱུན་ཆགས་ ཏེ་ ། །

source: In describing limitless buddha qualities,
bo: འདི་ ནི་ སངས་རྒྱས་ ཆོས་ རྣམས་ མཐའ་ ཡས་ བརྗོད་ ། །

source: One is adorned by retention.
bo: དེ་ ནི་ གཟུངས་ ཀྱིས་ བརྒྱན་པ་ -ར་ གྱུར་པ་ ཡིན་ ། །

source: “One knows the limitless flaws of pollution
bo: ཀུན་ ནས་ ཉོན་མོངས་ སྐྱོན་ ནི་ མཐའ་ ཡས་ ཤེས་ ། །

source: And the infinite benefits of purification.
bo: རྣམ་པ་ -ར་ བྱང་བ་ -འི་ ཕན་ཡོན་ ཐུག་པ་ མེད་ ། །

source: One knows all the capacities of beings
bo: དེ་བཞིན་ སེམས་ཅན་ དབང་པོ་ ཐམས་ཅད་ ཤེས་ ། །

source: And attains the discriminating knowledge granted by the Buddha.
bo: སངས་རྒྱས་ གནང་བ་ -འི་ སོ་སོ་ རིག་པ་ ཐོབ་ ། །

source: “This is to be adorned by retention.
bo: དེ་ ནི་ གཟུངས་ ཀྱིས་ བརྒྱན་པ་ -ར་ གྱུར་པ་ སྟེ་ ། །

source: Even if one were to express these and other qualities
bo: དེ་ ཡི་ ཡོན་ཏན་ འདི་ དང་ གཞན་དག་ ཀྱང་ ། །

source: For eons without interruption,
bo: བསྐལ་པ་ -ར་ རྒྱུན་ ཆད་ མེད་པ་ -ར་ རབ་ བརྗོད་ ཀྱང་ ། །

source: One would be unable to reach their limit.”
bo: ཡོན་ཏན་ མཐའ་ ནི་ རྟོགས་པ་ -ར་ མི་ ནུས་ སོ་ །། །།

source: Then the Blessed One spoke the following words to the bodhisattva Dhāraṇīśvara­rāja:
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ བཀའ་ སྩལ་པ་ །

source: “Son of noble family, there are eight bodhisattva illuminations that brighten bodhisattvas so that they are free from the thick darkness of confusion and engage in pure bodhisattva activities.
bo: རིགས་ ཀྱི་ བུ་ སྣང་བ་ གང་དག་ གིས་ སྣང་བ་ -ར་ གྱུར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ མུན་པ་ མུན་ནག་ དང་ བྲལ་ ཞིང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ཡོངས་སུ་ དག་པ་ སྤྱོད་པ་ -ར་ འགྱུར་བ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: They are the illuminations of mindfulness, intelligence, comprehension, phenomena, knowledge, truth, superknowledge, and accomplishment.
bo: འདི་ལྟ་སྟེ་ ། དྲན་པ་ -འི་ སྣང་བ་ དང་ ། བློ་གྲོས་ ཀྱི་ སྣང་བ་ དང་ ། རྟོགས་པ་ -འི་ སྣང་བ་ དང་ ། ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ -འི་ སྣང་བ་ དང་ ། མངོན་པར་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -འི་ སྣང་བ་ སྟེ་ །

source: Son of noble family, those are the eight bodhisattva illuminations.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, you may ask, ‘What are the bodhisattva illuminations of mindfulness?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ དྲན་པ་ -འི་ སྣང་བ་ གང་ཞེ་ན་ །

source: There are eight bodhisattva illuminations of mindfulness: when one prevents the roots of virtue performed in the past from going to waste, accumulates roots of virtue that have not yet been performed, does not forget teachings that one has heard, ascertains their meaning, is not carried away by the six kinds of sense objects, abandons nonvirtuous factors, and accomplishes virtuous factors, then mindfulness has become vast and excellent.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ དྲན་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྔོན་བྱས་པ་ -འི་ དགེ་བ་ -འི་ རྩ་བ་ ཆུད་ མི་ གཟོན་པ་ དང་ ། དགེ་བ་ -འི་ རྩ་བ་ མ་ བྱས་པ་ སོགས་པ་ དང་ ། ཐོས་པ་ -འི་ ཆོས་ རྣམས་ མི་ བརྗེད་པ་ དང་ ། དོན་ རྣམ་པ་ -ར་ ངེས་པ་ རྗེས་སུ་ ཐོབ་པ་ དང་ ། ཡུལ་དྲུག་ གིས་ མི་ འཕྲོགས་པ་ དང་ ། མི་དགེ་བ་ -འི་ ཆོས་ སྤང་ ཞིང་ དགེ་བ་ -འི་ ཆོས་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དྲན་པ་ རྒྱ་ཆེན་པོ་ ཕུན་སུམ་ ཚོགས་པ་ -ར་ གྱུར་པ་ དང་ །

source: Realizing that the bodhisattvas’ mindfulness has become excellent, the blessed buddhas appoint them as guardians of the city of the Dharma.
bo: དེ་ དྲན་པ་ ཕུན་སུམ་ ཚོགས་པ་ -ར་ རིག་ ནས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱིས་ ཆོས་ ཀྱི་ གྲོང་ཁྱེར་ སྲུང་བ་ -ར་ འཇོག་པ་ དང་ །

source: Finally, on the strength of the preceding types of mindfulness, one reaches illumination with respect to all Dharma teachings.
bo: དྲན་པ་ སྔོན་ དུ་ འགྲོ་བ་ -ས་ ཆོས་ ཐམས་ཅད་ ལ་ སྣང་བ་ ཐོབ་པ་ ཡིན་ ཏེ

source: Son of noble family, those are the eight bodhisattva illuminations of mindfulness.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ དྲན་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are eight bodhisattva illuminations of intelligence:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བློ་གྲོས་ ཀྱི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །
