Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: It consists in not being attached to the number of teachings ranging from a number as vast as the number of grains of sand in the river Ganges in a single buddhafield to a number as vast as the quantity of atoms in all the buddhafields.
bo: བསྟན་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་པ་ ནས་ ། བསྟན་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་ སོ་ ། །

source: “In this way, son of noble family, one teaches the gateways to the Dharma and their teachings, commencing with any gateway up to as many as the number of atoms in all buddhafields, through a single presentation, through two, three, four, five, six, ten, twenty, thirty, forty, or fifty teachings, or through hundreds, thousands, or a limitless number of teachings.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ ཆོས་ ཀྱི་ སྒོ་ གང་དང་གང་ བརྩམས་པ་ -འི་ ཆོས་ ཀྱི་ སྒོ་ དེ་ དང་ དེ་ -འི་ བསྟན་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ བསྟན་པ་ གཅིག་ གིས་ སྟོན་ ཏོ་ ། ། གཉིས་ དང་ ། གསུམ་ དང་ ། བཞི་ དང་ ། ལྔ་ དང་ ། དྲུག་ དང་ ། བཅུ་ དང་ ། ཉི་ཤུ་ དང་ ། སུམ་ཅུ་ དང་ ། བཞི་ བཅུ་ དང་ ། ལྔ་ བཅུ་ དང་ ། བརྒྱ་ དང་ ། སྟོང་ དང་ ། ཚད་ མེད་པ་ -འི་ བསྟན་པ་ -ས་ སྟོན་ ཏེ

source: Although one teaches using lexical imputations and associations and using precisely defined words, meanings, and syllables, one will be neither attached nor interrupted.
bo: ལྡན་པ་ དང་ ། འབྱོར་པ་ དང་ ། ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ དང་ ། དོན་ དང་ ། ཚིག་འབྲུ་ དང་ ལྡན་པ་ -ར་ སྟོན་ ཀྱང་ ཆགས་པ་ མེད་ ཅིང་ རྒྱུན་ ཆད་པ་ མེད་ དེ་ །

source: This is the dhāraṇī called entering the gate of nonattachment.
bo: འདི་ ནི་ ཆགས་པ་ མེད་པ་ -འི་ སྒོར་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ སོ་ ། །

source: “Son of noble family, you may ask, ‘What is the dhāraṇī called entering ascertainment by discriminating knowledge?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་སོ་ སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ རྣམ་པ་ -ར་ ངེས་པ་ ལ་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ གང་ཞེ་ན་ །

source: One knows meaning, phenomena, etymologies, and eloquence.
bo: གང་ དོན་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ བསྟན་པ་ མི་ཟད་པ་ ཤེས་པ་ དང་ ། ཆོས་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ བསྟན་པ་ མི་ཟད་པ་ ཤེས་པ་ དང་ ། ངེས་པ་ -འི་ ཚིག་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ བསྟན་པ་ མི་ཟད་པ་ ཤེས་པ་ དང་ ། སྤོབས་པ་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ བསྟན་པ་ མི་ཟད་པ་ ཤེས་པ་ སྟེ་ །

source: When all sentient beings of the eastern direction gather around one who has attained these kinds of knowledge, they inquire—each in their own language—about the mastery of meanings.
bo: ཤེས་པ་ འདི་ ལྟ་བུ་ རབ་ཏུ་ ཐོབ་པ་ དེ་ ལ་ ཤར་ཕྱོགས་ ཀྱི་ སེམས་ཅན་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ གཅིག་ ཏུ་ འདུས་ ཏེ་ ། རང་རང་ གི་ སྐད་ ཀྱིས་ དོན་ ལ་ མཁས་པ་ ཡོངས་སུ་ དྲིས་ །

source: Beings of the southern direction inquire about the mastery of phenomena.
bo: གང་དག་ ལྷོ་ཕྱོགས་ ཀྱི་ སེམས་ཅན་ དེ་དག་ གིས་ ནི་ ཆོས་ ལ་ མཁས་པ་ ཡོངས་སུ་ དྲིས་ །

source: Beings of the western direction inquire about the mastery of etymology.
bo: གང་དག་ ནུབ་ཕྱོགས་ ཀྱི་ སེམས་ཅན་ དེ་དག་ གིས་ ནི་ ངེས་པ་ -འི་ ཚིག་ ལ་ མཁས་པ་ ཡོངས་སུ་ དྲིས་ །

source: And beings of the northern direction inquire about the mastery of eloquence. When this occurs, the bodhisattvas’ vocal deeds will be correspondingly immense.
bo: གང་དག་ བྱང་ཕྱོགས་ ཀྱི་ སེམས་ཅན་ དེ་དག་ གིས་ ནི་ སྤོབས་པ་ ལ་ མཁས་པ་ ཡོངས་སུ་ དྲིས་ ན་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ངག་གི་ལས་ ཀྱང་ དེ་སྙེད་ དུ་ ཚད་ མེད་ དེ་ །

source: They will speak and employ various languages at the same time, without forgetting any and without their minds becoming distracted.
bo: དུས་ གཅིག་ ཏུ་ བརྗོད་ ཅིང་ སྐད་ སྣ་ཚོགས་ ལ་ འཇུག་པ་ ལ་ བརྗེད་པ་ -ར་ མི་ འགྱུར་ ། སེམས་ གཡེང་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: Knowing how to use languages, they adapt to all languages.
bo: སྐད་ ལ་ འཇུག་པ་ ཤེས་པ་ -ས་ སྐད་ ཐམས་ཅད་ ཀྱི་ རྗེས་སུ་ ཞུགས་ ཏེ་ །

source: By one moment of utterance, they bring knowledge that satisfies the minds of all sentient beings.
bo: སྐད་ཅིག་ བརྗོད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ རྣམ་པ་ -ར་ རིག་པ་ ཚིམ་པ་ -ར་ བྱེད་ དེ་ །

source: This is the dhāraṇī called entering ascertainment by discriminating knowledge.
bo: འདི་ ནི་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ རྣམ་པ་ -ར་ ངེས་པ་ ལ་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ སོ་ ། །

source: “Son of noble family, you may ask, ‘What is the dhāraṇī called blessing of the buddha ornaments?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ སངས་རྒྱས་ ཀྱི་ རྒྱན་ བྱིན་ གྱིས་ བརླབས་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ གང་ཞེ་ན་ །

source: Son of noble family, for bodhisattvas who have attained this dhāraṇī, the form of the Tathāgata, golden in color with a body adorned with the auspicious marks and signs and seated on a great Dharma seat in the center of a large circle of attendants, will manifest right above the crowns of their heads.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ འདི་ ལྟ་བུ་ རབ་ཏུ་ ཐོབ་པ་ ། ཆོས་ ཀྱི་ སྟན་ ཆེན་པོ་ ལ་ འདུག་པ་ ། འཁོར་ གྱི་ དཀྱིལ་འཁོར་ ཆེན་པོ་ -འི་ དབུས་ ན་ འདུག་པ་ -འི་ སྤྱི་གཙུག་ གི་ དྲང་ཐད་ ཀྱི་ སྟེང་ ན་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ གསེར་ གྱི་ མདོག་ ཅན་ མཚན་ དང་ དཔེ་བྱད་ ཀྱིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ -འི་ ལུས་ དང་ ལྡན་པ་ -འི་ གཟུགས་ འབྱུང་ སྟེ

source: The Tathāgata’s form places its right hand on top of their heads.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ གཟུགས་ དེ་ -ས་ ཕྱག་ གཡས་པ་ དེ་ -འི་ སྤྱི་གཙུག་ ཏུ་ འཇོག་ གོ་ ། །

source: As soon as it touches them, they are endowed with the activities of body, speech, and mind adorned by buddha ornaments.
bo: ཕྱག་ བཞག་ མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ སངས་རྒྱས་ ཀྱི་ རྒྱན་ གྱིས་ བརྒྱན་པ་ -འི་ ལུས་ ཀྱི་ ལས་ དང་ ལྡན་པ་ -ར་ འགྱུར་ རོ་ ། ། སངས་རྒྱས་ ཀྱི་ རྒྱན་ གྱིས་ བརྒྱན་པ་ -འི་ ངག་གི་ལས་ དང་ ལྡན་པ་ -ར་ འགྱུར་ རོ་ ། ། སངས་རྒྱས་ ཀྱི་ རྒྱན་ གྱིས་ བརྒྱན་པ་ -འི་ དྲན་པ་ -འི་ ལས་ དང་ ལྡན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Endowed with such qualities they can engage the mental dispositions of any audience and thereby teach the Dharma in a manner suited to each individual.
bo: དེ་ ཆོས་ དེ་ལྟ་ བུ་ དང་ ལྡན་ ཏེ་ ། འཁོར་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ བསམ་པ་ ལ་ འཇུག་པ་ -ས་ སོ་སོ་ ཅི་རིགས་པ་ -ར་ ཆོས་སྟོན་ ཏོ་ ། །

source: “However long they wish to teach the Dharma uninterruptedly without nourishment—whether it is for a day or two, three or four days, a week, a fortnight, a month, a season, or the course of a year, or even for a hundred years, a thousand years, or a hundred thousand years—because they are sustained by the blessings of the tathāgatas, whose gateways of Dharma are inexhaustible in number, they do not grow weary either physically or mentally.
bo: ཞག་ གཅིག་ གམ་ ། ཞག་ གཉིས་ སམ་ ། ཞག་ གསུམ་ མམ་ ། ཞག་ བཞི་ -འམ་ ། ཞག་ བདུན་ ནམ་ ། ཟླ་བ་ ཕྱེད་ དམ་ ། ཟླ་བ་ གཅིག་ གམ་ ། དུས་ སམ་ ། ལོ་ ཁྱུད་ ཀོར་ རམ་ ། ལོ་ བརྒྱ་ -འམ་ ། སྟོང་ ངམ་ ། ལོ་ བརྒྱ་ ཕྲག་ སྟོང་ ངམ་ ། ཇི་ཙམ་ དུ་ འདོད་པ་ དེ་ཙམ་ དུ་ ཁ་ཟས་ དང་ བྲལ་བ་ -འི་ རྒྱུད་ ཀྱིས་ ཆོས་སྟོན་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ ཤིན་ཏུ་ ཡོངས་སུ་ བཟུང་བ་ -འི་ ཕྱིར་ དེ་ -འི་ ཆོས་ ཀྱི་ སྒོ་ ཡོངས་སུ་ ཟད་པར་ མི་ འགྱུར་ ། ལུས་ དང་སེམས་ ངལ་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: “They possess four kinds of great knowledge.
bo: ཤེས་པ་ ཆེན་པོ་ བཞི་ དང་ ལྡན་པ་ -ར་ འགྱུར་ ཏེ་ །

source: You may ask, ‘Which four?’
bo: བཞི་ གང་ཞེ་ན་ །

source: They know how to distinguish the dispositions and words of sentient beings, they know the inexhaustible four types of discriminating knowledge, they know how to delineate the vehicles, and they know how to teach the Dharma in accordance with each individual.
bo: སེམས་ཅན་ གྱི་ བསམ་པ་ དང་ ། ཚིག་ རབ་ཏུ་ དབྱེ་བ་ ཤེས་པ་ དང་ ། སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ མི་ཟད་པ་ ཤེས་པ་ དང་ ། ཐེག་པ་ ཇི་ལྟར་ རྣམ་པ་ -ར་ དགོད་པ་ ཤེས་པ་ དང་ ། སོ་སོ་ ཅི་རིགས་པ་ -ར་ ཆོས་ བསྟན་པ་ ཤེས་པ་ དང་ ལྡན་པ་ -ར་ འགྱུར་ ཏེ

source: “Son of noble family, this is known as the concise introduction to the gateway of the blessing of the buddha ornaments dhāraṇī.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ནི་ སངས་རྒྱས་ ཀྱི་ རྒྱན་ བྱིན་ གྱིས་ བརླབས་པ་ -འི་ གཟུངས་ གང་ ཆུང་ ཟད་ གཞོལ་བ་ -འི་ སྒོར་ འཇུག་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: This dhāraṇī is inexhaustible, continues endlessly, embodies the scope of the tathāgatas, and is a boundless teaching.
bo: གཟུངས་ འདི་ ནི་ མི་ཟད་པ་ ། ཐུག་པ་ མེད་པ་ -འི་ རྗེས་སུ་ སོང་བ་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ མཚམས་ དང་ བཅས་པ་ དང་ བསྟན་པ་ ཚད་ མེད་པ་ -འོ་ ། །

source: “Son of noble family, these are the eight bodhisattva dhāraṇīs.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: Bodhisattvas who are established in these dhāraṇīs retain what all the buddhas say and uphold the Dharma they teach.
bo: གཟུངས་ དེ་དག་ ལ་ རབ་ཏུ་ གནས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ནི་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་ ཏོ་ ། ། ཆོས་སྟོན་པ་ ནི་ མི་ཟད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Since they explain it carefully, they make all beings happy.”
bo: ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Then Dhāraṇīśvara­rāja spoke these verses:
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ སྨྲ་ -ས་ སོ་ ། །

source: “While those in this vehicle who have attained The eight dhāraṇīs taught by the sugatas
bo: བདེ་གཤེགས་ རྣམས་ ཀྱིས་ རབ་ཏུ་ གསུངས་པ་ -འི་ གཟུངས་ བརྒྱད་པོ་ ། ། ཐེག་པ་ འདི་ -ར་ ནི་ དེ་དག་ རྣམ་པ་ -ར་ ངེས་ ཐོབ་པ་ ། །

source: May explain a vast number of sūtras without barrier, They are not hampered regarding any meanings or syllables.
bo: མདོ་སྡེ་ བྱེ་བ་ སྟོང་ཕྲག་ ཐུག་པ་ མེད་ འཆད་ ཀྱང་ ། ། དེ་ ནི་ དོན་ དང་ ཚིག་འབྲུ་ གང་ ལ་ -འང་ ཆགས་པ་ མེད་ ། །

source: “Delightful, melodious, and attractive melodies Foster understanding in vast numbers of buddhafields.
bo: ཡིད་འོང་ ཤིན་ཏུ་ སྙན་ ཅིང་ ཆགས་པ་ -ར་ འགྱུར་བ་ -འི་ དབྱངས་ ། ། བྱེ་བ་ སྟོང་ཕྲག་ ཚད་ མེད་ ཞིང་ དུ་ གོ་བྱེད་པ་ ། །

source: Hearing it, sentient beings progress toward nirvāṇa.
bo: སེམས་ཅན་ རྣམས་ ཀྱིས་ དེ་ ཐོས་ མྱ་ངན་ འདས་པ་ -ར་ འགྲོ་ ། །

source: The pure melody dhāraṇī is limitless.
bo: སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ གཟུངས་ འདི་ ཐུག་པ་ མེད་ ། །

source: “While learned and wise ones who know all linguistic forms
bo: ཡི་གེ་ ཐམས་ཅད་ ཤེས་པ་ མཁས་པ་ བློ་གྲོས་ ལྡན་ ། །

source: May teach for many eons, they do not run out of Dharma.
bo: བསྐལ་པ་ མང་པོ་ -ར་ འཆད་ ཀྱང་ ཆོས་ ལ་ ཟད་པ་ མེད་ ། །

source: As they pronounce a single basic word, it becomes inexhaustible.
bo: རྩ་བ་ -འི་ ཚིག་ གཅིག་ བརྗོད་པ་ -འང་ ཟད་པར་ མི་ འགྱུར་ ཏེ་ ། །

source: This is the dhāraṇī of the inexhaustible basket.
bo: མི་ཟད་ ཆོས་ ཀྱི་ ཟ་མ་ཏོག་ འདི་ དྲན་པ་ ཡི་ ། །

source: “Wise ones who attain the dhāraṇī, whose positive determination has reached the limit of reality,
bo: གང་ གིས་ གཟུངས་ ཐོབ་ མཐའ་མ་ -ར་ ཐུག་པ་ -ར་ ཡོངས་ བཅད་པ་ ། །

source: Are intent on the teachings that are authentic and appropriate.
bo: མཉམ་ཉིད་ ཚུལ་བཞིན་ ཆོས་ ལ་ སེམས་པ་ བློ་གྲོས་ ལྡན་ ། །

source: These leaders have abandoned and thus purified all extreme beliefs,
bo: མཐ་ -ར་ འཛིན་ ཐམས་ཅད་ རྣམ་པ་ -ར་ སྤངས་ ཏེ་ ཡོངས་ དག་པ་ -ས་ ། །

source: Yet they do not become stuck in the middle.
bo: ཁྱུ་མཆོག་ གྱུར་པ་ དེ་ ནི་ དབུས་ ལ་ གནས་ མི་ འགྱུར་ ། །

source: “When they have attained the great ocean mudrā, Having discussed it and described the inconceivable seals,
bo: གང་ གིས་ མཚོ་ཆེན་ ཕྱག་རྒྱ་ -འི་ གཟུངས་ ནི་ རབ་ ཐོབ་པ་ ། ། དེ་ ཡི་ ཁ་ ནས་ ཕྱག་རྒྱ་ བསམ་ཡས་ རྗོད་པ་ ན་ ། །

source: All the forms in the four continents Possess the great ocean that is nonconceptuality.
bo: གང་དག་ གླིང་བཞི་ གཟུགས་ ཀྱི་ རྣམ་པ་ ཇི་སྙེད་པ་ ། ། དེ་དག་ ཀུན་ དང་ རྒྱ་མཚོ་ མཚོ་ཆེན་ བཅས་ མི་ རྟོག་ །

source: “When great beings teach the Dharma to an audience,
bo: འཁོར་ དུ་ གལ་ཏེ་ བདག་ཉིད་ ཆེན་པོ་ དེ་ ཆོས་སྟོན་ ། །

source: A vast shower of lotus flowers falls from the sky And a multitude of teachings manifest from them.
bo: ནམ་མཁའ་ ལས་ ནི་ པད་མ་ དག་ གི་ ཆ་ -ར་ ཆེན་ འབབ་ ། ། པད་མ་ དག་ ལས་ ཆོས་ མང་ བྱེ་བ་ རབ་ཏུ་ འབྱུང་ ། །

source: This is the pure lotus array dhāraṇī.
bo: འདི་ ནི་ པད་མ་ བཀོད་པ་ -འི་ གཟུངས་ ཏེ་ ཡོངས་སུ་ དག་ །

source: “When they have attained the nonattachment dhāraṇī,
bo: ཆགས་པ་ མེད་པ་ -འི་ གཟུངས་ ནི་ གལ་ཏེ་ ཐོབ་ གྱུར་ ན་ ། །

source: They have no attachment in speaking, whether expressing a single word Or two, three, four, five, a million, A hundred thousand million, or an endless number of words.
bo: ཚིག་ གཅིག་ བརྗོད་པ་ རབ་ཏུ་ སྨྲ་ དང་ གཉིས་ དག་ དང་ ། ། གསུམ་ དང་ བཞི་ དང་ ལྔ་ དང་ བྱེ་བ་ དག་ དང་ ནི་ ། ། ཁྲག་ཁྲིག་ ཐུག་པ་ མེད་པ་ -ར་ སྨྲ་ ལ་ ཆགས་པ་ མེད་ ། །

source: “When they have attained the dhāraṇī that transcends doubt And are requested by the multitudes of beings of the ten directions, Then, regarding the entire range of meaning, phenomena, etymology, and eloquence, All the doubts of these beings are dispelled, and their anxieties disappear.
bo: གང་ གིས་ རྣམ་པ་ -ར་ གདོན་ མི་ ཟ་བ་ -འི་ གཟུངས་ཐོབ་པ་ ། ། དོན་ དང་ ཆོས་ དང་ ངེས་ཚིག་ སྤོངས་པ་ ཇི་སྙེད་པ་ ། ། ཕྱོགས་ བཅུ་ -འི་ སེམས་ཅན་ ཇི་སྙེད་ མང་པོ་ -ས་ ཡོངས་ དྲིས་ ན་ ། ། དེ་དག་ ཐེ་ཚོམ་ ཀུན་ བཅད་ དོགས་པ་ མེད་པ་ -ར་ འགྱུར་ ། །

source: “When they have attained the dhāraṇī of the buddhas’ magical display, And this great brilliant one is seated on his throne, The Buddha places his right hand upon their heads And they become just as eloquent as the Victor himself.
bo: གང་ གིས་ སངས་རྒྱས་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ གཟུངས་ཐོབ་པ་ ། ། གཟི་བརྗིད་ ཆེན་པོ་ དེ་ ནི་ སྟན་ ལ་ འདུག་པ་ ན་ ། ། སངས་རྒྱས་ ཕྱག་ གཡས་ དེ་ ཡི་ སྤྱི་བོ་ -ར་ འཇོག་ མཛད་ དེ་ ། ། དེ་ཡང་ རྒྱལ་བ་ -འི་ སྤོབས་པ་ ཅི་འདྲ་ བཞིན་ དུ་ འགྱུར་ ། །

source: “When they have attained these dhāraṇīs,
bo: གང་ གིས་ གཟུངས་ རྣམས་ འདི་དག་ རབ་ཏུ་ ཐོབ་ འགྱུར་བ་ ། །

source: Their qualities become inconceivable and endless.
bo: དེ་ ཡི་ ཡོན་ཏན་ བསམ་ཡས་ ཐུག་པ་ མེད་ འགྱུར་ ཏེ་ ། །

source: Even if they were described for eons ten million times the extent of Ganges, Since they express tribute to the supreme leader, there would be no end.
bo: གང་ གཱའི་ སྙེད་ ཀྱི་ བསྐལ་པ་ བྱེ་བ་ སྟོང་ བརྗོད་ ཀྱང་ ། ། ཁྱུ་མཆོག་ གྱུར་པ་ -འི་ བསྔགས་པ་ བརྗོད་པ་ -ས་ ཟད་པ་ མེད་ ། །

source: Their knowledge will engage the three realms equally. “When they have attained the supreme dhāraṇīs,
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ཡི་ ཤེས་པ་ སྲིད་པ་ གསུམ་ ལ་ མཉམ་ འཇུག་ སྟེ་ ། །

source: They rise above the three existences like lotuses.
bo: པད་མ་ བཞིན་ དུ་ སྲིད་པ་ གསུམ་ ལས་ འཕགས་ འགྱུར་ ཞིང་ ། །

source: They are unshaken by any object, just like Mount Meru.
bo: རི་རབ་ བཞིན་ དུ་ ཡུལ་ རྣམས་ ཀྱིས་ ནི་ མི་ བསྐྱོད་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, They behave in a way that leaves all worldliness behind.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ སྲིད་ ཀུན་ རྣམ་པ་ -ར་ སྤངས་པ་ -འི་ སྤྱད་ སྤྱོད་ དེ་ ། །

source: When they address gatherings of non-Buddhists to quell them, They are without fear of the audience, like a lion.
bo: མུ་སྟེགས་ ཅན་ གྱི་ ཚོགས་ ཀུན་འཇོམས་པ་ སྒྲོག་པ་ ན་ ། ། སེང་གེ་ བཞིན་ དུ་ འཁོར་ དུ་ འཇིགས་པ་ མེད་པ་ -ར་ འགྱུར་ ། །

source: “Like earth, the dhāraṇīs make virtues grow.
bo: ས་ ལྟར་ དགེ་བ་ རྣམས་ ནི་ རྣམ་པ་ -ར་ སྐྱེད་པ་ -ར་ འགྱུར་ ། །

source: Like water, they rinse away stains.
bo: ཆུ་ ལྟར་ དྲི་མ་ རྣམས་ ནི་ རབ་ཏུ་ དེད་པ་ -ར་ འགྱུར་ ། །

source: Like fire, they incinerate arrogance and conceptualization.
bo: མེ་ ལྟར་ རློམ་སེམས་ མེད་ ཅིང་ རྣམ་རྟོག་ མེད་པ་ -ར་ འགྱུར་ ། །

source: Like air, they are unobstructed by directions.
bo: རླུང་ ལྟར་ ཡུལ་ རྣམས་ ལ་ ནི་ ཆགས་པ་ མེད་པ་ -ར་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, Their knowledge and faculties are unagitated when they speak.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ སྨྲ་ ཚེ་ ཤེས་ དང་ དབང་པོ་ འཁྲུག་པ་ མེད་ ། །

source: They bring liberation to beings like medicine, And, wishing to help them, they dispense the diuretic of Dharma.
bo: དེ་ ནི་ སྨན་པ་ བཞིན་ དུ་ འགྲོ་བ་ ཐར་ བྱེད་ འགྱུར་ ། ། ཕན་པ་ -ར་ འདོད་པ་ -ས་ ཆོས་ ཀྱི་ བཀྲུ་སྨན་ སྦྱིན་པ་ -ར་ བྱེད་ ། །

source: “When they have attained the supreme dhāraṇīs, Throngs of beings never tire of gazing at them.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། སྐྱེ་བོ་ -འི་ ཚོགས་ རྣམས་ དེ་ ལ་ ལྟ་བ་ -ས་ མི་ ངོམས་ ཏེ་ ། །

source: Like the moon, and with pure training in virtues, Their mental equanimity emits a steady brilliant light.
bo: ཟླ་བ་ བཞིན་ དུ་ དགེ་བ་ དག་ ནི་ རྣམ་ སྦྱོང་ འགྱུར་ ། ། སེམས་ སྙོམས་ གཟི་བརྗིད་ ཆེན་པོ་ འོད་ཟེར་ མཉམ་པ་ -ར་ གཏོང་ ། །

source: “When they have attained the supreme dhāraṇīs, They dry up each and every existence of beings.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ འགྲོ་བ་ -འི་ སྲིད་པ་ མ་ ལུས་ སྐེམས་པ་ -ར་ བྱེད་ ། །

source: Like the sun, and generating light that dispels darkness, They wake the slumbering beings in the three existences.
bo: ཉི་མ་ བཞིན་ དུ་ འོད་བྱེད་ མུན་པ་ སེལ་བ་ -ར་ འགྱུར་ ། ། གཉིད་ལོག་ སེམས་ཅན་ སྲིད་པ་ གསུམ་ ལས་ སད་པ་ -ར་ བྱེད་ ། །

source: “When they have attained the supreme dhāraṇīs, There is not the slightest clinging to anything.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ ཀུན་ ལ་ཆུང་ ཟད་ ཙམ་ ཡང་ འཛིན་པ་ མེད་ ། །

source: Like a king, and being great world rulers like Vaiśravaṇa, They display the riches of the teachings.
bo: དེ་ ནི་ རྒྱལ་པོ་ བཞིན་ དུ་ འཇིག་རྟེན་ དབང་ཕྱུག་ ཆེ་ ། ། རྣམ་ཐོས་ བུ་ བཞིན་ ནོར་ལྡན་ ཆོས་ རྣམས་ སྟོན་པ་ -ར་ བྱེད་ ། །

source: “When they have attained the supreme dhāraṇīs, They resemble nāgas, mindful of great miracles.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། རྫུ་འཕྲུལ་ ཆེན་པོ་ དྲན་ ལྡན་ ཀླུ་ དང་ འདྲ་ -ར་ འགྱུར་ ཏེ་ ། །

source: When clouds billow and lightning appears in the sky,
bo: སྤྲིན་ གྱི་ བྱ་བ་ བྱེད་ ཅིང་ མཁའ་ ལས་ གློག་ ཕྱུང་ ནས་ ། །

source: They rain down showers of Dharma in order to bring peace.
bo: ཞི་བ་ -ར་ བྱ་ ཕྱིར་ དེ་ ནི་ ཆོས་ ཀྱི་ ཆར་པ་ འབེབས་ ། །

source: “When they have attained the supreme dhāraṇīs, All audiences will gaze upon their faces as supreme leaders.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། འཁོར་ རྣམས་ ཐམས་ཅད་ ཁྱུ་མཆོག་ གྱུར་པ་ -འི་ གདོང་ དུ་ བལྟ་ ། །

source: Having a supreme form like Śakra, not a mediocre one, The wise ones consider the Dharmas and aims pertaining to beings.
bo: བརྒྱ་བྱིན་ བཞིན་ དུ་ དམན་པ་ མ་ ཡིན་ གཟུགས་མཆོག་ ལྡན་ ། ། བློ་ ཆེན་ འགྲོ་བ་ རྣམས་ ལ་ ཆོས་ དང་ དོན་ རྣམས་ སེམས་ ། །

source: “When they have attained the supreme dhāraṇīs, They meditate on the pure abodes of Brahmā.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ ཚངས་པ་ -འི་ གནས་པ་ ཡོངས་ དག་ བསམ་གཏན་ བྱེད་ ། །

source: Like Brahmā, their equipoise is compassionate.
bo: ཚངས་པ་ བཞིན་ དུ་ མཉམ་བཞག་ སྙིང་རྗེ་ ལྡན་པ་ -ར་ འགྱུར་ ། །

source: Outshining all the worlds, they meditate.
bo: འཇིག་རྟེན་ འདི་ ཀུན་ ཟིལ་ གྱིས་ མནན་ ནས་ བསམ་གཏན་ བྱེད་ ། །

source: “When they have attained the supreme dhāraṇīs, They venerate the many buddhas of the ten directions.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ མང་ ལ་ མཆོད་པ་ བྱེད་ ། །

source: They never regresses from the five types of superknowledge.
bo: དེ་ ནི་ རྟག་ ཏུ་ མངོན་ཤེས་ ལྔ་ ལས་ ཉམས་ མི་ འགྱུར་ ། །

source: They traverse inconceivable hundreds of buddhafields through pure space.
bo: ཞིང་ བརྒྱ་ བསམ་ གྱིས་ མི་ ཁྱབ་ དག་ ཏུ་ མཁའ་ ནས་ འགྲོ་ ། །

source: “When they have attained the supreme dhāraṇīs, It will not be before long before they attain buddha qualities.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ རིང་པོ་ -ར་ མི་ ཐོགས་ སངས་རྒྱས་ ཡོན་ཏན་ འཐོབ་ ། །

source: The victors of the directions will express their approval of this
bo: ཕྱོགས་ ན་ རྒྱལ་བ་ རྣམས་ ནི་ དེ་ ཡི་ བསྔགས་བརྗོད་ དེ་ ། །

source: And praise them like their only gifted child.
bo: བུ་ གཅིག་པ་ ཞིག་ ཡོན་ཏན་ ལྡན་པ་ བཞིན་ དུ་ བསྟོད་ ། །

source: “When they have attained the supreme dhāraṇīs, Their eloquence is like a well-strung rosary.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ཡི་ སྤོབས་པ་ ཕྲེང་བ་ ལེགས་ བརྒྱུས་ ཇི་བཞིན་ ཏེ་ ། །

source: When they elucidate the many profound and varied sūtras,
bo: མདོ་སྡེ་ ཟབ་མོ་ སྣ་ཚོགས་ མང་པོ་ འཆད་པ་ ན་ ། །

source: Their eloquence is vast, expansive, and inexhaustible.
bo: སྤོབས་པ་ རྒྱ་ ཆེ་ ཡངས་ ཤིང་ ཟད་པ་ མེད་པ་ -ར་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, They are neither arrogant, deceitful, nor proud.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ལ་ རྒྱགས་པ་ མེད་ ཅིང་ གཡོ་མེད་ ང་རྒྱལ་ མེད་ ། །

source: They are mindful and intelligent, and they possesses the realization of the wise ones.
bo: དྲན་ ལྡན་ བློ་གྲོས་ ལྡན་ ཞིང་ བློ་ལྡན་ རྟོགས་ དང་ ལྡན་ ། །

source: The scope of their infinite knowledge is like the sky.
bo: ཡེ་ཤེས་ མཐའ་ ཡས་ སྤྱོད་ཡུལ་ ནམ་མཁའ་ བཞིན་ དུ་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, All their faulty conditioning is terminated.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ཡི་ འདུས་བྱས་ ཉེས་པ་ ཐམས་ཅད་ རབ་ཏུ་ ཆད་ ། །

source: Insight, wisdom, and skill is united,
bo: ཤེས་རབ་ ཡེ་ཤེས་ ཐབས་ དང་ ཟུང་ དུ་ འབྲེལ་བ་ -ར་ འགྱུར་ ། །

source: And love and compassion are likewise united.
bo: བྱམས་ དང་ སྙིང་རྗེ་ དག་ ཀྱང་ ཟུང་ དུ་ འབྲེལ་བ་ -ར་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, There is not the slightest agitation when they speak.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ སྨྲ་ ཚེ་ འཁྲུལ་པ་ ཆུང་ ཟད་ མི་ དམིགས་ ཏེ་ ། །

source: Great beings know the languages of ordinary beings, And their behaviors, capacities, and inclinations as well.
bo: བདག་ཉིད་ ཆེ་ དེ་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྒྲ་ སྐད་ ཤེས་ ། ། སྤྱོད་ དང་ དབང་པོ་ དང་ ནི་ མོས་པ་ ཐམས་ཅད་ ཤེས་ ། །

source: “When they have attained the supreme dhāraṇīs, They attain special insight into the Dharma and attain virtue, mindfulness, Miracles, abandonment, the spiritual faculties, the five strengths, The factors of awakening, and likewise the supreme path of tranquil abiding.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ -ས་ ནི་ ཆོས་ ལ་ ལྷག་མཐོང་ དགེ་ དང་ དྲན་པ་ དང་ ། ། རྫུ་འཕྲུལ་ དང་ ནི་ སྤང་ དང་ དབང་པོ་ སྟོབས་ ལྔ་ དང་ ། ། བྱང་ཆུབ་ ཡན་ལག་ དེ་བཞིན་ ལམ་མཆོག་ ཞི་གནས་ འཐོབ་ ། །

source: “When they have attained the supreme dhāraṇīs, They realize the sugata domain by themselves, Thoroughly perfect the perfections, And become intelligent and skilled in the means of attraction.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ བདེ་གཤེགས་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ རང་ གིས་ རྟོགས་ ། ། ཕ་རོལ་ ཕྱིན་པ་ དག་ ནི་ ཀུན་ གྱི་ ཕ་རོལ་ སོན་ ། ། བསྡུ་བ་ -འི་ དངོས་པོ་ ཀུན་ ལ་ མཁས་ ཤིང་ བློ་གྲོས་ ལྡན་ ། །

source: “When they have attained the supreme dhāraṇīs, There will never be even the slightest confusion.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ལ་ ནམ་ཡང་ འཁྲུལ་པ་ ཆུང་ ཟད་ མི་ དམིགས་ ཏེ་ ། །

source: They will be determined but not intoxicated by peace or calm.
bo: ངེས་པ་ དེ་ ནི་ ཞི་ ཞིང་ ཉེར་ཞི་ མྱོས་པ་ མེད་ ། །

source: They will be disciplined and settled in conduct.
bo: དེ་ ནི་ སྤྱོད་ ལ་ རབ་ཏུ་ གནས་ གྱུར་ ཤིན་ཏུ་ དུལ་ ། །

source: “When they have attained the supreme dhāraṇīs, They are present upon a lotus flower in the presence of the Sugata.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ བདེ་གཤེགས་ སྤྱན་སྔ་ -ར་ པད་མ་ -འི་ སྟེང་ ན་ འདུག་ །

source: Their bodies will be nonsubstantial, arisen by the force of the Dharma
bo: དེ་ ཡི་ ལུས་ ནི་ ཆོས་ ཀྱི་ རྒྱུས་ བྱུང་ རྡུལ་ དང་ བྲལ་ ། །

source: And unstained by the impurities of the womb.
bo: དེ་ ཡི་ ལུས་ ལ་ མངལ་ གྱི་ དྲི་མ་ -ས་ གོས་ མི་ འགྱུར་ ། །

source: “When they have attained the supreme dhāraṇīs, They are consecrated by all the victors as proponents of the Dharma.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ རྒྱལ་བ་ ཀུན་ གྱིས་ བྱིན་ བརླབས་ ཆོས་ སྨྲ་ སྟེ་ ། །

source: Whatever physical, verbal, and mental actions they perform Will benefit beings since they are done with omniscience.
bo: དེ་ ནི་ ལུས་ དང་ ངག་ ཡིད་ ལས་ རྣམས་ གང་ བྱེད་པ་ ། ། ཐམས་ཅད་ ཤེས་པ་ -ས་ བྱས་ ཏེ་ སྐྱེ་བོ་ ཕན་པ་ -ར་ བྱེད་ ། །

source: “When they have attained the supreme dhāraṇīs, They are endlessly applauded when they speak.
bo: གང་ གིས་ གཟུངས་ ཀྱི་ མཆོག་ རྣམས་ རབ་ཏུ་ ཐོབ་ གྱུར་པ་ ། ། དེ་ ནི་ སྨྲ་ ཚེ་ བསྔགས་པ་ ཟད་པར་ མི་ འགྱུར་ ཏེ་ ། །
