Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: It is difficult to see for those who rely on the six sense fields.
bo: སྐྱེ་མཆེད་ དྲུག་ ལ་ བརྟེན་པ་ རྣམས་ ཀྱིས་ མཐོང་བ་ -ར་ དཀའ་བ་ །

source: It is difficult to trust for those dedicated to the lower vehicles.
bo: ཐེག་པ་ དམན་པ་ ལ་མོ་ -ས་པ་ རྣམས་ ཀྱིས་ ཡིད་ཆེས་པ་ -ར་ དཀའ་བ་ །

source: It is not for śrāvakas or pratyekabuddhas but is the provenance of bodhisattvas.
bo: ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ རྣམས་ ཀྱིས་ མ་ ལགས་པ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ །

source: “This awakening is the seal of all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ ཕྱག་རྒྱ་ །

source: It is the equality of the realm of phenomena and thus inseparable from it.
bo: ཆོས་ ཀྱི་ དབྱིངས་ མཉམ་པ་ཉིད་པ་ -ས་ ཕྱེ་བ་ མ་ མཆིས་པ་ །

source: Having the characteristic of space, it does not become defiled.
bo: ནམ་མཁའ་ -འི་ མཚན་ཉིད་ ཀྱི་ སླད་ དུ་ འགྱུར་བ་ མ་ མཆིས་པ་ །

source: Since it is totally transcendent, it is not a substratum.
bo: ཤིན་ཏུ་ འདས་པ་ -ས་ ཀུན་གཞི་ མ་ མཆིས་པ་ །

source: It has knowledge of the behaviors of all sentient beings and knowledge of all causes.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སྤྱོད་པ་ རབ་ཏུ་ ཤེས་པ་ ། རྒྱུ་ ཐམས་ཅད་ ཡོངས་སུ་ ཤེས་པ་ །

source: “This awakening is the illumination of the perfection of wisdom.
bo: ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ -འི་ སྣང་བ་ །

source: It is the source of deliverance.
bo: ངེས་པར་ འབྱུང་བ་ རྣམས་ ཀྱི་ འབྱུང་བ་ །

source: It is the method of the roots of virtue.
bo: དགེ་བ་ -འི་ རྩ་བ་ རྣམས་ ཀྱི་ ཐབས་ །

source: It is what is discerned by those who have attained discriminating knowledge.
bo: སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ཐོབ་པ་ རྣམས་ ཀྱིས་ རྣམ་པ་ -ར་ དབྱེ་བ་ -ར་ བགྱི་བ་ །

source: It liberates those who have attained superknowledge.
bo: མངོན་པར་ ཤེས་པ་ ཐོབ་པ་ རྣམས་ ཀྱིས་ རྣམ་པ་ -ར་ དགྲོལ་བ་ -ར་ བགྱི་བ་ །

source: “This awakening consists in the realization of equality by those who abide in the single way.
bo: ཚུལ་ གཅིག་ ལ་ གནས་པ་ རྣམས་ ཀྱིས་ མཉམ་པ་ཉིད་ དུ་ རྟོགས་པ་ -ར་ བགྱི་བ་ །

source: Not being multifarious, it is not differentiated among practitioners.
bo: སྣ་ཚོགས་ མ་ མཆིས་པ་ -ར་ སྤྱོད་པ་ རྣམས་ ལ་ ཁྱད་པར་ མ་ མཆིས་པ་ །

source: Since it is the same as space, it is equal.
bo: ནམ་མཁའ་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ མཉམ་པ་ །

source: But since is not a counteragent, it is unequal.
bo: གཉེན་པོ་ མ་ མཆིས་པ་ -ས་ མཉམ་པ་ མ་ མཆིས་པ་ །

source: Since it is equal to all buddhas, it is both equal and unequal.
bo: སངས་རྒྱས་ ཐམས་ཅད་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ མི་མཉམ་པ་ དང་ མཉམ་པ་ །

source: Since it is distinguished by way of cessation, it is free of dualism.
bo: འགོག་པ་ -ས་ རབ་ཏུ་ ཕྱེ་བ་ -ས་ གཉིས་ དང་ བྲལ་བ་ །

source: It is not something to be analyzed by letters.
bo: ཡི་གེ་ རྣམས་ ཀྱིས་ དཔྱད་ དུ་མ་ མཆིས་པ་ །

source: “This awakening is truly established as real.
bo: དོན་ གྱི་ ཡང་དག་པ་ -ར་ བཞག་པ་ །

source: It is something known by language, yet ultimately it does not exist as something expressible.
bo: སྒྲ་ -ས་ རྣམ་པ་ -ར་ རིག་པ་ -ར་ བགྱི་བ་ ། དོན་དམ་པ་ -ར་ བརྗོད་ དུ་མ་ མཆིས་པ་ །

source: It exists conventionally, it is endowed with the might of the Three Jewels, it is conceived of in terms of the three vehicles, it is shown to be the three gates of liberation, it totally transcends the three realms, and it consists in the comprehension of threefold awareness.
bo: ཀུན་རྫོབ་ ཏུ་ མཆིས་པ་ ། དཀོན་མཆོག་ གསུམ་ གྱི་ མཐུ་ དང་ ལྡན་པ་ ། ཐེག་པ་ གསུམ་ ལ་ རྣམ་པ་ -ར་ རྟོག་པ་ ། རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་གསུམ་པོ་ དག་ རབ་ཏུ་ སྟོན་པ་ ། ཁམས་ གསུམ་པ་ ལས་ ཤིན་ཏུ་ འདས་པ་ ། རིག་པ་ གསུམ་པོ་ དག་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བགྱིད་པ་ །

source: “This awakening generates the vajra-like absorption.
bo: རྡོ་རྗེ་ ལྟ་བུ་ -འི་ ཏིང་ངེ་འཛིན་ བསྐྱེད་པ་ །

source: It is the abode of all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ གནས་ །

source: It has arisen from the wisdom of the Buddha.
bo: སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ལས་ བྱུང་བ་ །

source: It is the sustenance of all beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉེ་བར་ འཚོ་བ་ །

source: Being made clearly present by all buddhas, it is truly wonderful!
bo: སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསལ་བ་ -ར་ མཛད་པ་ ནི་ ངོ་མཚར་ ཏོ་ ། །

source: “Blessed One, sons or daughters of noble family who have faith in this vast account of the awakening of the blessed buddhas, who generate the thought of unsurpassed complete and perfect awakening, who listen to this sūtra in order to retain the holy Dharma, who are faithful, and who recollect it, uphold it, read it, master it, or teach it in detail to others—they, Blessed One, will generate a vast amount of merit.
bo: བཅོམ་ལྡན་འདས་ རིགས་ ཀྱི་ བུ་ -འམ་ ། རིགས་ ཀྱི་ བུ་མོ་ གང་དག་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ བསྟན་པ་ ཚད་མ་ མཆིས་པ་ འདི་ ལ་མོ་ -ས་པ་ -ར་ བགྱིད་པ་ དང་ ། བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ ཡང་ སེམས་ སྐྱེད་པ་ -ར་ བགྱིད་པ་ དང་ ། དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ གཟུང་བ་ -འི་ སླད་ དུ་ མདོ་སྡེ་ འདི་ ལྟ་བུ་ འདི་ མཉན་པ་ -ར་ བགྱིད་པ་ དང་ ། མོས་པ་ -ར་ བགྱིད་པ་ དང་ ། འཛིན་པ་ དང་ ། འཆང་བ་ དང་ ། ཀློག་པ་ དང་ ། ཀུན་ ཆུབ་པ་ -ར་ བགྱིད་པ་ དང་ ། གཞན་དག་ ལ་ ཡང་ རྒྱས་པ་ -ར་ ཡང་དག་པ་ -ར་ སྟོན་པ་ -ར་ བགྱིད་པ་ དེ་དག་ ནི་ བཅོམ་ལྡན་འདས་ བསོད་ནམས་ མང་ དུ་ སྐྱེད་པ་ ལགས་སོ་ ། །

source: They will thereby pay homage to and repay the kindness of the tathāgatas.”
bo: དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ལ་ ཡང་ བྱས་པ་ གཟོ་བ་ དང་ ། བྱས་པ་ འཚལ་བ་ ལགས་སོ་ ། །

source: The Blessed one responded,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: “That is correct, son of noble family.
bo: རིགས་ ཀྱི་ བུ་ དེ་དེ་ བཞིན་ ནོ་ ། །

source: It is just as you have said: these beings will indeed generate a vast amount of merit.
bo: ཇི་སྐད་ སྨྲས་པ་ བཞིན་ ཏེ་ ། དེ་དག་ བསོད་ནམས་ མང་ དུ་ སྐྱེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Some may fill all buddhafields visible to the tathāgata eye with all jewels and offer them to the tathāgatas, but if others, in order to uphold the holy Dharma and ensure the continuity of the Three Jewels, were to listen to this sūtra, have faith in it, retain it, uphold it, read it, master it, teach it in detail to others, or diligently persist in the yoga of cultivating it—these beings would generate a much larger amount of merit.”
bo: རིགས་ ཀྱི་ བུ་ གང་ གིས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱན་ གྱིས་ གཟིགས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ རིན་པོ་ཆེ་ ཐམས་ཅད་ ཀྱིས་ རབ་ཏུ་ བཀང་ སྟེ་ ། དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ལ་ སྦྱིན་པ་ བྱིན་པ་ བས་ གང་ གིས་ དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ བཟུང་བ་ དང་ ། དཀོན་མཆོག་ གསུམ་ རྒྱུན་ མི་འཆད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ མདོ་སྡེ་ འདི་ ལྟ་བུ་ འདི་ ཉན་ ཏམ་ ། མོས་ སམ་ ། འཛིན་ ཏམ་ ། འཆང་ ངམ་ ། ཀློག་ གམ་ ། ཀུན་ ཆུབ་པ་ -ར་ བྱེད་ དམ་ ། སྟོན་ ཏམ་ ། གཞན་དག་ ལ་ ཡང་ རྒྱས་པ་ -ར་ ཡང་དག་པ་ -ར་ སྟོན་ ཏམ་ ། བསྒོམ་པ་ -འི་ རྣལ་འབྱོར་ ལ་ བརྩོན་པ་ -ར་ གནས་ ན་ འདི་ ནི་ དེ་བ་ -ས་ བསོད་ནམས་ ཆེས་ མང་ དུ་ སྐྱེད་ དོ་ ། །

source: Then the Blessed One uttered these verses:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “If some were to fill the fields that I behold with buddha eyes With jewels and offer them to the Tathāgata, But fail to listen to this teaching,
bo: སངས་རྒྱས་ སྤྱན་ གྱིས་ ཞིང་ གང་ ངས་ མཐོང་བ་ ། ། རིན་ཆེན་ བཀང་ སྟེ་ དེ་བཞིན་ གཤེགས་ བྱིན་ ཡང་ ། ། འདི་ ལྟ་བུ་ ཡི་ ཆོས་ འདི་ མ་ ཐོས་ ན་ ། །

source: I declare that their merit would be small.
bo: དེ་ ནི་ བསོད་ནམས་ ཆུང་ ཞེས་ ང་ སྨྲ་ -འོ་ ། །

source: “If others were to hear this good sūtra, which is subtle and profound And embodies the ultimate truth, And were to retain, uphold, and read it,
bo: གང་ གིས་ དམ་པ་ -འི་ དོན་ལྡན་ ཕྲ་ ཟབ་པ་ ། ། མདོ་སྡེ་ བཟང་པོ་ འདི་ ནི་ ཐོས་ གྱུར་ ན་ ། ། ཀུན་ དུ་ འཛིན་ ཅིང་ བཟུང་ ནས་ ཀློག་ བྱེད་པ་ ། །

source: Their merit would be far superior.
bo: འདི་ ནི་ དེ་བ་ -ས་ བསོད་ནམས་ མཆོག་ ཏུ་ འཕགས་ ། །

source: “Thus, attainment through the Victor’s Dharma And deliverance through the Dharma are not trifling things.
bo: འདི་ལྟར་ རྒྱལ་བ་ -འི་ ཆོས་ ཀྱིས་ ཉེར་གནས་ ཤིང་ ། ། ཆོས་ ཀྱིས་ ངེས་པར་ འབྱུང་ གི་ ཟང་ཟིང་ མིན་ ། །

source: Those who thereby uphold the Sugata’s Dharma Repay the kindness of all buddhas.”
bo: དེ་བ་ -ས་ གང་ཞིག་ བདེ་གཤེགས་ ཆོས་ འཛིན་པ་ ། ། དེ་ ནི་ སངས་རྒྱས་ ཀུན་ ལ་ བྱས་པ་ གཟོ་ ། །

source: Then the Blessed One asked the great bodhisattva assembly,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ཆེན་པོ་ དེ་ ལ་ བཀའ་ སྩལ་པ་ །

source: “Noble beings, when I pass into nirvāṇa, who among you would like to expound this Dharma discourse and safeguard the awakening of the blessed buddhas in order to ensure the continuity of the holy Dharma?”
bo: སྐྱེས་བུ་ དམ་པ་ དག་ ཁྱེད་ ཀྱི་ ནང་ ནས་ ང་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ ཕྱིན་ དམ་པ་ -འི་ ཆོས་ ཡུན་རིང་ དུ་ གནས་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ རྒྱས་པ་ -ར་ བྱ་བ་ དང་ ། སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ འདི་ ཡོངས་སུ་ བསྲུང་བ་ -ར་ སུ་ སྤྲོ་ །

source: Among the bodhisattva assembly, sixty billion bodhisattvas said with one voice,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ འཁོར་ དེ་ -འི་ ནང་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱེ་བ་ ཕྲག་ དྲུག་ཅུ་ -ས་ མགྲིན་ གཅིག་ ཏུ་ ཚིག་ སྨྲས་པ་ །

source: “Blessed One, we will retain the awakening of the Tathāgata, accomplished within countless eons, and we would like to expound it in future times as well.
bo: བཅོམ་ལྡན་འདས་ བདག་ཅག་ རྣམས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བྱང་ཆུབ་ བསྐལ་པ་ གྲངས་ མ་ མཆིས་པ་ -ར་ བསྒྲུབས་པ་ འདི་ འཛིན་པ་ དང་ ། སླད་མ་ -འི་ ཚེ་ སླད་མ་ -འི་ དུས་ དེ་ ན་ ཡང་ རྒྱས་པ་ -ར་ བགྱིད་པ་ -ར་ སྤྲོའོ་ ། །

source: But, Blessed One, just to be sure, we request the Tathāgata to please bless this Dharma discourse so that, among the many beings who will live at that time, those who have created roots of virtue will come to hear about it.”
bo: བཅོམ་ལྡན་འདས་ འོན་ གྱིས་ ཀྱང་ ཅི་ ནས་ དེ་ -འི་ དུས་ ན་ སྐྱེ་བོ་ མང་པོ་ གནས་པ་ -ར་ འགྱུར་བ་ ། དགེ་བ་ -འི་ རྩ་བ་ བསྐྲུན་པ་ -འི་ སེམས་ཅན་ དེ་དག་ གི་ རྣ་བ་ -ར་ གྲགས་པ་ -ར་ འགྱུར་བ་ -ར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ བྱིན་ གྱིས་ བརླབ་ ཏུ་ གསོལ་ །

source: Then the Blessed One, spoke these verses:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བཀའ་ སྩལ་ ཏོ་ ། །

source: The true speech of the perfect Buddha.
bo: རྫོགས་པ་ -འི་ སངས་རྒྱས་ བདེན་པ་ གསུང་ ། །

source: Since it abides as the true Dharma,
bo: བདེན་པ་ -འི་ ཆོས་ ལ་ རབ་ཏུ་ གནས་ ། །

source: “This sūtra is blessed for the sake of those future beings. It is blessed
bo: བྱིན་ གྱི་ རླབས་ ཀྱིས་ དེ་དག་ ལ་ ། ། མདོ་སྡེ་ འདི་ ནི་ བྱིན་ གྱིས་ བརླབས་ ། །

source: “This sūtra is blessed: Since it is universal love itself, It abides in great love And dons the armor of great compassion.
bo: སྙིང་རྗེ་ ཆེན་པོ་ -འི་ གོ་ཆ་ བགོས་ ། ། བྱམས་པ་ ཆེན་པོ་ -ར་ རབ་ཏུ་ གནས་ ། ། ཀུན་ ལ་ བྱམས་པ་ ཉིད་ ཀྱི་ ཕྱིར་ ། ། མདོ་སྡེ་ འདི་ ནི་ བྱིན་ གྱིས་ བརླབས་ ། །

source: “This sūtra is blessed: It is endowed with all accumulations And emerges through the accumulation of wisdom And the most excellent accumulation of merit.
bo: བསོད་ནམས་ ཚོགས་ ནི་ ཕུན་སུམ་ ཚོགས་ ། ། ཡེ་ཤེས་ ཚོགས་ ཀྱིས་ བྱུང་ གྱུར་པ་ ། ། ཚོགས་ རྣམས་ ཀུན་ དང་ ལྡན་པ་ ཡིས་ ། ། མདོ་སྡེ་ འདི་ ནི་ བྱིན་ གྱིས་ བརླབས་ ། །

source: “This sūtra is blessed: It eradicates all philosophical stances, Tames all those who hold dogmatic views, And conquers all demons for good.
bo: བདུད་ རྣམས་ ཐམས་ཅད་ ངེས་ འཇོམས་ ལ་ ། སྨྲ་བ་ ཐམས་ཅད་ རབ་ འདུལ་ཞིང་ ། ། ལྟ་བ་ ཐམས་ཅད་ རྒྱུན་ གཅོད་པ་ ། ། མདོ་སྡེ་ འདི་ ནི་ བྱིན་ གྱིས་ བརླབས་ ། །

source: “I also bless The protectors of the world, Śakra, And the asuras, the gods, and the demons, As well as the nāgas,
bo: འཇིག་རྟེན་ སྐྱོང་ དང་ བརྒྱ་བྱིན་ དང་ ། ། དེ་བཞིན་ ལྷ་མ་ ཡིན་ རྣམས་ དང་ ། ། ལྷ་ དང་ དྲི་ཟ་ ཀླུ་ དག་ ཀྱང་ ། ། ངས་ ནི་ བྱིན་ གྱིས་ བརླབ་པ་ བྱས་ ། །

source: “The many gods, wherever they are, On the earth as well as in the heavens, So that they will uphold this method By way of the blessings of the buddhas.
bo: ས་ དང་ དེ་བཞིན་ བར་སྣང་ ལ་ ། ། ལྷ་ རྣམས་ མང་པོ་ གང་ འཁོར་བ་ ། ། སངས་རྒྱས་ རྣམས་ ཀྱི་ བྱིན་རླབས་ ཀྱིས་ ། ། ཚུལ་ འདི་ རབ་ཏུ་ འཛིན་པ་ -ར་ འགྱུར་ ། །

source: “This sūtra is blessed With the endowment of the abodes of Brahmā And the adornment of the four noble truths, In order that this assembly may safeguard it.
bo: འཁོར་ འདི་ བསྲུང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ། ། ཚངས་པ་ -འི་ གནས་པ་ རྣམས་ ལྡན་ ཞིང་ ། ། བདེན་པ་ བཞི་ ཡིས་ བརྒྱན་ གྱུར་པ་ ། ། མདོ་སྡེ་ འདི་ ནི་ བྱིན་ གྱིས་ བརླབས་ ། །

source: “It is possible to make space into form,
bo: ནམ་མཁའ་ གཟུགས་ཅན་ བྱེད་ ཀྱང་ སྲིད་ ། །

source: And it is possible to make form formless,
bo: གཟུགས་ ནི་ གཟུགས་ མེད་ བྱེད་ སྲིད་ ཀྱི་ ། །

source: But it is not possible to tamper With what is blessed by the buddhas.”
bo: སངས་རྒྱས་ རྣམས་ ཀྱི་ བྱིན་རླབས་ ནི་ ། ། རྣམ་པ་ -ར་ དཀྲུགས་པ་ -ར་ མི་ ནུས་ སོ་ ། །

source: Thereupon the Catur­mahā­rājas recited this pair of verses, in unison, to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ རྒྱལ་པོ་ ཆེན་པོ་ བཞི་པོ་ དག་ གིས་ མགྲིན་ གཅིག་ ཏུ་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Dear Tathāgata! In order to safeguard this sūtra, We, along with our kin, Pledge to guard it well!
bo: དེ་བཞིན་ གཤེགས་པ་ བདག་ཅག་ རྣམས་ ། ། མདོ་ འདི་ ཀུན་ དུ་ བསྲུང་ སླད་ དུ་ ། ། རྩ་ལག་ དང་ ནི་ བཅས་ རྣམས་ ཀྱིས་ ། ། བསྲུང་བ་ བཟང་པོ་ བགྱི་ བར་ འཚལ་ ། །

source: “Those skilled ones who uphold it With awakened intelligence—
bo: མཁས་པ་ བྱང་ཆུབ་ བློ་གྲོས་ ཀྱིས་ ། ། གང་དག་ འཛིན་པ་ -ར་ བགྱིད་པ་ དག་ །

source: We pledge to constantly safeguard them From the four directions.”
bo: དེ་དག་ ལ་ ནི་ ཕྱོགས་ བཞི་ ནས་ ། ། རྟག་པ་ -ར་ ཀུན་ དུ་ བསྲུང་བ་ བགྱི་ ། །

source: Then Śakra, lord of the gods, recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “I will repay the kindness of the Blessed One.
bo: བདག་ ནི་ བཅོམ་ལྡན་ མཛད་པ་ གཟོ་ ། །

source: He is the guide, the master of the Dharma.
bo: འདྲེན་པ་ ཆོས་ ཀྱི་ དབང་ བདག་ ལགས་ ། །

source: The protector taught that buddhas emerge From this supreme sūtra.
bo: མགོན་པོ་ མདོ་སྡེ་ མཆོག་ འདི་ ལས་ ། ། སངས་རྒྱས་ འབྱུང་བ་ རབ་ཏུ་ བསྟན་ ། །

source: “To repay the kindness of all buddhas, I shall offer my protection.
bo: སངས་རྒྱས་ རྣམས་ ནི་ ཐམས་ཅད་ ཀྱི་ ། ། མཛད་པ་ གཟོ་བ་ བསྲུང་ བགྱིད་ ཅིང་ ། །

source: I wish to safeguard sūtras such as this, And likewise those who uphold them.”
bo: འདི་འདྲ་ -འི་ མདོ་ དང་ དེ་བཞིན་ དུ་ ། ། མདོ་སྡེ་ འཛིན་པ་ བསྲུང་བ་ -ར་ འཚལ་ ། །

source: Then Brahmā, ruler of the universe, recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ མི་མཇེད་ ཀྱི་ བདག་པོ་ ཚངས་པ་ -ས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “The concentrations and the immeasurables, As well as the goals of all the vehicles, Emerge from this Profound and meaningful sūtra.
bo: བསམ་གཏན་ གང་ དང་ ཚད་ མེད་ དང་ ། ། ཐེག་པ་ ཀུན་ གྱིས་ འབྱུང་བ་ གང་ ། ། དེ་དག་ དོན་ལྡན་ ཟབ་མོ་ ཡི་ ། ། མདོ་སྡེ་ འདི་ ལས་ ངེས་པར་ འབྱུང་ ། །

source: “I will set out from the bliss of Brahmā And be present to listen And to provide protection Whenever this method is explained.”
bo: བདག་ ནི་ ཚངས་པ་ -འི་ བདེ་ བོར་ ཏེ་ ། ། གང་ ན་ཚུལ་ འདི་ འཆད་པ་ -ར་ ནི་ ། ། མཉན་པ་ -འི་ སླད་ དང་ དེ་བཞིན་ དུ་ ། ། བསྲུང་བ་ -འི་ སླད་ དུ་ མཆི་བ་ -ར་ བགྱི་ ། །

source: Then Pramodita, the divine being, recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ལྷ་ -འི་ བུ་ རབ་དགའ་ ལྡན་ གྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Those who uphold this sūtra That the Buddha has proclaimed Will be born among the Tuṣita gods In their next life.
bo: གང་ཞིག་ སངས་རྒྱས་ གསུངས་པ་ ཡི་ ། ། མདོ་སྡེ་ འདི་ ནི་ འཛིན་ འགྱུར་བ་ ། ། སྐྱེ་བ་ གཅིག་ གིས་ རབ་གནས་ ནས་ ། ། དགའ་ལྡན་ རྣམས་ སུ་ གནས་པ་ -ར་ འགྱུར་ ། །

source: “O protector! Once I set out From the most excellent divine realm, I should like to abide in Jambudvīpa And teach this method.”
bo: མགོན་པོ་ བདག་ ནི་ ལྷ་ཡུལ་བ་ -འི་ ། ། ཕུན་སུམ་ ཚོགས་པ་ བོར་ ནས་ སུ་ ། ། ཚུལ་ འདི་ རབ་ཏུ་ སྟོན་ བགྱིད་ ཅིང་ ། ། འཛམ་བུ་གླིང་ དུ་ གནས་པ་ -ར་ སྤྲོ་ ། །

source: Then Māraputra recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བདུད་ ཀྱི་ བུ་ དེད་དཔོན་ གྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Those who uphold This meaningful sūtra, Because they have abandoned negative acts, Will not come under the sway of evil,
bo: གང་ཞིག་ གདོན་ དང་ ལྡན་པ་ ཡི་ ། ། མདོ་སྡེ་ འདི་ ནི་ འཛིན་ འགྱུར་བ་ ། ། དེ་དག་ བདུད་ ལས་ འདི་ སྤངས་པ་ -ས་ ། ། བདུད་ ཀྱི་ དབང་ དུ་ མི་ མཆིའོ་ ། །

source: “O Tathāgata! In order to safeguard this sūtra, I shall also dedicate myself And strive to make it flourish by any means.”
bo: དེ་བཞིན་ གཤེགས་པ་ བདག་ ཀྱང་ ནི་ ། ། མདོ་ འདི་ ཀུན་ དུ་ བསྲུང་ སླད་ དུ་ ། ། ཅི་ ནས་ ཀྱང་ ནི་ རྒྱས་ འགྱུར་བ་ -ར་ ། ། བརྩོན་ བགྱིད་ ཅིང་ འདུན་ བར་ བགྱིད་ ། །

source: Then the demon Pāpīyān recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བདུད་ སྡིག་ཅན་ གྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Guide! I shall not obstruct Those who uphold this text, Which eradicates all afflictive emotions.
bo: རྣམ་པ་ -ར་ འདྲེན་པ་ གང་ཞིག་ ནི་ ། ། ཉོན་མོངས་ ཐམས་ཅད་ ཚར་གཅོད་པ་ ། ། འདི་ འཛིན་ བགྱིད་པ་ དེ་དག་ ལ་ ། ། བདག་ ནི་ སྒྲིབ་པ་ -ར་ མི་ བགྱིད་ དོ་ ། །

source: “Wherever this supreme sūtra appears, There will be no chance for evil.
bo: མདོ་སྡེ་ མཆོག་ ནི་ འབྱུང་བ་ དེ་ -ར་ ། ། བདུད་ ཀྱི་ གོ་སྐབས་ མ་ མཆིས་ སོ་ ། །

source: I wish to give protection to those Who recollect the protectors’ speech.”
bo: མགོན་པོ་ -ས་ གསུངས་པ་ དྲན་ བགྱིད་པ་ ། ། དེ་ ལ་ བསྲུང་བ་ བགྱིད་པ་ -ར་ འཚལ་ ། །

source: Then the divine being Prasīmā recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ལྷ་ -འི་ བུ་ མཚམས་ རབ་ ཀྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Whoever upholds this sūtra Pays homage to all buddhas, Since it explains The awakening of all buddhas.
bo: སངས་རྒྱས་ ཀུན་ གྱི་ བྱང་ཆུབ་ ནི་ ། ། མདོ་སྡེ་ འདི་ ལས་ རབ་ བཤད་པ་ -ས་ ། ། གང་ཞིག་ མདོ་སྡེ་ འདི་ འཛིན་པ་ ། ། དེ་ -ས་ ནི་ སངས་རྒྱས་ ཀུན་ ལ་ མཆོད་ ། །

source: “Protector! I shall explain this sūtra To millions of gods.
bo: མགོན་པོ་ བདག་ ནི་ མདོ་སྡེ་ འདི་ ། ། ལྷ་ ནི་ བྱེ་བ་ རྣམས་ ལ་ བཤད་ ། །

source: Whoever listens devotedly Will take hold of awakening.”
bo: གང་དག་ གུས་པ་ -ར་ ཉན་པ་ དག་ ། བྱང་ཆུབ་ ཡང་དག་ འཛིན་ དུ་ སྩལ་ ། །

source: Then, the bodhisattva Maitreya recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱམས་པ་ -ས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “In order to safeguard the holy Dharma, I will likewise praise People who set out for awakening,
bo: མི་གང་ བྱང་ཆུབ་ རབ་ ཞུགས་ ཏེ་ ། ། དམ་ཆོས་ ཡོངས་སུ་ བསྲུང་ སླད་ དུ་ ། ། བདག་ ཀྱང་ སྟོང་ བགྱིད་ དེ་དག་ ནི་ ། །

source: And I will act as their unsolicited spiritual guide.
bo: གསོལ་བ་ མ་ བཏབ་ བཤེས་གཉེན་ ལགས་ ། །

source: “Having resided in Tuṣita, With the Buddha’s blessing I pledge to make this sūtra Flourish widely.”
bo: བདག་ ནི་ དགའ་ལྡན་ མཆིས་ ནས་ སུ་ ། ། སངས་རྒྱས་ ཀྱི་ ནི་ བྱིན་རླབས་ ཀྱིས་ ། ། འདི་ ལྟ་བུ་ ཡི་ མདོ་སྡེ་ འདི་ ། ། ཤིན་ཏུ་ རྒྱས་པ་ -ར་ བགྱིད་པ་ -ར་ འཚལ་ ། །

source: Then the venerable Mahākāśyapa recited this pair of verses to the Blessed One:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ འོད་སྲུང་ ཆེན་པོ་ -ས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ གཉིས་ གསོལ་ ཏོ་ ། །

source: “Even though I have heard Many thousands of sūtras from the Teacher, I have never before heard A sūtra such as this!
bo: སྟོན་པ་ ལས་ ནི་ བདག་ གིས་ སུ་ ། ། མདོ་སྡེ་ སྟོང་ཕྲག་ མང་ཐོས་ ཀྱང་ ། ། བདག་ གིས་ མདོ་སྡེ་ འདི་ ལྟ་བུ་ ། ། སྔོན་ཆད་ ནམ་ཡང་ མ་ ཐོས་ སོ་ ། །

source: “I have directly received And embraced this sūtra.
bo: མངོན་སུམ་ དུ་ ནི་ མདོ་སྡེ་ འདི་ ། ། བླངས་ ཤིང་ཀུན་ དུ་ བཟུང་ ལགས་ ཏེ་ ། །

source: I pledge to make it flourish For the sake of bodhisattvas!”
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཆེད་ དུ་ ནི་ ། ། ཤིན་ཏུ་ རྒྱས་པ་ -ར་ བགྱི་ བར་ འཚལ་ ། །

source: Then the Blessed One voiced his approval to Śakra, Brahmā, and the protectors of the world, to the divine beings, to the bodhisattvas, and to the great śrāvakas:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བརྒྱ་བྱིན་ དང་ ། ཚངས་པ་ དང་ ། འཇིག་རྟེན་ སྐྱོང་བ་ དེ་དག་ དང་ ། ལྷ་ -འི་ བུ་ དེ་དག་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ དང་ ། ཉན་ཐོས་ ཆེན་པོ་ དེ་དག་ ལ་ ལེགས་ སོ་ ཞེས་ བྱ་བ་ གནང་ སྟེ་ །

source: “Excellent, Noble beings! Excellent! Your lion’s roar of proclamation on account of your support for the holy Dharma is excellent.
bo: སྐྱེས་བུ་ དམ་པ་ དག་ ཁྱེད་ ཀྱིས་ དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ བཟུང་བ་ -འི་ ཕྱིར་ འདི་ ལྟ་བུ་ -འི་ སེང་གེ་ -འི་ སྒྲ་ བསྒྲགས་པ་ ལེགས་ སོ་ ལེགས་ སོ་ ། །

source: Noble beings, I instruct you: may you master it!
bo: སྐྱེས་བུ་ དམ་པ་ དག་ ཁྱོད་ ལ་ བསྒོའོ་ ། ། ཁྱོད་ ཀྱིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ ། །

source: Those beings who have embarked on the Great Vehicle, who have not attained acceptance, and who have embraced this Dharma discourse with the blessing of the blessed buddhas who have mastered it and comprehended it—they will not pass beyond the seventh tathāgata until they have received their prophecy of awakening.
bo: སེམས་ཅན་ གང་དག་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཞུགས་པ་ བཟོད་པ་ མ་ ཐོབ་པ་ དེ་དག་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཀུན་ དུ་ བཟུང་ སྟེ་ ། བཟུང་ ནས་ ཀྱང་ ཀུན་ ཆུབ་པ་ -ར་ བྱས་ ནས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་པ་ མ་ ཐོབ་ ཀྱི་ བར་ དུ་ དེ་བཞིན་ གཤེགས་པ་ བདུན་པ་ ལས་ འདའ་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: Those who have become śrāvakas will be included in the first śrāvaka assembly of Maitreya.
bo: གང་དག་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་པ་ -ར་ འགྱུར་བ་ དེ་དག་ ནི་ དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ་ -འི་ ཉན་ཐོས་ འདུས་པ་ དང་པོ་ -འི་ གྲངས་ སུ་ ཆུད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Those who have become pratyekabuddhas and who have mastered this Dharma discourse will, following my own nirvāṇa, attain solitary awakening without learning from others.”
bo: རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་པ་ གང་དག་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ འཛིན་པ་ -ར་ འགྱུར་བ་ དེ་དག་ ནི་ ང་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ འོག་ ཏུ་ གཞན་ ལས་མ་ ཐོས་པ་ -ར་ རང་ བྱང་ཆུབ་ འཐོབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: When the Blessed One had taught this Dharma discourse as requested by Dhāraṇīśvara­rāja, countless beings generated the thought of awakening.
bo: གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ ཡོངས་སུ་ ཞུས་པ་ བསྟན་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བསྟན་པ་ ན་ སེམས་ཅན་ དཔག་ ཏུ་ མེད་པ་ དག་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དོ་ ། །

source: Countless bodhisattvas became established in a state of nonregression.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གྲངས་མེད་པ་ དག་ ནི་ ཕྱིར་ མི་ ལྡོག་པ་ ལ་ རབ་ཏུ་ གནས་ སོ་ ། །

source: Countless world realms trembled six times, were illuminated, and were filled with swirling flower petals.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ དག་ ནི་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་ སོ་ ། ། སྣང་བ་ ཆེན་པོ་ -ས་ ཀྱང་ གསལ་བ་ -ར་ གྱུར་ ཏོ་ ། ། མེ་ཏོག་སིལ་མ་ -ས་ ཀྱང་ གཏོར་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: The bodhisattvas who had gathered from the world realms of the ten directions and had decorated the entire pavilion Jeweled Array with flowers of the seven precious substances as an act of worship to the Blessed One and this Dharma discourse made the following proclamation:
bo: ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ནས་ འདུས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བཅོམ་ལྡན་འདས་ དང་ ། ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱི་ མེ་ཏོག་ གིས་ རྣམ་པ་ -ར་ བཀྲ་བ་ -ར་ བྱས་ ཏེ་ ཆེད་ དུ་ བརྗོད་པ་ འདི་ ཆེད་ དུ་ བརྗོད་ དོ་ ། །

source: “Blessed One, we shall acquire it and acquire it well!
bo: བཅོམ་ལྡན་འདས་ བདག་ཅག་ གིས་ རྙེད་པ་ -ར་ བགྱི་བ་ ལེགས་པ་ -ར་ རྙེད་ དོ་ ། །

source: Because we have heard this exegesis of the Dharma discourse, it was not meaningless for us to be here!
bo: གང་ གི་ སླད་ དུ་ བདག་ཅག་ གིས་ རྣམ་པ་ -ར་ ངེས་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལྟ་བུ་ ཐོས་པ་ -ས་ བདག་ཅག་ འདི་ -ར་ མཆིས་པ་ དོན་ མ་ མཆིས་པ་ མ་ ལགས་སོ་ ། །

source: “O Blessed One! May the life of Śākyamuni be protected!
bo: ཀྱེ་མ་ བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ་ -འི་ སྐུ་ཚེ་ ཡོངས་སུ་ བསྐྱང་ དུ་ གསོལ་ །

source: May this Dharma discourse remain for a long time among the people of Jambudvīpa!
bo: འཛམ་བུ་ -འི་ གླིང་ གི་ མི་ རྣམས་ ལ་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཡུན་རིང་ དུ་ གནས་པ་ -ར་ གྱུར་ཅིག་ །

source: May the lives of those monks, nuns, and male and female lay devotees who uphold this sūtra be guarded for a long time! May it bring benefit to all sentient beings!”
bo: དགེ་སློང་ དང་ ། དགེ་སློང་ མ་ དང་ ། དགེ་བསྙེན་ དང་ ། དགེ་བསྙེན་མ་ གང་དག་ མདོ་སྡེ་ འདི་ ལྟ་བུ་ འཛིན་པ་ དེ་དག་ ཀྱང་ དུས་ རིང་པོ་ -ར་ ཡུན་ དུ་ ཚེ་ ཡོངས་སུ་ སྐྱོང་བ་ -ར་ གྱུར་ཅིག་ ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ ཡང་ ཕན་པ་ བྱེད་པ་ -ར་ གྱུར་ཅིག་ །
