Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Son of noble family, once in past times, during the Stainless eon, in the world Virtuous Occurrence, there appeared a tathāgata, a blessed buddha named Glorious Secret.
bo: རིགས་ ཀྱི་ བུ་ སྔོན་བྱུང་བ་ འདས་པ་ -འི་ དུས་ ན་ ། དྲི་མ་ མེད་པ་ -འི་ བསྐལ་པ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ འབྱུང་བ་ བཟང་པོ་ ན་ ། དེ་བཞིན་ གཤེགས་པ་ དཔལ་ སྦ་ -ས་ ཞེས་ བྱ་བ་ -འི་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཞེས་ བྱ་བ་ -འི་ བར་ དུ་ གྱུར་པ་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ ། །

source: The inhabitants of that world lived with a bliss-filled state of mind.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ འབྱུང་བ་ བཟང་པོ་ དེ་ -འི་ སེམས་ཅན་ རྣམས་ ནི་ བདེ་བ་ -ས་ ཚིམ་པ་ -ས་ གནས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: The Tathāgata’s bodhisattva saṅgha consisted of forty-two thousand bodhisattvas, and his śrāvaka saṅgha comprised eighty-four thousand śrāvakas.
bo: དེ་བཞིན་ གཤེགས་པ་ དཔལ་ སྦ་ -ས་ དེ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ དགེ་འདུན་ ནི་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སྟོང་ཕྲག་ བཞི་ བཅུ་ རྩ་ གཉིས་ སུ་ གྱུར་ ཏོ་ ། ། དེ་ -འི་ ཉན་ཐོས་ ཀྱི་ དགེ་འདུན་ ནི་ ཉན་ཐོས་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ རྩ་ བཞི་ -ར་ གྱུར་ ཏོ་ ། །

source: “Son of noble family, this blessed one apprehended that the eloquence of those bodhisattvas was extensive, and he deliberately posed a large number of questions.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ སྦ་ -ས་ དེ་ -ས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྤོབས་པ་ རྒྱ་ཆེན་པོ་ ཉེ་བར་ བཟུང་ སྟེ་ ། དྲི་བ་ བྱེ་བ་ ཕྲག་ བརྒྱ་ ཆེད་ དུ་ མཛད་ ནས་ །

source: He then inquired, ‘Noble beings, who among you would like to give comprehensive explanations in reply to each and every one of my many questions, at a time of your own choosing?’
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ལ་ བཀའ་ སྩལ་པ་ ། སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ ཀྱི་ ནང་ ནས་ སུ་ དུས་ ཇི་སྲིད་ ཅིག་ ན་ ། དྲི་བ་ བྱེ་བ་ ཕྲག་ བརྒྱ་པོ་ འདི་ དྲི་བ་ རེ་རེ་ ལ་ བསྟན་པ་ བྱེ་བ་ ཕྲག་ བརྒྱ་ བརྒྱ་ -ས་ ལན་ འདེབས་པ་ -ར་ སྤྲོ་ །

source: “One of them said, ‘I shall reply tonight,’
bo: དེ་ -འི་ ནང་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁ་ཅིག་ གིས་ གསོལ་པ་ ། མཚན་མོ་ འདི་ བས་ ཏེ་ ལན་ གདབ་པ་ -ར་ བགྱི་ -འོ་ ། །

source: and another one said, ‘I shall reply in a week.’
bo: ཁ་ཅིག་ གིས་ གསོལ་པ་ ། དགུང་བདུན་ ན་ -འོ་ ། །

source: Another said, ‘I shall reply in a fortnight,’
bo: ཁ་ཅིག་ གིས་ གསོལ་པ་ ། དགུང་ཟླ་ ཕྱེད་ ན་ -འོ་ ། །

source: and yet another said, ‘Blessed One, I shall reply in one month.’
bo: ཁ་ཅིག་ གིས་ གསོལ་པ་ ། བཅོམ་ལྡན་འདས་ དྲིས་པ་ འདི་དག་ བདག་ཅག་ གིས་ དགུང་ཟླ་ གཅིག་ ན་ ལན་ གདབ་པ་ -ར་ བགྱི་ -འོ་ ། །

source: Thereupon, a bodhisattva called Smṛtibuddhi, who was present in the retinue, replied,
bo: དེ་ -འི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲན་པ་ -འི་ བློ་ ཞེས་ བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་ ཏེ་ འདུག་པ་ -ར་ གྱུར་པ་ དེ་ -ས་ ། བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ སྦ་ -ས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: ‘Blessed One, with the Tathāgata’s permission, without further ado, and without rising from my seat, I shall provide answers to the questions.’
bo: བཅོམ་ལྡན་འདས་ བདག་ སྟན་ ལས་མི་ ལྡང་ ཞིང་ ། སྤྱོད་ལམ་ འཁྲུག་པ་ མ་ མཆིས་པ་ -ར་ དེ་བཞིན་ གཤེགས་པ་ དབང་ དུ་ བགྱིས་ ཏེ་ དྲི་བ་ འདི་ བས་པ་ -ར་ ལན་ གདབ་པ་ -ར་ བགྱི་ -འོ་ ། །

source: “As soon as the lion’s roar of this noble being resounded, the entire trichiliocosm trembled six times.
bo: སྐྱེས་བུ་ དམ་པ་ དེ་ -ས་ སེང་གེ་ -འི་ སྒྲ་ བསྒྲགས་ མ་ ཐག་ ཏུ་ ། དེ་ནས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་ སོ་ ། །

source: A great illumination appeared in the world.
bo: སྣང་བ་ ཆེན་པོ་ ཡང་ འཇིག་རྟེན་ དུ་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: Inspired by this light, all kinds of gods gathered, from the celestial gods up to the gods of the pure abodes.
bo: སྣང་བ་ དེ་ -ས་ བསྐུལ་ ནས་ ས་བླ་བ་ -འི་ ལྷ་ ནས་ བཟུང་ སྟེ་ ། གནས་ གཙང་མ་ -འི་ རིས་ ཀྱི་ བར་ གྱི་ ལྷ་ རྣམས་ འདུས་ སོ་ ། །

source: Many thousands of monks and nuns, as well as male and female lay devotees, also congregated. All at once and in a single instant, they were transformed into a single ten-thousand-league maṇḍala retinue.
bo: དགེ་སློང་ དང་ ། དགེ་སློང་ མ་ དང་ ། དགེ་བསྙེན་ དང་ ། དགེ་བསྙེན་མ་ སྟོང་ཕྲག་ མང་པོ་ ཡང་ འདི་ -ར་ འདུས་པ་ -ར་ གྱུར་ ཏོ་ ། ། དེ་ལྟར་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ དཔག་ཚད་ སྟོང་ཕྲག་ བཅུར་ འཁོར་ གྱི་ དཀྱིལ་འཁོར་ གཅིག་ ཏུ་ གནས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “Then, once the bodhisattva had seen this assembly gather, by the power of his own merit, wisdom, mindfulness, dhāraṇī, eloquence, and fearlessness, as well as by the power of the blessing of the buddhas, he fielded all the many well-considered questions that had been asked.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲན་པ་ -འི་ བློ་ -ས་ འཁོར་ འདུས་པ་ ཆེན་པོ་ དེ་ མཐོང་ ནས་ ། རང་ གི་ བསོད་ནམས་ ཀྱི་ སྟོབས་ དང་ ། ཡེ་ཤེས་ ཀྱི་ སྟོབས་ དང་ ། དྲན་པ་ -འི་ སྟོབས་ དང་ ། གཟུངས་ ཀྱི་ སྟོབས་ དང་ ། སྤོབས་པ་ -འི་ སྟོབས་ དང་ ། མི་ འཇིགས་པ་ -འི་ སྟོབས་ དང་ ། སངས་རྒྱས་ ཀྱི་ བྱིན་ གྱི་ རླབས་ དང་ སྟོབས་ ཀྱིས་ དྲི་བ་ ཆེད་ དུ་ མཛད་པ་ བྱེ་བ་ ཕྲག་ བརྒྱ་པོ་ དེ་ ཀུན་ དུ་ བཟུང་ ནས་ །

source: In the presence of that buddha and in front of the entire assembly, he provided countless explanations for each and every one of the many questions.
bo: བཅོམ་ལྡན་འདས་ དེ་ -འི་ སྤྱན་སྔ་ -ར་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ དེ་ -འི་ མདུན་ དུ་ དྲི་བ་ བྱེ་བ་ ཕྲག་ བརྒྱ་པོ་ རེ་རེ་ ལ་ བསྟན་པ་ བྱེ་བ་ ཕྲག་ བརྒྱ་ -ས་ ལན་ བཏབ་ སྟེ་ །

source: He replied fluently, without interruption, coherently, and with the right words, syllables, and etymologies.
bo: ཕྱད་པ་ དང་ ། རྒྱུན་ ཆད་པ་ མེད་པ་ དང་ ། རྗེས་སུ་ ལྡན་པ་ དང་ ། རྗེས་སུ་ འབྲེལ་བ་ དང་ ། ཚིག་ དང་ ཡིག་འབྲུ་ -ར་ ལྡན་པ་ དང་ ། ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ རྣམས་ ཀྱིས་ དེ་ -འི་ ལན་ བཏབ་པ་ དང་ །

source: In that manner, sixty thousand members of the assembly generated the thought of perfect awakening, and forty thousand bodhisattvas attained acceptance of the nonorigination of phenomena.
bo: འཁོར་ དེ་ལས་ སྲོག་ཆགས་ སྟོང་ཕྲག་ དྲུག་ཅུ་ -ས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ སྟོང་ཕྲག་ བཞི་ བཅུ་ ནི་ མི་ སྐྱེ་བ་ -འི་ ཆོས་ ལ་ བཟོད་པ་ རབ་ཏུ་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: The Blessed One expressed his approval of the answers.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ སྦ་ -ས་ དེ་ -ས་ དེ་ ལ་ ལེགས་ སོ་ ཞེས་ བྱ་བ་ བྱིན་ ཏེ་ །

source: The melody carrying the sound of his approval reverberated throughout the entire trichiliocosm.
bo: ལེགས་ སོ་ ཞེས་ བྱ་བ་ -འི་ སྒྲ་ དེ་ -ས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: “All the gods, from the celestial gods up to the gods of the pure abodes, proclaimed, ‘Listen!
bo: ས་བླ་པ་ -འི་ ལྷ་ ནས་ བཟུང་ སྟེ་ ། གནས་ གཙང་མ་ -འི་ རིས་ ཀྱི་ བར་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ ། ཀྱེ་མ་

source: Someone of such insight, eloquence, and skill in teaching will become a bodhisattva called Prajñākūṭa!’
bo: གང་ ཤེས་རབ་ དང་ ། སྤོབས་པ་ དང་ ། བསྟན་པ་ འདི་འདྲ་བ་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ སུ་ འགྱུར་ རོ་ ཞེས་ སྒྲ་ ཕྱུང་ སྟེ་ སྒྲ་ བསྒྲགས་ སོ་ ། །

source: In this way, Prajñākūṭa received the name Prajñākūṭa.
bo: དེ་ལྟར་ ན་ དེ་ ཤེས་རབ་ བརྩེགས་ ཤེས་རབ་ བརྩེགས་ ཞེས་ མིང་ དུ་ བཏགས་ སོ་ ། །

source: “Son of noble family, you may wonder, doubt, or ponder whether the bodhisattva called Smṛtibuddhi was someone else at that time, but you should not.
bo: རིགས་ ཀྱི་ བུ་ དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲན་པ་ -འི་ བློ་ ཞེས་ བྱ་བ་ -ར་ གྱུར་པ་ དེ་ གཞན་ ཡིན་པ་ སྙམ་ དུ་ དོགས་ ཤིང་ ཡིད་གཉིས་ སུ་ གྱུར་ ཏམ་ ། ཐེ་ཚོམ་ ཟ་བ་ ལྟ་ ན་ ཁྱོད་ ཀྱིས་ དེ་ལྟར་ མི་ བལྟ་ -འོ་ ། །

source: Why not?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: It was bodhisattva Prajñākūṭa himself who was the bodhisattva called Smṛtibuddhi at that time!”
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ འདི་ཉིད་ དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲན་པ་ -འི་ བློ་ ཞེས་ བྱ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: At this point, the Blessed One spoke these verses in order to elaborate on this point:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དོན་ འདི་ རྒྱ་ ཆེ་ -ར་ བརྗོད་པ་ -འི་ ཕྱིར་ དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གསུངས་ སོ་ ། །

source: “Listening constantly to teachings not yet heard or sought, Pure beings attain the source of insight.
bo: མ་མོ་ -ས་ གྱུར་ ནས་ མ་ ཐོས་ ཆོས་ རྣམས་ རྟག་ ཉན་པ་ ། ། ཤེས་རབ་ རྩ་བ་ སེམས་ཅན་ དག་པ་ -ས་ ཐོབ་ ནས་ ནི་ ། །

source: Retaining them and teaching beings with love, Bodhisattvas continually perform the function of insight.
bo: འཛིན་ ཅིང་ བྱམས་པ་ -ས་ འགྲོ་བ་ དག་ ལ་ སྟོན་ བྱེད་པ་ ། ། ཤེས་རབ་ ལས་ ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྟག་ ཏུ་ བྱེད་ ། །

source: “Great mindfulness in investigation is a source of insight. Its function is to constantly teach beings on the basis of such investigation.
bo: དཔྱོད་པ་ -འི་ དྲན་པ་ ཆེན་པོ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། ། དཔྱད་ ནས་ འགྲོ་ ལ་ རྟག་ ཏུ་ སྟོན་པ་ ཤེས་རབ་ ལས་ ། །

source: Proper incineration of false views is a source of insight. Its function is to teach based on such engagement.
bo: གལ་ཏེ་ ཚུལ་བཞིན་ རབ་ སྲེག་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། ། དེ་ ལ་ སྦྱར་ ནས་ སྟོན་པ་ ཤེས་རབ་ ལས་ ཞེས་ བྱ་ ། །

source: “Correct application is a source of insight.
bo: ཡང་དག་ སྦྱོར་ ལ་ གལ་ཏེ་ སྦྱོར་བ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to yield accomplishments and teachings.
bo: སྒྲུབ་ ཅིང་ སྟོན་པ་ -ར་ བྱེད་པ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Finding mental certainty regarding the mind is a source of insight.
bo: སེམས་ ལ་ ངེས་པར་ སེམས་ རྙེད་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to act upon this certainty.
bo: ངེས་པར་ སེམས་པ་ སྤྱོད་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Practicing alone in solitude is a source of insight.
bo: གཅིག་པུ་ དབེན་པ་ -ར་ སྤྱོད་པ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to be without an I in body or mind.
bo: ལུས་ དང་སེམས་ ལ་ ང་ -འི་ མེད་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Being wary of hustle and bustle is a source of insight.
bo: གང་ ཚེ་ འདུ་འཛི་ -འི་ འཇིགས་ གྱུར་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to raise awareness regarding the path traversed alone.
bo: གཅིག་པུ་ བགྲོད་པ་ -འི་ ལམ་ ལ་ རིག་བྱེད་ ཤེས་རབ་ ལས་ ། །

source: “Delighting in tranquil abiding and special insight is a source of insight.
bo: ཞི་གནས་ ལྷག་མཐོང་ དགའ་བ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to get in touch with awareness and liberation.
bo: རིག་ དང་ རྣམ་པ་ -ར་ གྲོལ་ ལ་ རེག་ འདི་ ཤེས་རབ་ ལས་ ། །

source: Pursuing the three liberations is a source of insight.
bo: རྣམ་ཐར་ གསུམ་ ལ་ མངོན་པར་ བརྩོན་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to manifest threefold awareness.
bo: རིག་ གསུམ་ མངོན་དུ་ བྱེད་པ་ ཤེས་རབ་ ལས་ ཞེས་ བྱ་ ། །

source: “Cultivating the application of mindfulness is a source of insight.
bo: གལ་ཏེ་ དྲན་པ་ ཉེར་ གཞག་ སྒོམ་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to be without mindfulness and without and mental activity.
bo: དྲན་མེད་ ཡིད་ ལ་ བྱེད་ མེད་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Abandoning evil and practicing virtue are sources of insight.
bo: སྡིག་པ་ སྤངས་ ཏེ་ དགེ་བ་ སྤྱོད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Their function is to naturally abandon these factors.
bo: ཆོས་ འདི་རང་ བཞིན་ སྤངས་པ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Cultivating the four bases of miraculous powers is a source of insight.
bo: གལ་ཏེ་ རྫུ་འཕྲུལ་ རྐང་པ་ བཞི་ སྒོམ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to spontaneously attain miraculous power.
bo: ལྷུན་གྲུབ་ རྫུ་འཕྲུལ་ ཐོབ་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Confidence with faithful devotion is a source of insight.
bo: དད་པ་ -ས་ མོས་ ནས་ ཡིད་ཆེས་པ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to be free of any attachments whatsoever.
bo: ཆགས་པ་ ཐམས་ཅད་ གང་ བྲལ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Striving constantly and without growing fainthearted is a source of insight.
bo: ཞུམ་ མེད་ རྟག་ ཏུ་ བརྩོན་པ་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to be well trained in body and mind.
bo: ལུས་ དང་ ཡིད་ སེམས་ རབ་ སྦྱངས་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Mastery in mindfulness and introspection is a source of insight.
bo: དྲན་ དང་ ཤེས་བཞིན་ མཁས་པ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is not to fixate on any point.
bo: གནས་ རྣམས་ ཀུན་ ལ་ མི་ གནས་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Realizing meditative absorption by oneself is a source of insight.
bo: རང་ གིས་ ཏིང་འཛིན་ རྟོགས་པ་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to progress naturally in equipoise.
bo: རང་བཞིན་ མཉམ་པ་ -ར་ བཞག་ ལ་ སྤྱོད་ འདི་ ཤེས་རབ་ ལས་ ། །

source: Being well established in the faculty of insight is a source of insight.
bo: གལ་ཏེ་ ཤེས་རབ་ དབང་པོ་ -ར་ རབ་གནས་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to know all the faculties of beings.
bo: འགྲོ་བ་ -འི་ དབང་པོ་ ཐམས་ཅད་ ཤེས་པ་ ཤེས་རབ་ ལས་ ། །

source: “Cultivating the five strengths is a source of insight.
bo: སྟོབས་ ལྔ་པོ་ དག་ རྗེས་སུ་ སྒོམ་པ་ ཤེས་རབ་ རྩ་ ། ། བཅོམ་ ནས་

source: Its function is to attain wisdom following such victory.
bo: ཡེ་ཤེས་ ཐོབ་པ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Harmoniously accepting the factors of awakening is a source of insight.
bo: བྱང་ཆུབ་ ཡན་ལག་ རྗེས་ འཐུན་ བཟོད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to gain realization that accords with all phenomena.
bo: ཆོས་ ཀུན་ རྗེས་སུ་ གང་ རྟོགས་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Practicing the branches of the path in this birth is a source of insight.
bo: ལམ་ གྱི་ ཡན་ལག་ སྐྱེ་གནས་ སྒྲུབ་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to leave behind both Dharma and non-Dharma.
bo: ཆོས་ དང་ ཆོས་ མིན་ སྤོང་བ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Being skilled in the nature of suffering is a source of insight.
bo: སྡུག་བསྔལ་ རང་བཞིན་ མཁས་པ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to actualize cessation.
bo: གལ་ཏེ་ འགོག་པ་ མངོན་སུམ་ བྱེད་ འདི་ ཤེས་རབ་ ལས་ ། །

source: “Retaining the words of the provisional sūtras is a source of insight.
bo: དྲང་བ་ -འི་ དོན་ གྱི་ མདོ་སྡེ་ ཚིག་ འཛིན་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to rely on the definitive meaning.
bo: ངེས་པ་ -འི་ དོན་ ལ་ རྟོན་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Not being content with what one has learned is a source of insight.
bo: ཐམས་ཅད་ ཐོས་པ་ -ས་ མི་ ངོམས་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to rely on the meaning.
bo: དོན་ ལ་ རབ་ཏུ་ རྟོན་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Investigating consciousness is a source of insight.
bo: རྣམ་པ་ -ར་ ཤེས་ ལ་ ཚུལ་བཞིན་ ཚོལ་ བ་ཤེ་ -ས་ རབ་ རྩ་ ། །

source: Its function is to rely on wisdom.
bo: ཡེ་ཤེས་ ལ་ ནི་ རབ་ཏུ་ རྟོན་ འདི་ ཤེས་རབ་ ལས་ ། །

source: Not clinging to any individual is a source of insight.
bo: གང་ཟག་ གང་ ལ་ -འང་ མ་ ཞེན་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to rely on the nature of reality.
bo: གལ་ཏེ་ ཆོས་ཉིད་ རྟོན་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Scrutinizing karmic formations as impermanent is a source of insight.
bo: འདུ་བྱེད་ མི་རྟག་ ཡོངས་སུ་ ཚོལ་ བ་ཤེ་ -ས་ རབ་ རྩ་ ། །

source: Its function is to know they are originally unborn.
bo: གལ་ཏེ་ གཟོད་ ནས་ མ་ སྐྱེས་ ཤེས་པ་ ཤེས་རབ་ ལས་ ། །

source: Attending to formations as painful is a source of insight.
bo: འདུ་བྱེད་ སྡུག་བསྔལ་ མོས་པ་ -ར་ བྱེད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attend to phenomena as being unconditioned.
bo: ཆོས་ རྣམས་ འདུས་མ་བྱས་ སུ་ མོས་པ་ ཤེས་རབ་ ལས་ ། །

source: “Having no doubt that all phenomena are without self is a source of insight.
bo: ཆོས་ རྣམས་ བདག་མེད་ ཐེ་ཚོམ་ མེད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to know the primordial purity of beings.
bo: སེམས་ཅན་ འདི་དག་ གདོད་ ནས་ དག་ དེ་ ཤེས་རབ་ ལས་ ། །

source: Appreciating that nirvāṇa is peace is a source of insight.
bo: མྱ་ངན་ འདས་ ལ་ ཞི་བ་ -ར་ མོས་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to know that beings are nirvāṇa.
bo: འགྲོ་བ་ ཤིན་ཏུ་ མྱ་ངན་ འདས་ འདི་ ཤེས་རབ་ ལས་ ། །

source: “Realization that accords with truth is a source of insight.
bo: དོན་ གྱི་ རྗེས་སུ་ རྟོགས་པ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to have special awareness of the truth.
bo: དོན་ རྟོགས་ སོ་སོ་ ཡང་དག་ རིག་པ་ ཤེས་རབ་ ལས་ ། །

source: Gaining appreciation of the nature of reality is a source of insight.
bo: གལ་ཏེ་ ཆོས་ཉིད་ མོས་པ་ -ར་ བྱེད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to have special awareness of phenomena.
bo: ཆོས་ ལ་སོ་ སོ་ ཡང་དག་ རིག་པ་ ཤེས་རབ་ ལས་ ། །

source: “Being unintimidated by any words is a source of insight.
bo: སྒྲ་ རྣམས་ ཀུན་ ལ་ སྐྲག་པ་ མེད་ འདི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to have special awareness of etymologies.
bo: ངེས་ཚིག་ སོ་སོ་ ཡང་དག་ རིག་ འདི་ ཤེས་རབ་ ལས་ ། །

source: Being unintimidated by eloquence is a source of insight.
bo: སྐྲག་ མེད་ བློ་ ཡིས་ སྤོབས་པ་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to have special awareness of eloquence.
bo: སྤོབས་པ་ སོ་སོ་ ཡང་དག་ རིག་པ་ ཤེས་རབ་ ལས་ ། །

source: “Feeling abiding love for beings is a source of insight.
bo: གལ་ཏེ་ སེམས་ཅན་ གནས་པ་ -འི་ བྱམས་ དེ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attain nonreferential love.
bo: དམིགས་པ་ མེད་པ་ -འི་ བྱམས་ ཐོབ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Feeling compassion for self and others is a source of insight.
bo: བདག་ དང་ གཞན་ ལ་ སྙིང་རྗེ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is not to conceive of either.
bo: གང་ གིས་ གཉི་ག་ -ར་ མི་ རྟོག་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Delighting in supreme joy is a source of insight.
bo: མཆོག་ ཏུ་ དགའ་ ལ་ དགའ་བ་ ཐོབ་ འདི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is not to feel joy or anguish.
bo: དགའ་ མེད་ གདུང་བ་ མེད་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Being neither desirous nor harmful in conduct is a source of insight.
bo: བྱམས་ དང་ གནོད་པ་ -ར་ མི་ བྱེད་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attain mental release from duality.
bo: གཉིས་ ལས་ སེམས་ གྲོལ་ ཐོབ་པ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Recollecting the wise Buddha is a source of insight.
bo: བློ་གྲོས་ ལྡན་པ་ སངས་རྒྱས་ དྲན་ འདི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to realize dharmakāya.
bo: གང་ ཚེ་ ཆོས་སྐུ་ རྗེས་སུ་ རྟོགས་པ་ ཤེས་རབ་ ལས་ ། །

source: Constantly recollecting the Dharma is a source of insight.
bo: ཆོས་ ཀྱང་ རྟག་ ཏུ་ དྲན་པ་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to realize the nature of reality without any attachment.
bo: ཆོས་ རྣམས་ འདོད་ཆགས་ བྲལ་བ་ -ར་ རྟོགས་པ་ ཤེས་རབ་ ལས་ ། །

source: “Recollecting the Saṅgha in terms of its qualities is a source of insight.
bo: ཡོན་ཏན་ ལས་ ནི་ དགེ་འདུན་ དྲན་ དེ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to realize it as it as unconditioned.
bo: དེ་ཡང་ འདུས་མ་བྱས་ སུ་ རྟོགས་པ་ ཤེས་རབ་ ལས་ ། །

source: Recollecting wise generosity is a source of insight.
bo: བློ་ལྡན་ གཏོང་བ་ དྲན་པ་ དེ་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to let go of all afflictive emotions.
bo: གང་ ཕྱིར་ ཉོན་མོངས་ ཀུན་ འདོར་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Recollecting pure moral conduct is a source of insight.
bo: ཚུལ་ཁྲིམས་ ཤིན་ཏུ་ དག་པ་ དྲན་ འདི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to abide in unsullied moral conduct.
bo: ཚུལ་ཁྲིམས་ ཟག་པ་ མེད་ ལ་ གནས་ ནི་ ཤེས་རབ་ ལས་ ། །

source: Recollecting the gods, the great beings, is a source of insight.
bo: ཆེ་བ་ -འི་ བདག་ཉིད་ ལྷ་ དྲན་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to recollect the purest of the pure.
bo: དག་ ནས་ དག་པ་ དྲན་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Scrutinizing what has been learned with focused attention is a source of insight.
bo: གང་ ཕྱིར་ བསྒྲིམས་ ཏེ་ ཐོས་པ་ ཚོལ་ བ་ཤེ་ -ས་ རབ་ རྩ་ ། །

source: Its function is not to scrutinize later what has come from others.
bo: གཞན་དག་ ལས་ ནི་ ཕྱིས་ མི་ ཚོལ་ བ་ཤེ་ -ས་ རབ་ ལས་ ། །

source: Performing virtuous actions is a source of insight.
bo: ལེགས་པ་ -ར་ བྱེད་པ་ -འི་ ལས་ བྱེད་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to know that actions do not manifest later.
bo: ལས་ ཕྱིས་ མངོན་པར་ འདུ་ མི་ བྱེད་པ་ ཤེས་རབ་ ལས་ ། །

source: “Acting respectfully without pride is a source of insight.
bo: ང་རྒྱལ་ མེད་ ཅིང་ འདུད་པ་ -ར་ བྱེད་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attain the nature of great wisdom.
bo: ཡེ་ཤེས་ ཆེ་བ་ -འི་ བདག་ཉིད་ ཐོབ་ འདི་ ཤེས་རབ་ ལས་ ། །

source: Striving for one’s own benefit is a source of insight.
bo: བདག་ གི་ དོན་ ལ་ བརྩོན་ འགྱུར་ འདི་ ནི་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to act for the benefit of sentient beings.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ དོན་ བྱེད་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Upholding the collections of the Dharma is a source of insight.
bo: གལ་ཏེ་ ཆོས་ ཀྱི་ ཕུང་པོ་ འཛིན་བྱེད་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to foster understanding regarding the behavior of beings.
bo: སེམས་ཅན་ སྤྱོད་པ་ རྗེས་སུ་ རྟོགས་ བྱེད་ ཤེས་རབ་ ལས་ ། །

source: Fostering spiritual attainment in the minds of others is a source of insight.
bo: གཞན་ གྱི་ བློ་ ལ་ ཡང་དག་ ཐོབ་བྱེད་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to bring them to deliverance through the three vehicles.
bo: སེམས་ཅན་ ཐེག་ གསུམ་ ངེས་འབྱུང་ བྱེད་པ་ ཤེས་རབ་ ལས་ ། །

source: “For wise ones to mature beings by generosity,
bo: བློ་གྲོས་ ལྡན་པ་ སྦྱིན་ དང་ སྙན་པ་ -ར་ སྨྲ་བ་ དང་ ། །

source: Speaking pleasantly, and working for their benefit is a source of insight.
bo: དོན་ བྱེད་ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་ བྱེད་ ཤེས་རབ་ རྩ་ ། །

source: Its function is for noble beings to display buddha qualities
bo: གལ་ཏེ་ དོན་ འཐུན་པ་ ཡིས་ སངས་རྒྱས་ ཡོན་ཏན་ འགོད་ ། །

source: Through alignment with beings’ aims.
bo: འདི་ ནི་ སྐྱེས་བུ་ དམ་པ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ལས་ ། །

source: “Being intimidated by the knowledge that existence is an inferno is a source of insight.
bo: སྲིད་པ་ ཀུན་ དུ་ འབར་ ཤེས་ སྐྲག་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attain acceptance of the unoriginated.
bo: མི་ སྐྱེ་ བཟོད་པ་ ཐོབ་པ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: The level of nonregression is a source of insight.
bo: ཕྱིར་ མི་ ལྡོག་པ་ -འི་ ས་ འདི་ ཤེས་རབ་ རྩ་བ་ སྟེ་ ། །

source: Its function is to attain the level of empowerment.
bo: དབང་ བསྐུར་ དེ་ ཡི་ ས་ ཐོབ་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Standing in front of the tree of awakening is a source of insight.
bo: གལ་ཏེ་ བྱང་ཆུབ་ ཤིང་ དྲུང་ འདུག་པ་ ཤེས་རབ་ རྩ་ ། །

source: Its function is to attain omniscient wisdom.
bo: ཀུན་མཁྱེན་ ཡེ་ཤེས་ རེག་པ་ འདི་ ནི་ ཤེས་རབ་ ལས་ ། །

source: The so-called thought of awakening is itself known to be a source of insight.
bo: བྱང་ཆུབ་ སེམས་ འདི་ ཤེས་རབ་ རྩ་བ་ ཞེས་ ཀྱང་ བྱ་ ། །

source: Its function is to bring about whatever one sets one’s mind to.
bo: སེམས་ ནི་ གནས་ སུ་ གང་ བྱེད་ དེ་ ནི་ ཤེས་རབ་ ལས་ ། །

source: “Those who are unwavering and abide constantly in the thought of awakening
bo: གང་དག་ བྱང་ཆུབ་ སེམས་ ལ་ རྟག་ གནས་ མི་གཡོ་བ་ ། །

source: Consistently perform the function of insight.
bo: དེ་དག་ ཤེས་རབ་ ཀྱིས་ ནི་ རྟག་ ཏུ་ ལས་ བྱ་ བྱེད་ ། །

source: Were one to praise such a source—the supreme thought of awakened conduct, Buddha strengths, and discriminating knowledge— For many thousands of eons, One would never reach the end of buddha qualities.
bo: རྩ་བ་ འདི་འདྲ་ བྱང་ཆུབ་ སྤྱོད་པ་ མཆོག་ གི་ སེམས་ ། ། སངས་རྒྱས་ སྟོབས་ དང་ དེ་བཞིན་ སོ་སོ་ ཡང་དག་ རིག་ ། དེ་ ཡི་ བསྔགས་པ་ བསྐལ་པ་ བྱེ་བ་ མང་ བརྗོད་ ཀྱང་ ། ། སངས་རྒྱས་ ཡོན་ཏན་ མཐའ་མ་ -ར་ ཐུག་པ་ -ར་ འགྱུར་བ་ མེད་ ། །

source: “Sugatas of the past, as well as the present
bo: གང་དག་ འདས་པ་ -འི་ བདེ་གཤེགས་ དེ་བཞིན་ ད་ལྟར་ བྱུང་ ། །

source: And the future, along with the capable ones of the ten directions— Those who wish to perform immeasurable service to these immeasurable beings Take a sober delight in the thought of awakening.”
bo: གང་དག་ མ་འོངས་པ་ དང་ ཕྱོགས་ བཅུ་ -འི་ ཐུབ་དབང་པོ་ ། ། ཚད་ མེད་པ་ ལ་ བསྙེན་བཀུར་ ཚད་ མེད་ བྱེད་ འདོད་ གང་ ། ། དེ་ ནི་ མ་ མྱོས་ བྱང་ཆུབ་ སེམས་ ལ་ དགའ་བ་ ཡིན་ ། །

source: Thereupon, the bodhisattva Dhāraṇīśvara­rāja said,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Alas, Blessed One! The full extent of this unsurpassed complete and perfect awakening of the blessed buddhas has been precisely ascertained.
bo: བཅོམ་ལྡན་འདས་ ། ཀྱེ་མ་ ཇི་ཙམ་ དུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ འདི་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ ངེས་ ཤིང་ །

source: What is taught by way of words is infinite, and what is accessed by way of meanings is infinite, yet it is difficult to access by those who are not diligent.
bo: ཡི་གེ་ རྣམས་ ཀྱིས་ བསྟན་པ་ མཐའ་ཡས་པ་ ། དོན་ གྱིས་ འཇུག་པ་ མཐའ་ཡས་པ་ ། མི་ བརྩོན་པ་ རྣམས་ ཀྱིས་ འཇུག་པ་ -ར་ དཀའ་བ་ །

source: It is profound since it is realized in accordance with dependent arising.
bo: རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ རྗེས་སུ་ རྟོགས་པ་ -ས་ ཟབ་པ་ །

source: It is difficult to fathom by those who engage in duality.
bo: གཉིས་ ལ་ སྤྱོད་པ་ རྣམས་ ཀྱིས་ འཚལ་བ་ -ར་ དཀའ་བ་ །
