Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: It is stainless, immaculate, and unambiguous.
bo: དྲི་མ་ མེད་པ་ -འོ་ ། ། དྲི་མ་ དང་ བྲལ་བ་ -འོ་ ། ། རྨོངས་པ་ མེད་པ་ -འོ་ ། །

source: It is intelligible, unimpeded, and liberating.
bo: ཤིན་ཏུ་ ཟུར་ ཕྱིན་པ་ -འོ་ ། ། ཆགས་པ་ མེད་པ་ -འོ་ ། ། རབ་ཏུ་ གྲོལ་བ་ -འོ་ ། །

source: It is illuminating and straightforward.
bo: འོད་གསལ་བ་ -འོ་ ། ། དྲང་བ་ -འོ་ ། །

source: It is not inferior, disordered, or stammering.
bo: མི་ དམན་པ་ -འོ་ ། ། མ་ འཛིངས་པ་ -འོ་ ། ། དིབ་ དིབ་པོ་ མ་ཡིན་པ་ -འོ་ ། །

source: It generates bliss, physical well being, and mental delight.
bo: བདེ་བ་ སྐྱེད་པ་ -འོ་ ། ། ལུས་ ཚིམ་པ་ -ར་ བྱེད་པ་ -འོ་ ། ། སེམས་ དགའ་བ་ སྐྱེད་པ་ -འོ་ ། །

source: It pacifies attachment, subdues aversion, and dispels delusion.
bo: འདོད་ཆགས་ ཞི་བ་ -ར་ བྱེད་པ་ -འོ་ ། ། ཞེ་སྡང་ འདུལ་བ་ -འོ་ ། ། གཏི་མུག་ སེལ་བ་ -འོ་ ། །

source: It overcomes demons, eliminates evil, and subjugates opponents.
bo: བདུད་ འཇོམས་པ་ -འོ་ ། ། སྡིག་པ་ སེལ་བ་ -འོ་ ། ། རྒོལ་བ་ འདུལ་བ་ -འོ་ ། །

source: It generates consciousness.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: It sounds like a drum.
bo: རྔ་ -འི་ སྒྲ་ -འོ་ ། །

source: It delights the wise.
bo: མཁས་པ་ དགའ་བ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: It sings like a kalaviṅka bird, Śakra, and Brahmā.
bo: ཀ་ལ་པིང་ཀ་ -འི་ སྒྲ་དབྱངས་ སོ་ ། ། བརྒྱ་བྱིན་ གྱི་ སྒྲ་ -འོ་ ། ། ཚངས་པ་ -འི་ སྒྲ་ -འོ་ ། །

source: It sounds like ocean waves and thunder.
bo: རྒྱ་མཚོ་ -འི་ རླབས་ ཀྱི་ སྒྲ་ -འོ་ ། ། སྤྲིན་ གྱི་ སྒྲ་ -འོ་ ། །

source: It resonates like the earth.
bo: ས་ -འི་ སྒྲ་དབྱངས་ སོ་ ། །

source: It sounds like a crane, like the calls of a peacock and a cuckoo.
bo: ཁྲུང་ ཁྲུང་ གི་ སྒྲ་ -འོ་ ། ། རྨ་བྱ་ -འི་ སྒྲ་ སྐད་ དོ་ ། ། ཁུ་བྱུག་ གི་ སྒྲ་ -འོ་ ། །

source: It sounds like the jīvañjīvaka bird, like the king of geese, and like the king of beasts.
bo: ཤང་ཤང་ཏེའུ་ -འི་ སྒྲ་ -འོ་ ། ། ངང་པ་ -འི་ རྒྱལ་པོ་ -འི་ སྒྲ་ -འོ་ ། ། རི་ དགའ་ -ས་ ཀྱི་ རྒྱལ་པོ་ -འི་ སྒྲ་ -འོ་ ། །

source: It sounds like a vīṇā, the three-stringed vīṇā, and drums.
bo: པི་ བང་ དང་ ། པི་ བང་ རྒྱུད་ གསུམ་པ་ དང་ ། ཁ་ -ར་ རྔ་ དང་ །

source: It sounds like a flute, a conch, and cymbals.
bo: གླིང་བུ་ དང་ ། དུང་ དང་ ། སིལ་སྙན་ གྱི་ སྒྲ་ -འོ་ ། །

source: It is informative, instructive, and lucid.
bo: ཀུན་ཤེས་པ་ -ར་ བྱ་བ་ -འོ་ ། ། རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ -འོ་ ། ། གསལ་བ་ -འོ་ ། །

source: It is charming, worth listening to, and profound.
bo: ཡིད་ དུ་ འོང་བ་ -འོ་ ། ། མཉན་པ་ -ར་ འོས་པ་ -འོ་ ། ། ཟབ་པ་ -འོ་ ། །

source: It is not false.
bo: བརྫུན་པ་ མ་ཡིན་པ་ -འོ་ ། །

source: It is melodious and generates roots of virtue.
bo: རྣ་བ་ བདེ་བ་ -ར་ བྱེད་པ་ -འོ་ ། ། དགེ་བ་ -འི་ རྩ་བ་ སྐྱེད་པ་ -འོ་ ། །

source: Its words and expressions are not degenerate but clearly defined.
bo: ཚིག་ དང་ ཡི་གེ་ ཉམས་པ་ མེད་པ་ -འོ་ ། ། ཚིག་ དང་ ཡི་གེ་ ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ གོ་ ། །

source: It is meaningful and endowed with Dharma.
bo: དོན་ དང་ ལྡན་པ་ -འོ་ ། ། ཆོས་ དང་ ལྡན་པ་ -འོ་ ། །

source: It is timely, always relevant, and appropriate.
bo: དུས་ དང་ ལྡན་པ་ -འོ་ ། ། དུས་ཚིགས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འོ་ ། ། དུས་ ལས་མི་ གཡོ་བ་ -འོ་ ། །

source: “The tathāgatas teach while knowing whose faculties are excellent and whose are not.
bo: དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ ཤེས་པ་ སྟོན་པ་ -འོ་ ། །

source: Their speech is embellished by generosity, purified by moral conduct, correctly accomplished through patience, made pliant through vigor, made flexible through concentration, and investigated with insight.
bo: སྦྱིན་པ་ -ས་ བརྒྱན་པ་ -འོ་ ། ། ཚུལ་ཁྲིམས་ ཀྱིས་ རྣམ་པ་ -ར་ དག་པ་ -འོ་ ། ། བཟོད་པ་ -ས་ ཡང་དག་པ་ -ར་ བསྒྲུབས་པ་ -འོ་ ། ། བརྩོན་འགྲུས་ ཀྱིས་ ཤིན་ཏུ་ སྦྱངས་པ་ -འོ་ ། ། བསམ་གཏན་ གྱིས་ ལས་ སུ་ རུང་བ་ -ར་ བྱས་པ་ -འོ་ ། ། ཤེས་རབ་ ཀྱིས་ ངེས་པར་ བཏགས་པ་ -འོ་ ། །

source: It is taken up with love and undiscouraged because of compassion.
bo: བྱམས་པ་ -ས་ ཤིན་ཏུ་ བརྩམས་པ་ -འོ་ ། ། སྙིང་རྗེ་ -ས་ སྐྱོ་བ་ མེད་པ་ -འོ་ ། །

source: It is joyful and radiant.
bo: རབ་ཏུ་ དགའ་བ་ -འོ་ ། ། འོད་གསལ་བ་ -འོ་ ། །

source: It discerns with equanimity.
bo: བཏང་སྙོམས་ ཀྱིས་ ངེས་པར་ བརྟག་པ་ -འོ་ ། །

source: It establishes the three vehicles.
bo: ཐེག་པ་ གསུམ་ རྣམ་པ་ -ར་ འཇོག་པ་ -འོ་ ། །

source: It is the unbroken lineage of the Three Jewels.
bo: དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ -འོ་ ། །

source: It differentiates the three groups.
bo: ཕུང་པོ་ གསུམ་ རྣམ་པ་ -ར་ འབྱེད་པ་ -འོ་ ། །

source: It trains through the three gates of liberation.
bo: རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་གསུམ་ གྱིས་ རྣམ་པ་ -ར་ སྦྱངས་པ་ -འོ་ ། །

source: It is entirely suffused by the truth and wisdom.
bo: བདེན་པ་ -ས་ ཡོངས་སུ་ བསྒོས་པ་ -འོ་ ། ། ཡེ་ཤེས་ ཀྱིས་ ཡོངས་སུ་ བསྒོས་པ་ -འོ་ ། །

source: It is not criticized by the wise but praised by the noble ones.
bo: མཁས་པ་ -ས་ མ་སྨད་པ་ -འོ་ ། ། འཕགས་པ་ -ས་ བསྔགས་པ་ -འོ་ ། །

source: It reaches to the limits of space and is supreme in all respects.
bo: ནམ་མཁའ་ -འི་ ཚད་ ཀྱི་ རྗེས་སུ་ འགྲོ་བ་ -འོ་ ། ། རྣམ་པ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ དང་ ལྡན་པ་ -འོ་ ། །

source: Son of noble family, the speech of the tathāgatas is like that.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ངག་ ནི་ དེ་ལྟ་ བུ་ སྟེ་ །

source: That is why all verbal activities of the tathāgatas are said to be preceded and accompanied by wisdom.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ངག་གི་ལས་ ཐམས་ཅད་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་ ཞིང་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: This is the twenty-eighth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ བརྒྱད་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Their incomparable speech is lucid and stainless with all its splendid qualities.
bo: མཚུངས་པ་ མེད་པ་ -འི་ ངག་ ནི་ གསལ་ ཞིང་ དྲི་མེད་ ཡོན་ཏན་ ཀུན་ གྱིས་ འཕགས་ ། །

source: It radiates throughout a thousand fields, and from a single act of speech many discourses resound.
bo: ཞིང་ སྟོང་ རྒྱས་པ་ -ར་ འགེངས་ ཤིང་ སྐད་ཅིག་ ལས་ ཀྱང་ སྐད་ རྣམས་ ཀུན་ གྲག་ སྟེ་ ། །

source: Some people hear the Śrāvaka Vehicle and others the Pratyekabuddha Vehicle.
bo: སེམས་ཅན་ ཁ་ཅིག་ ཉན་ཐོས་ ཐེག་ དང་ དེ་བཞིན་ རང་རྒྱལ་ ཐེག་པ་ ཐོས་ ། །

source: According to what they have heard, the buddhas, the great beings, Guide their minds toward the corresponding awakening.
bo: ཐོས་ ནས་ སངས་རྒྱས་ བདག་ཉིད་ ཆེན་པོ་ -ས་ དེ་བཞིན་ བྱང་ཆུབ་ འདི་ -ར་ ཡིད་ འཛུད་ ། །

source: “ ‘Their terminology is neither disjointed nor contradictory.
bo: ཡི་གེ་ རྣམས་ ནི་ མཚམས་ སྦྱོར་ མ་ ཡིན་ ཕན་ཚུན་ འགལ་བ་ -ར་ འགྱུར་བ་ -འང་ མིན་ ། །

source: They teach the Dharma without any concepts in their minds.
bo: དེ་ལྟར་ ཆོས་ རབ་ སྟོན་ ཀྱང་ སེམས་ ནི་ རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ འགྱུར་བ་ མེད་ ། །

source: Like an echo, which resounds exactly and effortlessly,
bo: ཇི་ལྟར་ བྲག་ཅ་ གཡོ་བ་ མེད་ ཅིང་ བྱེད་པ་ མེད་པ་ -ར་ སྒྲ་སྒྲོག་པ་ ། །

source: The speech of noble beings resonates and satisfies ordinary beings.’
bo: དེ་ལྟར་ མི་ ཡི་དམ་པ་ སྒྲ་ རྣམས་ སྒྲོག་ ཅིང་ སེམས་ཅན་ ཚིམ་པ་ -ར་ བྱེད་ ། །

source: “Son of noble family, furthermore, the entire range of the tathāgatas’ mental activity is preceded and accompanied by wisdom.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡིད་ ཀྱི་ ལས་ ཐམས་ཅད་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་ ཞིང་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The tathāgatas are inexpressible in terms of mind, mental activity, or consciousness.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ། ཡིད་ ཀྱིས་ མ་ ཡིན་ ། རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ མ་ ཡིན་ གྱི་ དེ་བཞིན་ གཤེགས་པ་ ནི་

source: They are distinguished by wisdom.
bo: ཡེ་ཤེས་ ཀྱིས་ རབ་ཏུ་ ཕྱེ་བ་ སྟེ་ །

source: They are the sovereigns of wisdom.
bo: ཡེ་ཤེས་ ཀྱི་ བདག་པོ་ -ར་ གྱུར་པ་ -འོ་ ། །

source: The wisdom of the tathāgatas conforms with the minds of all sentient beings.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ དེ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ རྗེས་སུ་ སོང་བ་ -འོ་ ། །

source: It engages with the mental activity of all sentient beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཡིད་ ཀྱི་ རྗེས་སུ་ ཞུགས་པ་ -འོ་ ། །

source: It knows the consciousness of all sentient beings.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཤེས་པ་ རིག་པ་ -འོ་ ། །

source: It has resolved all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ངེས་པར་ བསམས་པ་ -འོ་ ། །

source: In all its absorptions, it does not depend on anything else.
bo: ཏིང་ངེ་འཛིན་ ཐམས་ཅད་ ལ་ གཞན་ གྱི་ དྲིང་ མི་ འཇོག་པ་ -འོ་ ། །

source: It completely transcends objectification.
bo: དམིགས་པ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འོ་ ། །

source: It is free from conditioned arising.
bo: རྐྱེན་ ལས་ སྐྱེ་བ་ དང་ བྲལ་བ་ -འོ་ ། །

source: It has eliminated the three existences.
bo: སྲིད་པ་ གསུམ་ བསལ་བ་ -འོ་ ། །

source: It has completely transcended any degree of pride.
bo: ང་རྒྱལ་ གྱི་ རིམ་པ་ ཐམས་ཅད་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འོ་ ། །

source: It is free of all the works of Māra.
bo: བདུད་ ཀྱི་ ལས་ ཐམས་ཅད་ ལས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འོ་ ། །

source: It is not constrained by any deception or pretense.
bo: སྒྱུ་ དང་ གཡོ་ ཐམས་ཅད་ དང་ བྲལ་བ་ -འོ་ ། །

source: It has eschewed clinging to I and mine.
bo: ངར་ འཛིན་པ་ དང་ ། ང་ ཡི་ -ར་ འཛིན་པ་ སྤངས་པ་ -འོ་ ། །

source: It is free of the faulty vision and darkness of ignorance and delusion.
bo: མ་རིག་པ་ དང་ གཏི་མུག་ གི་ མུན་པ་ དང་ རབ་རིབ་ ཀྱི་ ལིང་ཏོག་ དང་ བྲལ་བ་ -འོ་ ། །

source: It has completely cultivated the branches of the path.
bo: ལམ་ གྱི་ ཡན་ལག་ ཤིན་ཏུ་ ཡོངས་སུ་ བསྒོམས་པ་ -འོ་ ། །

source: It is nonconceptual like space.
bo: ནམ་མཁའ་ ལྟར་ རྣམ་པ་ -ར་ མི་ རྟོག་པ་ -འོ་ ། །

source: It is inseparable from the realm of phenomena.
bo: ཆོས་ ཀྱི་ དབྱིངས་ དང་ དབྱེ་ -ར་ མེད་པ་ སྟེ་ །

source: This is how the tathāgatas’ mental activity is preceded and accompanied by wisdom.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡིད་ ཀྱི་ ལས་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་བ་ ནི་ དེ་ལྟ་ བུ་ -འོ་ ། །

source: This is the twenty-ninth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ དགུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The victorious lords of humans cannot be fathomed by mind or thought.
bo: རྒྱལ་བ་ རྐང་ གཉིས་ དབང་པོ་ སེམས་ དང་ ཡིད་ ཀྱིས་ གཞལ་ མ་ ཡིན་ ། །

source: Pure wisdom purifies the acts of all the guides.
bo: ཡེ་ཤེས་ རྣམ་པ་ -ར་ དག་ གིས་ འདྲེན་པ་ ཀུན་ གྱི་ ལས་ རྣམས་ དག་ །

source: Sugata wisdom engages equally with the thoughts of all beings,
bo: བདེ་གཤེགས་ ཡེ་ཤེས་ དེ་ ནི་ སེམས་ཅན་ ཀུན་ གྱི་ བསམ་པ་ ལ་ ། །

source: While being by nature the realm of phenomena.
bo: མཉམ་པ་ཉིད་ དུ་ རྗེས་སུ་ ཞུགས་ཤིང་ ཆོས་དབྱིངས་ རང་བཞིན་ ནོ་ ། །

source: “ ‘It is endowed with all types of concentrations and absorptions.
bo: བསམ་གཏན་ དང་ ནི་ དེ་བཞིན་ ཏིང་འཛིན་ ཀུན་ དང་ རབ་ཏུ་ ལྡན་ ། །

source: It is not stirred by any conceptuality of mind or mental activity.
bo: སེམས་ དང་ ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ རྟོག་པ་ ཀུན་ དུ་ རྒྱུ་བ་ མེད་ ། །

source: It is free from Māra’s domain and transcends all of Māra’s works.
bo: བདུད་ ཀྱི་ ཡུལ་ ལས་ གྲོལ་ ཞིང་ བདུད་ ཀྱི་ ལས་ ལས་ ཤིན་ཏུ་ འདས་ ། །

source: It uniform, immaculate, and changeless, having the nature of space.’
bo: ནམ་མཁའ་ -འི་ རང་བཞིན་ མཚུངས་ ཤིང་ དྲི་མེད་ རྣམ་པ་ -ར་ འགྱུར་བ་ མེད་ ། །

source: “Son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the past.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ འདས་པ་ -འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ ཆགས་པ་ མེད་ ཅིང་ ཐོགས་པ་ མེད་པ་ -ར་ འཇུག་ གོ་ ། །

source: How is that?
bo: ཇི་ལྟར་ འཇུག་ ཅེ་ན་ །

source: They know numerically the entire range of buddhafields that have appeared and disappeared in the past.
bo: འདས་པ་ -འི་ དུས་ ཀྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བྱུང་བ་ དང་ ཞིག་པ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ བགྲང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every blade of grass, each bush, herb, and forest in those buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་དག་ ན་ རྩྭ་ དང་ ། ཤིང་ གེལ་པ་ དང་ ། སྨན་ དང་ ། ནགས་ཚལ་ དུ་ གྱུར་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every gathering of creatures designated as beings in those buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་དག་ ན་ སེམས་ཅན་ གྱི་ ཚོགས་ སེམས་ཅན་ དུ་ བཏགས་པ་ -ར་ གྱུར་པ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every type of conduct of those beings.
bo: སེམས་ཅན་ དེ་དག་ གི་ སྤྱོད་པ་ སྣ་ཚོགས་ སུ་ གྱུར་པ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every buddha that has emerged in those buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་དག་ ཏུ་ སངས་རྒྱས་ བྱུང་བ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every dharma taught and expressed by each buddha.
bo: སངས་རྒྱས་ རེ་རེ་ -ས་ ཆོས་ བསྟན་ ཅིང་ བརྗོད་པ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every being tamed in the Śrāvaka Vehicle and the Pratyekabuddha Vehicle, as well as those tamed in the Great Vehicle.
bo: སེམས་ཅན་ ཇི་སྙེད་ ཅིག་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -ར་ བཏུལ་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། སེམས་ཅན་ ཇི་སྙེད་ ཅིག་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -ར་ བཏུལ་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། སེམས་ཅན་ ཇི་སྙེད་ ཅིག་ ཐེག་པ་ ཆེན་པོ་ -ར་ བཏུལ་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know all the distinguishing features of the buddhafields, the different monastic congregations, and the range of lifespans, as well as the different categories of Dharma.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ རྣམ་པ་ -ར་ ཕྱེ་བ་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དགེ་སློང་ གི་ དགེ་འདུན་ རྣམ་པ་ -ར་ ཕྱེ་བ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཚེ་ -འི་ ཚད་ རྣམ་པ་ -ར་ ཕྱེ་བ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཆོས་ གནས་པ་ རྣམ་པ་ -ར་ ཕྱེ་བ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know of each inhalation and exhalation and of the enjoyment of excellent food.
bo: དབུགས་ འབྱུང་བ་ དང་ རྔུབ་པ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཟས་ ཀྱི་ མཆོག་ གི་ ལོངས་སྤྱོད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “The tathāgatas know the forms of all past beings, their deaths, and their rebirths.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ འདས་པ་ -འི་ རྣམ་པ་ དང་ ། འཆི་ འཕོ་ དང་ ། འགྲོ་བ་ -ར་ སྐྱེ་བ་ རྣམས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know their various faculties, activities, and mentalities. They know their mindstreams.
bo: དབང་པོ་ སྣ་ཚོགས་ དང་ སྤྱོད་པ་ སྣ་ཚོགས་ དང་ ། བསམ་པ་ སྣ་ཚོགས་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། སེམས་ ཀྱི་ རྒྱུད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically each and every mental state that has arisen based on a previous mental state, both through direct and indirect cognition.
bo: སེམས་ གང་ གི་ འོག་ ཏུ་ སེམས་ གང་ བྱུང་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མངོན་སུམ་ གྱི་ ཤེས་པ་ དང་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཤེས་པ་ -ས་ བགྲང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: They also observe the past mindstreams of previous tathāgatas.
bo: དེ་ དང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ ཀྱི་ རྒྱུད་ འདས་པ་ བཏང་བ་ རྣམས་ ཀྱང་ དམིགས་ སོ་ ། །

source: With such wisdom, the tathāgatas teach the Dharma to beings continuously in accordance with their ways of thinking.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ་ -ས་ སེམས་ཅན་ རྣམས་ ལ་ བསམ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཕྱད་པ་ -ར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the thirtieth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ སུམ་ཅུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘With regard to the fields, beings, and Dharma taught, Buddha wisdom is unattached and immeasurable.
bo: ཞིང་ དང་སེམས་ ཅན་ དང་ ནི་ ཆོས་ སྨྲ་ ལ་ ། ། སངས་རྒྱས་ ཡེ་ཤེས་ ཆགས་ མེད་ ཚད་ ཀྱང་ མེད་ ། །

source: The number of beings liberated by the guides
bo: འདྲེན་པ་ -ས་ སེམས་ཅན་ གང་དག་ ཐར་ བྱས་ དང་ ། །

source: And the number of monastic congregations in the fields,
bo: ཞིང་ དུ་ དགེ་སློང་ དགེ་འདུན་ གྱུར་ གྲངས་ དང་ ། །

source: “ ‘The thoughts and faculties of beings,
bo: སེམས་ཅན་ བསམ་པ་ དབང་པོ་ གང་ཡིན་ དང་ ། །

source: Their grades of physical form, speech, and mind,
bo: དབྱིབས་ དང་ སྒྲ་ ཡི་ རིམ་པ་ གང་ དང་སེམས་ ། །

source: Their names and behavior and all past events—
bo: མིང་ དང་ སྦྱོར་བ་ གང་དག་ འདས་པ་ ཀུན་ ། །

source: These the perfect buddhas behold and realize.’
bo: རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཡང་དག་ གཟིགས་པ་ -ས་ རྟོགས་ ། །

source: “Son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the future.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ མ་འོངས་པ་ -འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ ཆགས་པ་ མེད་ ཅིང་ ཐོགས་པ་ མེད་པ་ འཇུག་ གོ་ ། །

source: How is that?
bo: ཇི་ལྟར་ འཇུག་ ཅེ་ན་ །

source: The tathāgatas know each and every being, Dharma, and field that will arise and cease in the future, its arising and disappearance.
bo: སེམས་ཅན་ ནམ་ ། ཆོས་ སམ་ ། ཞིང་ གང་དག་ ཁ་ཅིག་ མ་འོངས་པ་ -འི་ དུས་ ན་ འབྱུང་བ་ -འམ་ ། འགག་པ་ -འམ་ ། འབྱུང་བ་ -ར་ འགྱུར་བ་ -འམ་ ། འཇིག་པ་ -ར་ འགྱུར་བ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know each and every destruction by fire or water of the eons to come, each and every buddhafield that will come into being, the total amount of earth in those buddhafields, each and every particle of dust, blade of grass, bush, herb, and forest, and each and every constellation of stars.
bo: བསྐལ་པ་ -འི་ མེ་ -ས་ ཚིག་པ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། ཆུས་ འཇིག་པ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ གནས་པ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་དག་ ན་ ས་ -འི་ ཁམས་ སུ་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ དུ་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། རྩྭ་ དང་ ། ཤིང་ གེལ་བ་ དང་ ། སྨན་ དང་ ། ནགས་ཚལ་ དུ་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། སྐར་མ་ -འི་ གཟུགས་ སུ་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ །

source: “They know each and every buddha that will appear in each of those infinite buddhafields, each and every śrāvaka, pratyekabuddha, and bodhisattva, each and every enjoyment of excellent food, and each and every instance of inhalation, exhalation, walking, sitting, and conduct.
bo: ཞིང་ རབ་ འབྱམ་ རེ་རེ་ -ར་ སངས་རྒྱས་ འབྱུང་བ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། ཉན་ཐོས་ འབྱུང་བ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། རང་ སངས་རྒྱས་ འབྱུང་བ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འབྱུང་བ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ ། ཟས་ ཀྱི་ མཆོག་ གི་ ལོངས་སྤྱོད་ དང་ ། དབུགས་ འབྱུང་བ་ དང་ ། རྔུབ་པ་ དང་ ། འཆག་པ་ དང་ ། འདུག་པ་ དང་ ། སྤྱོད་ལམ་ དུ་ འགྱུར་བ་ ཇི་སྙེད་པ་ དང་ །

source: The tathāgatas know each and every being in those infinite realms who will be liberated by means of the Śrāvaka Vehicle, the Pratyekabuddha Vehicle, and the Great Vehicle.
bo: དེ་བཞིན་ གཤེགས་པ་ རབ་ འབྱམ་ རེ་རེ་ -ས་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ དང་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ དང་ ། ཐེག་པ་ ཆེན་པོ་ -ས་ སེམས་ཅན་ ཐར་བ་ -ར་ བྱེད་པ་ -ར་ འགྱུར་བ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the lifespan of each and every being in each of those infinite fields, as well as each and every mind and mental event to come.
bo: ཞིང་ རབ་ འབྱམ་ རེ་རེ་ ན་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྐྱེ་བ་ -འི་ གནས་ ཇི་སྙེད་པ་ དང་ ། སེམས་ དང་སེམས་ ལས་ བྱུང་བ་ ཇི་སྙེད་ ཅིག་ འབྱུང་བ་ -ར་ འགྱུར་བ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཀྱང་

source: Moreover, they teach the Dharma to beings while observing the future, without the future mindstream of tathāgatas being interrupted.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ མ་འོངས་པ་ -འི་ སེམས་ ཀྱི་ རྒྱུན་ བསྐལ་པ་ -ར་ འགྱུར་བ་ མ་ཡིན་པ་ -ར་ མ་འོངས་པ་ ལ་ ལྟ་བ་ -ས་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the thirty-first tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ སུམ་ཅུ་ རྩ་ གཅིག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘With their stainless vision, The buddhas are fully aware Of any event that will appear and disappear in the future, As well as each and every victor throughout the buddhafields.
bo: དྲི་མེད་ མིག་ གིས་ མ་འོངས་ དུས་ ན་ ནི་ ། ། ཆུང་ ཟད་ འབྱུང་བ་ -ར་ འགྱུར་ དང་ འཇིག་ འགྱུར་ དང་ ། ། སངས་རྒྱས་ ཞིང་ རྣམས་ ཀུན་ ན་ རྒྱལ་བ་ དང་ ། ། དེ་དག་ ཐམས་ཅད་ མ་ ལུས་ སངས་རྒྱས་ མཁྱེན་ ། །

source: “ ‘As they set their sights upon future events,
bo: མ་འོངས་པ་ ཡི་ དམིགས་པ་ -ར་ གཏོང་བ་ ན་ ། །

source: Their minds are never distracted.
bo: དེ་ ཡི་ སེམས་ ནི་ ནམས་ ཀྱང་ གཡེང་བ་ མེད་ ། །

source: They teach beings the Dharma accordingly.
bo: སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ ཆོས་སྟོན་ ཏེ་ ། །

source: This is the liberating activity of the supreme beings.’
bo: འདི་ ནི་ རྐང་ གཉིས་ མཆོག་ གི་ འཕྲིན་ལས་ ཡིན་ ། །

source: “Furthermore, son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the present.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ ད་ལྟར་ བྱུང་བ་ -འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ ཆགས་པ་ མེད་ ཅིང་ ཐོགས་པ་ མེད་པ་ འཇུག་ གོ་ ། །

source: How is that?
bo: ཇི་ལྟར་ འཇུག་ ཅེ་ན་ །

source: The tathāgatas know in a threefold manner the number of all the present buddhafields in the ten directions.
bo: འདི་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཕྱོགས་ བཅུ་ དག་ ན་ ད་ལྟར་ བྱུང་བ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ བགྲང་བ་ རྣམ་པ་ གསུམ་ གྱི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know all the present buddhas, all of the present bodhisattvas, all of the present śrāvakas, and all of the present pratyekabuddhas.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སངས་རྒྱས་ ཐམས་ཅད་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ད་ལྟར་ བྱུང་བ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ད་ལྟར་ བྱུང་བ་ -འི་ ཉན་ཐོས་ ཐམས་ཅད་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ད་ལྟར་ བྱུང་བ་ -འི་ རང་ སངས་རྒྱས་ ཐམས་ཅད་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “They know all the present constellations of stars.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སྐར་མ་ -འི་ གཟུགས་ ཐམས་ཅད་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the present blades of grass, bushes, herbs, and forests.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ རྩྭ་ དང་ ། ཤིང་ གེལ་པ་ དང་ ། སྨན་ དང་ ། ནགས་ཚལ་ རྣམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically all the dust particles of the earth element being crushed into pieces right now in the ten directions.
bo: ཕྱོགས་ བཅུ་ དག་ ན་ ད་ལྟར་ བྱུང་བ་ -འི་ ས་ -འི་ ཁམས་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ གྱི་ ཆ་ -ར་ བརླགས་པ་ ཐམས་ཅད་ བགྲང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically all the minutest drops of the water element in the ten directions.
bo: ཕྱོགས་ བཅུ་ -འི་ ཆུ་ -འི་ ཁམས་ སྐྲ་ -འི་ རྩེ་མོ་ -ས་ བླངས་པ་ -འི་ ཐིགས་པ་ ཐམས་ཅད་ ཀྱང་ བགྲང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically all the sparks of the fire element flickering in the ten directions.
bo: ཕྱོགས་ བཅུ་ -འི་ མེ་ -འི་ ཁམས་ ཀྱི་ སྐྱེ་བ་ དང་ འགག་པ་ ཐམས་ཅད་ ཀྱང་ བགྲང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically all the gusts of wind forming in the ten directions.
bo: ཕྱོགས་ བཅུ་ -འི་ རླུང་ གི་ ཁམས་ ཐམས་ཅད་ ཀྱང་ གཟུགས་ སུ་ གྱུར་པ་ ལ་ བབ་པ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know numerically all the minutest extensions of space in the ten directions.
bo: ཕྱོགས་ བཅུ་ -འི་ ནམ་མཁའ་ -འི་ ཁམས་ ཐམས་ཅད་ ཀྱང་ སྐྲ་ -འི་ རྩེ་མོ་ -ས་ རྒྱས་པ་ -ར་ དགང་བ་ -འི་ ཚུལ་ གྱིས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “They know the three aspects of the realms of beings in the present:
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ རྣམ་པ་ གསུམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the realms of beings currently dwelling in hell, the causes of their birth, and the causes of their liberation.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ དམྱལ་བ་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ -འི་ སྐྱེ་བ་ -འི་ རྒྱུ་ དང་ ཐར་པ་ -འི་ རྒྱུ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the realms of beings currently reborn as animals, the causes of their birth, and the causes of their liberation.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སོང་བ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ -འི་ སྐྱེ་བ་ -འི་ རྒྱུ་ དང་ ཐར་པ་ -འི་ རྒྱུ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the realms of beings currently in the world of Yama, the causes of their birth, and the causes of their liberation.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ -འི་ སྐྱེ་བ་ -འི་ རྒྱུ་ དང་ ཐར་པ་ -འི་ རྒྱུ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །
