Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: that of bodhisattvas who are freed from applied and sustained thought, have inner serenity, and attain to and abide in the second concentration, which is joyful and blissful through absorption that is one-pointed and has no applied or sustained thought;
bo: དེ་ རྟོག་པ་ དང་ ། དཔྱོད་པ་ དང་ བྲལ་ ཞིང་ ནང་ ཡོངས་སུ་ དང་ སྟེ་ ། སེམས་ ཀྱི་ རྒྱུད་ གཅིག་ ཏུ་ གྱུར་པ་ -ས་ རྟོག་པ་ མེད་པ་ དཔྱོད་པ་ མེད་པ་ -འི་ ཏིང་ངེ་འཛིན་ ལས་ སྐྱེས་པ་ -འི་ དགའ་བ་ དང་ ། བདེ་བ་ ཅན་ བསམ་གཏན་ གཉིས་པ་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who are freed from the desire for joy, dwell in equanimity, are mindfully aware, and attain to and abide in the third concentration that is beyond joy, experiencing that physical bliss of which the noble ones say, ‘this is mindful equanimity established in bliss’;
bo: དེ་ དགའ་བ་ -འི་ འདོད་ཆགས་ དང་ བྲལ་བ་ -ས་ བཏང་སྙོམས་ ལ་ གནས་ ཤིང་ དྲན་པ་ དང་ ཤེས་བཞིན་ ཅན་ ཡིན་ ཏེ་ ། བདེ་བ་ ལུས་ ཀྱིས་ མྱོང་ ལ་ འཕགས་པ་ རྣམས་ ཀྱིས་ གང་དེ་ དྲན་པ་ དང་ ལྡན་པ་ ། བདེ་བ་ ལ་ གནས་པ་ བཏང་སྙོམས་པ་ -འོ་ ཞེས་ བརྗོད་པ་ སྟེ་ ། དགའ་བ་ མེད་པ་ -འི་ བསམ་གཏན་ གསུམ་པ་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who have abandoned bliss, having previously abandoned suffering, whose happiness and sadness have subsided, and who attain to and abide in the fourth concentration, which is pure mindfulness and equanimity that is neither bliss nor suffering;
bo: དེ་ བདེ་བ་ ཡང་ སྤངས་ ཏེ་ ། སྔ་ ནས་ སྡུག་བསྔལ་བ་ ཡང་ སྤངས་ ཤིང་ ཡིད་ བདེ་བ་ དང་ ། ཡིད་ མི་ བདེ་བ་ ཡང་ ནུབ་པ་ -ས་ བདེ་བ་ ཡང་ མ་ ཡིན་ ། སྡུག་བསྔལ་བ་ ཡང་ མ་ཡིན་པ་ ། བཏང་སྙོམས་ དང་ དྲན་པ་ ཡོངས་སུ་ དག་པ་ བསམ་གཏན་ བཞི་པ་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who have transcended the perception of form, whose perception of physical obstruction has subsided, who pay no attention to diverse perceptions but think, ‘space is unending,’ and who attain to and abide in the realm of infinite space;
bo: དེ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ གཟུགས་ ཀྱི་ འདུ་ཤེས་ རྣམས་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། ཐོགས་པ་ -འི་ འདུ་ཤེས་ རྣམས་ ནུབ་པ་ -ར་ གྱུར་ ཅིང་ ། སྣ་ཚོགས་ ཀྱི་ འདུ་ཤེས་ རྣམས་ ཡིད་ ལ་ མི་ བྱེད་པ་ -ས་ ། ནམ་མཁའ་ མཐའ་ ཡས་ སོ་ སྙམ་ ནས་ ། ནམ་མཁའ་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who have completely transcended the realm of infinite space and think, ‘consciousness is unending,’ who attain to and abide in the realm of infinite consciousness;
bo: དེ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ ནམ་མཁའ་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། རྣམ་པ་ -ར་ ཤེས་པ་ མཐའ་ ཡས་ སོ་ སྙམ་ ནས་ རྣམ་ཤེས་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who have completely transcended the realm of infinite consciousness and think, ‘there is nothing at all,’ who attain to and abide in the realm of nothing at all;
bo: དེ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ རྣམ་ཤེས་ མཐའ་ ཡས་ སྐྱེ་མཆེད་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། ཅིའང་ མེད་ དོ་ སྙམ་ ནས་ ཅི་ཡང་ མེད་པ་ -འི་ སྐྱེ་མཆེད་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: that of bodhisattvas who have completely transcended the realm of nothing at all and attain to and abide in the Sphere of neither Perception nor Nonperception;
bo: དེ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ ཅི་ཡང་ མེད་པ་ -འི་ སྐྱེ་མཆེད་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ནས་ འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ སྐྱེ་མཆེད་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: and that of bodhisattvas who have completely transcended the Sphere of neither Perception nor Nonperception and attain the cessation of sensation and perception, but though they attain it, because of skillful means they refrain from manifesting the limit of reality and instead, due to previous blessing, remain present and mature sentient beings.
bo: དེ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ སྐྱེ་མཆེད་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། འདུ་ཤེས་ དང་ ཚོར་བ་ འགོག་པ་ -འི་ སྙོམས་པར་ འཇུག་པ་ ལ་ སྙོམས་པར་ འཇུག་ ཀྱང་ ཐབས་མཁས་པ་ -ས་ ཡང་དག་པ་ -འི་ མཐའ་ མངོན་སུམ་ དུའང་ མི་ བྱེད་ ལ་ ། སྔོན་ གྱི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ ཡང་དག་པ་ -ར་ གནས་ ། སེམས་ཅན་ རྣམས་ ཀྱང་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ སྟེ་ །

source: These are the nine ornaments of absorption.
bo: ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ དགུ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are ten types of bodhisattva ornaments of absorption: gaining certainty through imperturbability, perfecting tranquil abiding, not forsaking diligent effort, withdrawing into meditative seclusion, not squandering the roots of virtue, maintaining mental solitude, maintaining physical pliancy, being discerning while thinking about and evaluating phenomena, controlling the mind, and attaining the noble lineage.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ བཅུ་པོ་ འདི་དག་ སྟེ་ ། བཅུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། མི་ འཁྲུགས་པ་ -ས་ ངེས་པར་ སེམས་པ་ དང་ ། ཞི་གནས་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་པ་ དང་ ། མངོན་པར་ བརྩོན་པ་ མི་ འདོར་བ་ དང་ ། ནང་ དུ་ ཡང་དག་ འཇོག་ སྦེད་པ་ དང་ ། དགེ་བ་ -འི་ རྩ་བ་ རྣམས་ ཆུད་ མི་ ཟ་བ་ དང་ ། སེམས་དབེན་པ་ དང་ ། ལུས་ ཤིན་ཏུ་ སྦྱངས་པ་ དང་ ། ཆོས་ རྣམས་ ལ་ སེམས་ ཤིང་ འཇལ་ ལ་སོ་ སོ་ -ར་ རྟོག་པ་ དང་ ། སེམས་ ལ་ དབང་ སྒྱུར་བ་ དང་ ། འཕགས་པ་ -འི་ རིགས་ རབ་ཏུ་ ཐོབ་པ་ སྟེ་ །

source: Son of noble family, these are the ten types of bodhisattva ornaments of absorption.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ རྒྱན་ ནི་ བཅུ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of insight?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ གང་ཞེ་ན་ །

source: Son of noble family, there is a single bodhisattva ornament of insight. It is having no doubts about any phenomenon.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ གཅིག་ སྟེ་ ། གཅིག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཆོས་ ཐམས་ཅད་ ལ་ ཐེ་ཚོམ་ མེད་པ་ སྟེ་ ། འདི་ ནི་ གཅིག་ གོ་ ། །

source: “Son of noble family, there are two types of bodhisattva ornaments of insight: having no regret and not being agitated.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ གཉིས་པོ་ འདི་དག་ སྟེ་ ། གཉིས་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། འགྱོད་པ་ དང་ བྲལ་བ་ དང་ ། ཀུན་ ནས་ ལྡང་བ་ དང་ བྲལ་བ་ སྟེ་ ། གཉིས་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are three types of bodhisattva ornaments of insight: abandoning delusion, breaking through the shell of ignorance, and dispelling the thick darkness of confusion.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ གསུམ་པོ་ འདི་དག་ སྟེ་ ། གསུམ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། གཏི་མུག་ སྤོང་བ་ དང་ ། མ་རིག་པ་ -འི་ སྒོ་ང་ -འི་ སྦུབས་ ངེས་པར་ གཅོག་པ་ དང་ ། མུན་པ་ མུན་ནག་ སེལ་བ་ སྟེ་ ། གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are four types of bodhisattva ornaments of insight: understanding the suffering that is to be understood, illuminating the source of suffering to be relinquished, bringing to light the cessation to be realized, and being empowered to cultivate the path.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ སྟེ་ ། བཞི་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྡུག་བསྔལ་ ཡོངས་སུ་ ཤེས་པ་ -ར་ བྱ་བ་ -འི་ ཤེས་པ་ དང་ ། ཀུན་འབྱུང་བ་ སྤང་བ་ -འི་ སྣང་བ་ དང་ ། འགོག་པ་ མངོན་སུམ་ དུ་ བྱ་བ་ -འི་ མངོན་གསལ་ དང་ ། ལམ་ བསྒོམ་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ཏེ་ ། བཞི་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are five types of bodhisattva ornaments of insight: purification of morality through lack of objectification, purification of absorption through concentration endowed with supreme insight, purification of liberation through nonduality, purification of the vision of liberating wisdom through the sameness of the three times, and purification of phenomena by means of the nature of reality free of attachment.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ ལྔ་པོ་ འདི་དག་ སྟེ་ ། ལྔ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དམིགས་པ་ མེད་པ་ -ས་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ དང་ ། ཤེས་རབ་ མཆོག་ གིས་ བསམ་གཏན་པ་ ཡིན་པ་ -ས་ ཏིང་ངེ་འཛིན་ གྱི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ དང་ ། གཉིས་ དང་ བྲལ་བ་ -ས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ དང་ ། དུས་གསུམ་ མཉམ་པ་ཉིད་པ་ -ས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ -འི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ དང་ ། འདོད་ཆགས་ དང་ བྲལ་བ་ -འི་ ཆོས་ཉིད་པ་ -ས་ ཆོས་ ཀྱི་ ཕུང་པོ་ ཡོངས་སུ་ དག་པ་ སྟེ་ ། ལྔ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are six types of bodhisattva ornaments of insight:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ དྲུག་པོ་ འདི་དག་ སྟེ་ །

source: transcendent generosity purified of the three spheres—the sphere of the agent purified because of being the same as an illusion, the sphere of sentient beings purified because of being the same as a dream, and the sphere of awakening purified through not hoping for results;
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ སྦྱིན་པ་ -འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ སྒྱུ་མ་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ བདག་ གི་ འཁོར་ ཡོངས་སུ་ དག་པ་ དང་ ། རྨི་ལམ་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ སེམས་ཅན་ གྱི་ འཁོར་ ཡོངས་སུ་ དག་པ་ དང་ ། རྣམ་པ་ -ར་ སྨིན་པ་ ལ་ རེ་བ་ མེད་པ་ -ས་ བྱང་ཆུབ་ ཀྱི་ འཁོར་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: transcendent morality purified of the three spheres—the sphere of body purified on account of being like a reflection, the sphere of speech purified by understanding it to be like an echo, and the sphere of the mind purified because of being the same as an illusion;
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ གཟུགས་བརྙན་ ལྟ་བུ་ -འི་ ཕྱིར་ ལུས་ ཀྱི་ འཁོར་ ཡོངས་སུ་ དག་པ་ དང་ ། བྲག་ཅ་ ལྟ་བུ་ -འི་ ཤེས་པ་ -ས་ ངག་ གི་ འཁོར་ ཡོངས་སུ་ དག་པ་ དང་ ། སྒྱུ་མ་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ སེམས་ ཀྱི་ འཁོར་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: transcendent patience purified of the three spheres—purification in abandoning aversion toward harshly spoken words, purification in abandoning desire for praise and adulation, and purification of understanding the dharmakāya in the offering of severed limbs and body parts;
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ བཟོད་པ་ -འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ ཉེས་པ་ -ར་ སྨྲས་པ་ -འི་ ཚིག་ རྣམས་ ལ་ ཁོང་ཁྲོ་བ་ སྤོང་བ་ ཡོངས་སུ་ དག་པ་ དང་ ། བསྟོད་པ་ དང་ ། བསྔགས་པ་ དང་ ། རྗེས་སུ་ ཆགས་པ་ སྤོང་བ་ ཡོངས་སུ་ དག་པ་ དང་ ། ཡན་ལག་ དང་ ཉིང་ལག་ གཅོད་པ་ དག་ ལ་ ཆོས་ ཀྱི་ སྐུ་ ལ་ རབ་ཏུ་ རྟོག་པ་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: transcendent vigor purified of the three spheres— purification in not being disheartened through the conviction that saṃsāra is dreamlike, purification in being stable through a vajra-like intention, and purification in neither accepting nor rejecting through liberating oneself from all conceptual signs;
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ བརྩོན་འགྲུས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ འཁོར་བ་ རྨི་ལམ་ ལྟ་བུ་ -ར་ མོས་པ་ -ས་ ཡོངས་སུ་ མི་ སྐྱོ་བ་ ཡོངས་སུ་ དག་པ་ དང་ ། རྡོ་རྗེ་ ལྟ་བུ་ -འི་ བསམ་པ་ -ས་ བརྟན་པ་ ཡོངས་སུ་ དག་པ་ དང་ ། མཚན་མ་ ཐམས་ཅད་ ལས་ སྒྲོལ་བ་ -ས་ བླང་བ་ མེད་པ་ དང་ དོར་བ་ མེད་པ་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: transcendent concentration purified of the three spheres—purification in nonattachment to it through understanding its mutability, purification in special insight through lack of obsession, and purification in focus through generation of superknowledge;
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ འགྱུར་བ་ -ར་ ཤེས་པ་ -ས་ དེ་ ལ་མ་ ཆགས་པ་ ཡོངས་སུ་ དག་པ་ དང་ ། མངོན་པར་ ཞེན་པ་ མེད་པ་ -ས་ ལྷག་མཐོང་ ཡོངས་སུ་ དག་པ་ དང་ ། མངོན་པར་ ཤེས་པ་ སྐྱེད་པ་ -ས་ དམིགས་པ་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: and transcendent skillful means purified of the three spheres—purification in matters relating to gathering disciples by bringing beings to maturity, purification in having retention through upholding the true Dharma, and purification in aspirations in order to ornament the buddhafields.
bo: འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ ཐབས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ནི་ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ -ས་ བསྡུ་བ་ -འི་ དངོས་པོ་ ཡོངས་སུ་ དག་པ་ དང་ ། དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ འཛིན་པ་ -ས་ གཟུངས་ ཡོངས་སུ་ དག་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ རྒྱན་ གྱི་ ཕྱིར་ སྨོན་ལམ་ ཡོངས་སུ་ དག་པ་ སྟེ་ ། དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are seven types of bodhisattva ornaments of insight: being without mindfulness or mental engagement among the applications of mindfulness, understanding the lack of arising and cessation among correct exertions, being physically and mentally detached through the bases of miraculous powers, understanding the spiritual faculties among the sense faculties, annihilating all māras and afflictive emotions by means of the strengths, understanding by means of the factors of awakening the nature of all phenomena, and understanding that there is no coming and going among the paths.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ བདུན་པོ་ འདི་དག་ སྟེ་ ། བདུན་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དྲན་པ་ ཉེ་བར་ གཞག་པ་ རྣམས་ ལ་ དྲན་པ་ མེད་ ཅིང་ ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ དང་ ། ཡང་དག་པ་ -ར་ སྤོང་བ་ རྣམས་ ལ་ སྐྱེ་བ་ མེད་པ་ དང་ འགག་པ་ མེད་པ་ -ར་ ཤེས་པ་ དང་ ། རྫུ་འཕྲུལ་ གྱི་ རྐང་པ་ རྣམས་ ཀྱིས་ ལུས་ དང་སེམས་ དབེན་པ་ དང་ ། དབང་པོ་ རྣམས་ ལ་ དབང་པོ་ ཡོངས་སུ་ ཤེས་པ་ དང་ ། སྟོབས་ རྣམས་ ཀྱིས་ བདུད་ དང་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཚར་གཅོད་པ་ དང་ ། བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ རྣམས་ ཀྱིས་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ངོ་བོ་ ཉིད་ དང་ ། ལམ་ རྣམས་ ལ་ འོང་བ་ མེད་པ་ དང་ འགྲོ་བ་ མེད་པ་ -ར་ ཤེས་པ་ སྟེ་ བདུན་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are eight types of bodhisattva ornaments of insight: understanding tranquil abiding on account of having deep serenity, understanding special insight on account of lacking distorted vision, understanding the aggregates on account of realizing the collections of Dharma, understanding the elements because they are the same as the element of space, understanding the sense fields because they are the same as a ghost town, understanding dependent arising because it is without self, understanding the truths on account of a lack of turmoil, and understanding the definite realization of all phenomena on account of the full realization of reality just as it is.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཤིན་ཏུ་ ཞི་བ་ -འི་ ཕྱིར་ ཞི་གནས་ ཤེས་པ་ དང་ ། རབ་རིབ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ལྷག་མཐོང་ ཤེས་པ་ དང་ ། ཆོས་ ཀྱི་ ཕུང་པོ་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཕྱིར་ ཕུང་པོ་ ཤེས་པ་ དང་ ། ནམ་མཁའ་ -འི་ ཁམས་ དང་ མཉམ་པ་ཉིད་ ཀྱི་ ཕྱིར་ ཁམས་ ཤེས་པ་ དང་ ། གྲོང་སྟོང་ དང་ མཉམ་པ་ཉིད་ ཀྱི་ ཕྱིར་ སྐྱེ་མཆེད་ ཤེས་པ་ དང་ ། བདག་མེད་པ་ -འི་ ཕྱིར་ རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ ཤེས་པ་ དང་ ། མི་ འཁྲུགས་པ་ -འི་ ཕྱིར་ བདེན་པ་ ཤེས་པ་ དང་ ། ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ རབ་ཏུ་ རྟོགས་པ་ -ས་ ཆོས་ ཐམས་ཅད་ ངེས་པར་ རྟོགས་པ་ ཤེས་པ་ སྟེ་ ། བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are nine types of bodhisattva ornaments of insight: understanding the past by means of the beginning, understanding the future by means of the end, understanding the present by means of the intervening, understanding the determinate destinies given that causes do not perish, understanding the indeterminate destinies given that conditions may produce different results, understanding the destinies of those who because of spiritual maturation are not predisposed to erring, understanding that all buddhas are equal because they are distinguished by the dharmakāya, understanding all phenomena to be sameness since reality is free of attachment, and understanding all noble ones to be equal because they are distinguished by the unconditioned.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ དགུ་པོ་ འདི་དག་ སྟེ་ ། དགུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། སྔོན་ གྱི་ མཐའ་དག་པ་ -ས་ འདས་པ་ ཤེས་པ་ དང་ ཕྱི་མ་ -འི་ མཐའ་དག་པ་ -ས་ མ་འོངས་པ་ ཤེས་པ་ དང་ ། བར་ གྱི་ མཐའ་དག་པ་ -ས་ ད་ལྟར་ བྱུང་བ་ ཤེས་པ་ དང་ ། རྒྱུ་ ཆུད་ མི་ ཟ་བ་ -ས་ ངེས་པ་ རྣམས་ ཤེས་པ་ དང་ ། རྐྱེན་ ཕྱེ་བ་ -ར་ སྒྲུབ་པ་ -ས་ མ་ངེས་པ་ རྣམས་ ཤེས་པ་ དང་ ། ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ -ས་ ལོག་པ་ ཉིད་ དུ་མ་ ངེས་པ་ རྣམས་ ཤེས་པ་ དང་ ། ཆོས་ ཀྱི་ སྐུས་ རབ་ཏུ་ ཕྱེ་བ་ -འི་ ཕྱིར་ སངས་རྒྱས་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ ཤེས་པ་ དང་ ། འདོད་ཆགས་ དང་ བྲལ་བ་ -འི་ ཆོས་ ཀྱི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ ཤེས་པ་ དང་ ། འདུས་མ་བྱས་ ཀྱིས་ རབ་ཏུ་ ཕྱེ་བ་ -འི་ ཕྱིར་ འཕགས་པ་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ ཤེས་པ་ སྟེ་ ། དགུ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are ten types of bodhisattva ornaments of insight: understanding the nature of reality to be illusory on account of the characteristic of accomplishment, understanding it to be like a dream on account of the characteristic of conceptuality, understanding it to be like a mirage on account of the characteristic of deception, understanding it to be like a reflection on account of the characteristic of motionlessness, understanding it to be like a hallucination on account of the characteristic of being an assembly, understanding it to be like an echo on account of the characteristic of being conditioned, understanding the realm of phenomena as characterized by being uncorrupted, understanding thusness as characterized by being nonabiding, understanding the limit of reality as characterized by being unperturbed, and understanding the conditioned as being characterized by being unconditioned.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་རབ་ ཀྱི་ རྒྱན་ ནི་ བཅུ་པོ་ འདི་དག་ སྟེ་ ། བཅུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། རྣམ་པ་ -ར་ བསྒྲུབ་པ་ -འི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ སྒྱུ་མ་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། ཡོངས་སུ་ རྟོག་པ་ -འི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ རྨི་ལམ་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། རྣམ་པ་ -ར་ འཁྲུལ་པ་ -འི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ སྨིག་རྒྱུ་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། འཕོ་བ་ མེད་པ་ -འི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ གཟུགས་བརྙན་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། འདུ་འཕྲོད་ ཀྱི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ མིག་ཡོར་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། རྐྱེན་ གྱི་ མཚན་ཉིད་ ཀྱི་ ཕྱིར་ བྲག་ཅ་ ལྟ་བུ་ -ར་ ཤེས་པ་ དང་ ། ཆོས་ ཀྱི་ དབྱིངས་ འདྲེས་པ་ མེད་པ་ -འི་ མཚན་ཉིད་ དུ་ ཤེས་པ་ དང་ ། དེ་བཞིན་ཉིད་ གནས་ མེད་པ་ -འི་ མཚན་ཉིད་ དུ་ ཤེས་པ་ དང་ ། ཡང་དག་པ་ -འི་ མཐའ་མི་ འཁྲུགས་པ་ -འི་ མཚན་ཉིད་ དུ་ ཤེས་པ་ དང་ ། འདུས་བྱས་ དག་ འདུས་མ་བྱས་ ཀྱི་ མཚན་ཉིད་ དུ་ ཤེས་པ་ སྟེ་ །

source: “Son of noble family, you may ask, ‘What are the bodhisattva ornaments of retention?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ གང་ཞེ་ན་ །

source: Son of noble family, there is a single bodhisattva ornament of retention. It is remembering without forgetting.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ གཅིག་ སྟེ་ གཅིག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དྲན་པ་ བརྗེད་པ་ མེད་པ་ སྟེ་ ། འདི་ ནི་ གཅིག་ གོ་ ། །

source: “Son of noble family, there are two types of bodhisattva ornaments of retention: full retention and retention.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ གཉིས་པོ་ འདི་དག་ སྟེ་ ། གཉིས་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཀུན་ ཏུ་ འཛིན་པ་ དང་ ། འཛིན་པ་ སྟེ་ ། གཉིས་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are three types of bodhisattva ornaments of retention: skill in meaning, phonemes, and etymology.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ གསུམ་པོ་ འདི་དག་ སྟེ་ ། གསུམ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། དོན་ ལ་ མཁས་པ་ དང་ ། ཚིག་འབྲུ་ ལ་ མཁས་པ་ དང་ ། ངེས་པ་ -འི་ ཚིག་ ལ་ མཁས་པ་ སྟེ་ ། གསུམ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are four types of bodhisattva ornaments of retention: speaking words that are dispassionate, refined, liberated, and without falsehood.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ བཞི་པོ་ འདི་དག་ སྟེ་ ། བཞི་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཆགས་པ་ མེད་པ་ -འི་ ཚིག་ དང་ ། རྩུབ་པ་ མ་ཡིན་པ་ -འི་ ཚིག་ དང་ ། རབ་ཏུ་ གྲོལ་བ་ -འི་ ཚིག་ དང་ ། བརྫུན་པ་ མེད་པ་ -འི་ ཚིག་ སྟེ་ ། བཞི་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are five types of bodhisattva ornaments of retention: reliance on meaning among all one has studied, reliance on wisdom among all collections of words, reliance on sūtras of definitive meaning among all the sūtras, reliance on the nature of reality rather than all the words of persons, and reliance on the supramundane rather than on all that is mundane.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ ལྔ་པོ་ འདི་དག་ སྟེ་ ། ལྔ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཐོས་པ་ ཐམས་ཅད་ ཀྱི་ ནང་ ནས་ དོན་ ལ་ རྟོན་པ་ དང་ ། ཡི་གེ་ -འི་ ཚོགས་ ཐམས་ཅད་ ཀྱི་ ནང་ ནས་ ཡེ་ཤེས་ ལ་ རྟོན་པ་ དང་ ། མདོ་སྡེ་ ཐམས་ཅད་ ཀྱི་ ནང་ ནས་ ངེས་པ་ -འི་ དོན་ གྱི་ མདོ་སྡེ་ ལ་ རྟོན་པ་ དང་ ། གང་ཟག་ གི་ སྒྲ་ ཐམས་ཅད་ ལས་ ཆོས་ཉིད་ ལ་ རྟོན་པ་ དང་ ། འཇིག་རྟེན་ ཐམས་ཅད་ ལས་ འཇིག་རྟེན་ ལས་ འདས་པ་ ལ་ རྟོན་པ་ སྟེ་ ། ལྔ་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are six types of bodhisattva ornaments of retention: acting in accordance with one’s words, employing statements that correspond to the truth, using words that are suitable to be kept in mind since they are without arrogance, using words that are acceptable because they are without deceptiveness, teaching the Dharma that bears fruit because it is joined with great compassion, teaching the Dharma continuously through tactful knowledge of the audience, and teaching the Dharma in a timely manner through understanding the ways of the world.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ དྲུག་པོ་ འདི་དག་ སྟེ་ ། དྲུག་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ཇི་སྐད་ སྨྲས་པ་ དེ་བཞིན་ དུ་ བྱེད་པ་ དང་ ། བདེན་པ་ -འི་ རྗེས་སུ་ འཐུན་པ་ -འི་ ཚིག་ རབ་ཏུ་ ཐོབ་པ་ དང་ ། ང་རྒྱལ་ མེད་པ་ -ས་ གཟུང་བ་ -ར་ འོས་པ་ -འི་ ཚིག་ དང་ ། གཡོ་མེད་པ་ -ས་ བླང་བ་ -ར་ འོས་པ་ -འི་ ཚིག་ དང་ ། སྙིང་རྗེ་ ཆེན་པོ་ ལ་ སྦྱོར་བ་ -ས་ འབྲས་བུ་ ཡོད་པ་ -འི་ ཆོས་སྟོན་པ་ དང་ ། སྣོད་ ལ་ མཁས་པ་ -ས་ ཕྱད་པ་ -ར་ ཆོས་སྟོན་པ་ དང་ ། འཇིག་རྟེན་ ཤེས་པ་ -ས་ དུས་ སུ་ ཆོས་སྟོན་པ་ སྟེ་ དྲུག་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are seven types of bodhisattva ornaments of retention: possessing eloquence that is swift, forceful, quick, dispassionate, uninterrupted, undistorted, and replete with etymologies.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ བདུན་པོ་ འདི་དག་ སྟེ་ ། བདུན་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། མགྱོགས་པ་ -འི་ སྤོབས་པ་ དང་ ། ཤུགས་ཅན་ གྱི་ སྤོབས་པ་ དང་ ། མྱུར་བ་ -འི་ སྤོབས་པ་ དང་ ། ཆགས་པ་ མེད་པ་ -འི་ སྤོབས་པ་ དང་ ། རྒྱུན་ ཆད་པ་ མེད་པ་ -འི་ སྤོབས་པ་ དང་ ། འཁྲུལ་པ་ མེད་པ་ -འི་ སྤོབས་པ་ དང་ ། ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ གི་ སྤོབས་པ་ སྟེ་ ། བདུན་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are eight types of bodhisattva ornaments of retention: knowing the languages of the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas, up to the languages of all sentient beings.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ ། བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། ལྷ་ -འི་ སྐད་ ཤེས་པ་ དང་ ། ཀླུ་ -འི་ སྐད་ ཤེས་པ་ དང་ ། གནོད་སྦྱིན་ གྱི་ སྐད་ ཤེས་པ་ དང་ ། དྲི་ཟ་ -འི་ སྐད་ ཤེས་པ་ དང་ ། ལྷ་མ་ ཡིན་ གྱི་ སྐད་ ཤེས་པ་ དང་ ། ནམ་མཁའ་ ལྡིང་ གི་ སྐད་ ཤེས་པ་ དང་ ། མི་ འམ་ ཅིའི་ སྐད་ ཤེས་པ་ དང་ ། ལྟོ་འཕྱེ་ ཆེན་པོ་ -འི་ སྐད་ ཤེས་པ་ ནས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བར་ གྱི་ སྐད་ ཤེས་པ་ སྟེ་ ། བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: “Son of noble family, there are nine types of bodhisattva ornaments of retention: not being intimidated in the midst of a gathering, not being dejected among orators, being fearless in the midst of explaining the Dharma, knowing discretion with regard to questioners, knowing how to give a loosely organized teaching to arrogant people, knowing how to give a well-organized teaching to those well on their way, manifesting as Vajrapāṇi to the pretentious, teaching the destruction by fire at the end of the eon to the deeply attached, and teaching the progression of the path exactly as it is to those fully matured.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ཀྱི་ རྒྱན་ ནི་ དགུ་པོ་ འདི་དག་ སྟེ་ ། དགུ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ ། འཁོར་ གྱི་ ནང་ དུ་ སྤ་ གོང་བ་ མེད་པ་ དང་ ། སྨྲ་བ་ -འི་ ནང་ དུ་ ཞུམ་པ་ མེད་པ་ དང་ ། ཆོས་ བཤད་པ་ -འི་ ནང་ དུ་ འཇིགས་པ་ མེད་པ་ དང་ ། འདྲི་བ་ རྣམས་ ལ་ ངེས་པར་ འབྱུང་བ་ ཤེས་པ་ དང་ ། མངོན་པ་ -འི་ ང་རྒྱལ་ཅན་ རྣམས་ ལ་ སྣྲེལ་ ཞི་ -ར་ བསྟན་པ་ ཤེས་པ་ དང་ ། ཡང་དག་པ་ -ར་ ཞུགས་པ་ རྣམས་ ལ་ རྗེས་སུ་ འཐུན་པ་ བསྟན་པ་ ཤེས་པ་ དང་ ། ཁེངས་པ་ དག་ ལ་ ལག་ ན་ རྡོ་རྗེ་ སྟོན་པ་ དང་ ། མངོན་པར་ ཆགས་པ་ རྣམས་ ལ་ སྲེག་པ་ -འི་ བསྐལ་པ་ སྟོན་པ་ དང་ ། ཡོངས་སུ་ སྨིན་པ་ རྣམས་ ལ་ ཐེག་པ་ -འི་ རིམ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སྟོན་པ་ སྟེ་ ། དགུ་པོ་ འདི་དག་ གོ་ ། །
