Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: He supplicated the Blessed One and said, “Blessed One, I will delight in offering this array of ornaments, which is not constructed, is not disorderly, does not grow old, and does not deteriorate, to the Tathāgata Maitreya, as well as to all those other tathāgata, arhat, completely and perfectly awakened buddhas of the Good Eon who are not present here.”
bo: བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། ། བཅོམ་ལྡན་འདས་ བདག་ རྒྱན་ བཀོད་པ་ ། རྣམ་པ་ -ར་ མ་ བརྟགས་པ་ ། མ་ འཁྲུགས་པ་ ། མ་ རྙིངས་པ་ ། མ་ ཉམས་པ་ འདི་ -ས་ དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ་ དང་ ། དེ་ མ་ ལགས་པ་ བསྐལ་པ་ བཟང་པོ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ གཞན་ ཐམས་ཅད་ ལ་ -འང་ མཆོད་པ་ བགྱིད་པ་ -ར་ སྤྲོའོ་ ། །

source: At that time, a being called Magical Display of Māra, hailing from the four-continent world system Susthita and seated in that very retinue, asked the bodhisattva Sovereign of the Magical Display of All Phenomena,
bo: དེ་ -འི་ ཚེ་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ཞེས་ བྱ་བ་ ། ཤིན་ཏུ་ གནས་པ་ -འི་ གླིང་བཞི་པ་ ན་ གནས་པ་ འཁོར་ དེ་ཉིད་ དུ་ འདུག་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “Son of noble family, how long can any receptacle of yours preserve this array and keep it from getting old?”
bo: རིགས་ ཀྱི་ བུ་སྣོད་ གང་ གིས་ བཀོད་པ་ འདི་ རྙིངས་པ་ -ར་ གྱུར་ གྱི་ བར་ དུ་ འཛིན་པ་ -འི་ ཁྱོད་ ཀྱི་ སྣོད་ དེ་ ཇི་ཙམ་ ཞིག་ །

source: The bodhisattva replied,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ -ས་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “Son of noble family, every receptacle is fragile and liable to break.
bo: རིགས་ ཀྱི་ བུ་སྣོད་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ ནི་ འཆགས་པ་ -ར་ འགྱུར་བ་ ། བར་ དུ་ གཅོད་པ་ དང་ བཅས་པ་ དག་ གོ་ ། །

source: Only space is indestructible and not liable to break. Therefore, the receptacle of space is the best of all.
bo: ནམ་མཁའ་ ནི་ མི་ ཤིགས་པ་ ། བར་ དུ་ གཅོད་པ་ མེད་པ་ སྟེ་ སྣོད་ དེ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ ཡིན་ ནོ་ ། །

source: My friend, look at my body without closing your eyes, and you will see a great receptacle.”
bo: གྲོགས་པོ་ མིག་ མ་ འཛུམས་པ་ -ར་ ང་ -འི་ ལུས་ ལ་ ལྟོས་ ཤིག་ དང་ ། སྣོད་ ཆེན་པོ་ མཐོང་བ་ -ར་ འགྱུར་ རོ་ ། །

source: Magical Display of Māra gazed at the body of the bodhisattva with his eyes wide open.
bo: དེ་ནས་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ ལུས་ ལ་ མིག་ མི་ འཛུམས་པ་ -ར་ བལྟས་པ་ དང་ །

source: He saw a world sphere called Appearance of the Sovereign of Water in the maṇḍala at the navel center of the bodhisattva’s body and asked,
bo: དེ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ ལུས་ ཀྱི་ དཀྱིལ་ ལྟེ་བ་ -འི་ དཀྱིལ་འཁོར་ ན་ ཆུ་ -འི་ རྒྱལ་པོ་ -ར་ སྣང་བ་ ཞེས་ བྱ་བ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐོང་ ངོ་ ། །

source: “Why is that world sphere called Appearance as the Sovereign of Water?”
bo: ཅིའི་ཕྱིར་ ཆུ་ -འི་ རྒྱལ་པོ་ -ར་ སྣང་བ་ ཞེས་ བྱ་ ཞེ་ན་ །

source: “Because it is full of water. It looks just like an ocean.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ཆུས་ རབ་ཏུ་ གང་ སྟེ་ རྒྱ་མཚོ་ གཅིག་པ་ ལྟར་ སྣང་ངོ་ ། །

source: In that sphere lives a tathāgata known as Glory of Precious Blue Lotus.
bo: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ཨུད་པ་ ལ་ -འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ སོ་ ། །

source: He dwells there and teaches the Dharma to passing bodhisattvas.
bo: འཚོ་ -འོ་ ། ། གཞེས་ སོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ ཉི་ཚེ་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏོ་ ། །

source: From that vast reservoir of water emerges a lotus with jeweled designs on which are seated a blessed one and bodhisattvas.”
bo: ཆུ་ -འི་ ཕུང་པོ་ དེ་ལས་ རིན་པོ་ཆེ་ བཀོད་པ་ -འི་ པད་མ་ མངོན་པར་ འཕགས་ ཏེ་ ། དེ་ ལ་ བཅོམ་ལྡན་འདས་ དེ་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ བཞུགས་ སོ་ ། །

source: Magical Display of Māra joined his palms together to salute the bodhisattva, who asked him,
bo: དེ་ནས་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -ས་ ཐལ་མོ་ སྦྱར་ ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ ལ་ ཕྱག་ འཚལ་ ཏོ་ ། ། དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ -ས་ ། བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “My friend, do you see the receptacle of the bodhisattvas?”
bo: གྲོགས་པོ་ ཁྱོད་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྣོད་ མཐོང་ ངམ་ །

source: He replied, “Yes, I see it.
bo: སྨྲས་པ་ མཐོང་ ངོ་ ། །

source: Noble being, with such a receptacle as this, will you be able to preserve a great jeweled design without it wasting away or getting old for billions of eons?”
bo: སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ ཀྱིས་ སྣོད་ འདི་ ལྟ་བུ་ འདི་ -ས་ བསྐལ་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ དུ་ རིན་པོ་ཆེ་ བཀོད་པ་ ཆེན་པོ་ མ་ སྐམས་པ་ ། མ་ རྙིངས་པ་ འདི་ འཛིན་པ་ -ར་ ནུས་ སམ་ །

source: At that point, Magical Display of Māra saluted the Blessed One and said,
bo: དེ་ནས་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ ཕྱག་ འཚལ་ ཏེཚིག་ འདི་སྐད་ ཀྱང་ སྨྲ་ -ས་ སོ་ ། །

source: “Blessed One, I have never seen this noble person before.
bo: བཅོམ་ལྡན་འདས་ བདག་ གིས་ སྔོན་ཆད་ སྐྱེས་བུ་ དམ་པ་ འདི་ ཡང་ མ་ མཐོང་ ངོ་ ། །

source: Since I have never heard this Dharma discourse either, I wonder now, how will I pass quickly beyond sorrow by means of the Śrāvaka Vehicle?
bo: ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ -འང་ མ་ ཐོས་པ་ -ས་ ཅི་ བདག་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -ས་ མྱུར་ དུ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -ར་ བགྱི་ -འམ་ སྙམ་པ་ ལས་ །

source: Now that I have heard this discourse and witnessed the miraculous power of the bodhisattva called Magical Display of All Phenomena, I will generate with determination the mind of unsurpassed, complete and perfect awakening.
bo: དེང་ བདག་ གིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ -འང་ ཐོས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ -འི་ བྱིན་ གྱི་ རླབས་ འདི་ ཡང་ མཐོང་བ་ -ས་ ལྷག་པ་ -འི་ བསམ་པ་ -ས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ -ར་ བགྱི་ -འོ་ ། །

source: Blessed One, even beings who burn in hell for as many eons as there are grains of sand in the river Ganges will eventually awaken to unsurpassed, complete and perfect awakening. Therefore, I will never give up such unsurpassed, complete and perfect awakening!”
bo: བཅོམ་ལྡན་འདས་ གལ་ཏེ་ བསྐལ་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དུ་ སེམས་ཅན་ དམྱལ་བ་ ཆེན་པོ་ -ར་ བསྲེགས་ ལ་ ། དེ་ -འི་ འོག་ ཏུ་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ -ར་ འགྱུར་ དུ་ ལགས་ ཀྱང་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ འདི་ ལྟ་བུ་ ཡོངས་སུ་ མི་ གཏོང་ ངོ་ ། །

source: The Blessed One replied, “Excellent!
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བདུད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ ལ་ ལེགས་ སོ་ ཞེས་ བྱ་བ་ གནང་ སྟེ་ །

source: It is excellent that you, O noble being, now wear the armor of unsurpassed, complete and perfect awakening and possess the blessing of miraculous power.”
bo: སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ ཀྱིས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ གོ་ཆ་ བགོས་པ་ དང་ ། རྣམ་པ་ -ར་ སྤྲུལ་པ་ -འི་ བྱིན་ གྱི་ རླབས་ འདི་ ལྟ་བུ་ དང་ ལྡན་པ་ -ར་ འགྱུར་བ་ ལེགས་ སོ་ ལེགས་ སོ་ ། །

source: At that point a bodhisattva called Siṃhaketu, who was also present in the assembled retinue, said to Dhāraṇīśvara­rāja,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེང་གེ་ -འི་ ཏོག་ ཅེས་བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་པ་ -ར་ གྱུར་ ཏེ་ འདུག་པ་ དེ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “Son of noble family, when bodhisattvas are established in dhāraṇīs, they retain all that the buddhas say, and when they teach the Dharma it becomes inexhaustible.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ གཟུངས་ གང་ ལ་ རབ་ཏུ་ གནས་ ན་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་པ་ དང་ ། ཆོས་ བསྟན་པ་ ན་ ཟད་པར་ མི་འགྱུར་བ་ དང་ །

source: Explaining it carefully, they satisfy all beings. What are the bodhisattva dhāraṇīs?”
bo: ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ -ར་ འགྱུར་བ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ གང་ཡིན་ །

source: Dhāraṇīśvara­rāja replied,
bo: དེ་སྐད་ ཅེས་ སྨྲས་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེང་གེ་ -འི་ ཏོག་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “Son of noble family, when bodhisattvas are established in dhāraṇīs, they retain all that the blessed buddhas say, and when they teach the Dharma it becomes inexhaustible.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ གཟུངས་ གང་དག་ ལ་ རབ་ཏུ་ གནས་ ན་ ། སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་པ་ དང་ ། ཆོས་ བསྟན་པ་ ན་ ཟད་པར་ མི་འགྱུར་བ་ དང་ །

source: Since they explain it carefully, they satisfy all beings.
bo: ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ -ར་ འགྱུར་བ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ནི་ བརྒྱད་པོ་ འདི་དག་ གོ་ ། །

source: The bodhisattva dhāraṇīs are eight:
bo: བརྒྱད་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ །

source: the pure melody dhāraṇī, inexhaustible basket dhāraṇī, limitless enfoldment dhāraṇī, ocean mudrā dhāraṇī, lotus array dhāraṇī, entering the gate of nonattachment dhāraṇī, entering ascertainment by discriminating knowledge dhāraṇī, and blessing of the buddha ornaments dhāraṇī.
bo: སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། མི་ཟད་པ་ -འི་ ཟ་མ་ཏོག་ ཅེས་བྱ་བ་ -འི་ གཟུངས་ དང་ ། འཁྱིལ་པ་ མཐའ་ཡས་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། རྒྱ་མཚོ་ -འི་ ཕྱག་རྒྱ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། པད་མ་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། ཆགས་པ་ མེད་པ་ -འི་ སྒོར་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ རྣམ་པ་ -ར་ ངེས་པ་ ལ་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དང་ ། སངས་རྒྱས་ ཀྱི་ རྒྱན་ བྱིན་ གྱིས་ བརླབས་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ ཏེ་ །

source: “Son of noble family, these are the eight bodhisattva dhāraṇīs.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ གཟུངས་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: Once bodhisattvas are established in these dhāraṇīs, they retain all that the buddhas say,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ གཟུངས་ འདི་དག་ ལ་ རབ་ཏུ་ གནས་ ནས་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ ཀུན་ དུ་ འཛིན་ ཏོ་ ། །

source: and when they teach the Dharma it becomes inexhaustible.
bo: ཆོས་ བསྟན་པ་ ན་ ཟད་པར་ མི་ འགྱུར་ རོ་ ། །

source: Since they explain it carefully, they satisfy all beings.”
bo: ལེགས་པ་ -ར་ བཤད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཚིམ་པ་ -ར་ བྱེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Then Siṃhaketu entreated Dhāraṇīśvara­rāja,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེང་གེ་ -འི་ ཏོག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ སྨྲ་ -ས་ སོ་ ། །

source: “Son of noble family, be eloquent and teach the introduction to the detailed classification of these dhāraṇīs that lead to zeal, in order that the bodhisattvas who hear this introduction will attain these dhāraṇīs.”
bo: རིགས་ ཀྱི་ བུ་ ཁྱོད་ བྱང་ཆུབ་ སེམས་དཔའ་ -ས་ གང་ ཐོས་པ་ -ས་ གཟུངས་ འདི་དག་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ བརྩོན་པ་ -ར་ འགྱུར་བ་ -འི་ གཟུངས་ འདི་དག་ རྒྱ་ ཆེ་ -ར་ རྣམ་པ་ -ར་ དབྱེ་བ་ ལ་ འཇུག་པ་ བསྟན་པ་ ལ་ སྤོབས་པ་ -ར་ གྱིས་ ཤིག་ །

source: Dhāraṇīśvara­rāja replied,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ སྨྲས་པ་ །

source: “For that reason, son of noble family, listen carefully and keep in mind the introduction to the detailed classification of these dhāraṇīs that I will now explain to you.
bo: དེ་ -འི་ ཕྱིར་ རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ ཤིན་ཏུ་ ལེགས་པ་ -ར་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ ། གཟུངས་ འདི་དག་ རྒྱ་ ཆེ་ -ར་ རྣམ་པ་ -ར་ དབྱེ་བ་ ལ་ འཇུག་པ་ ཁོ་བོ་ -ས་ ཁྱོད་ ལ་ བཤད་པ་ -ར་ བྱ་ -འོ་ ། །

source: “Son of noble family, you may ask, ‘What is the pure melody dhāraṇī?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ གཟུངས་ གང་ཞེ་ན་ །

source: Son of noble family, when established in this bodhisattva dhāraṇī, since it is a completely pure gateway for entering nonattachment, one firmly abides with a mind that is centered.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ འདི་ ལ་ རབ་ཏུ་ གནས་པ་ ན་ ཆགས་པ་ མེད་པ་ ལ་ འཇུག་པ་ -འི་ སྒོ་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ དག་པ་ -ས་ སྙིང་པོ་ དང་ ལྡན་པ་ -འི་ བློ་ -ས་ ཤིན་ཏུ་ གནས་ ཏེ

source: After one has gained certainty due to the blessings of the Dharma teaching, as one teaches the Dharma the melody of the Dharma generates understanding in a single buddhafield.
bo: ཆོས་ བསྟན་པ་ -འི་ བྱིན་ གྱི་ རླབས་ ངེས་པར་ བྱས་ ནས་ ཆོས་སྟོན་པ་ ན་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གཅིག་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ བྱེད་ དོ་ ། །

source: The melody generates understanding in two, three, four, five, ten, twenty, thirty, forty, fifty, or one hundred buddhafields.
bo: གཉིས་ སམ་ ། གསུམ་ མམ་ ། བཞི་ -འམ་ ། ལྔ་ -འམ་ ། བཅུ་ -འམ་ ། ཉི་ཤུ་ -འམ་ ། སུམ་ཅུ་ -འམ་ ། བཞི་ བཅུ་ -འམ་ ། ལྔ་ བཅུ་ -འམ་ ། བརྒྱ་ ཡང་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ བྱེད་ དོ་ ། །

source: It generates understanding in one thousand buddhafields, in ten, twenty, thirty, forty, fifty, or up to one hundred thousand buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ སྟོང་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ བྱེད་པ་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ སྟོང་ཕྲག་ བཅུ་ -འམ་ ། ཉི་ཤུ་ -འམ་ ། སུམ་ཅུ་ -འམ་ ། བཞི་ བཅུ་ -འམ་ ། ལྔ་ བཅུ་ -འམ་ ། བརྒྱ་ -འི་ བར་ དུ་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ བྱེད་ དོ་ ། །

source: Its melody creates understanding in billions of buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ཕྲག་ མཐའ་ ཡས་ མུ་མེད་པ་ -འི་ བར་ དག་ དབྱངས་ ཀྱིས་ གོ་བ་ -ར་ བྱེད་ དོ་ ། །

source: It magically creates a lion throne that reaches as high as one krośa.
bo: དེ་ -ས་ རྒྱང་གྲགས་ ཀྱི་ ཚད་ ཙམ་ གྱི་ སེང་གེ་ -འི་ ཁྲི་ བྱིན་ གྱིས་ བརླབས་ ཏེ་ །

source: One sits down on it and teaches the Dharma.
bo: དེ་ ལ་ འདུག་ ནས་ ཆོས་སྟོན་ ཏོ་ ། །

source: Likewise, in order to satisfy the interests of devoted beings, one magically creates a lion throne that reaches as high as half a yojana, a full yojana, Mount Meru, or the Brahmā realm.
bo: ཇི་ལྟར་ མོས་པ་ -འི་ སེམས་ཅན་ རྣམས་ མོས་པ་ དེ་ལྟ་ བུས་ ཚིམ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དཔག་ཚད་ ཕྱེད་ ཀྱི་ ཚད་ ཙམ་ མམ་ ། དཔག་ཚད་ ཀྱི་ ཚད་ ཙམ་ མམ་ ། རི་རབ་ ཀྱི་ ཚད་ ཙམ་ མམ་ ། ཚངས་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཚད་ ཙམ་ གྱི་ སེང་གེ་ -འི་ ཁྲི་ བྱིན་ གྱིས་ བརླབས་ ཏེ་ །

source: One sits down on it and teaches the Dharma.
bo: དེ་ ལ་ འདུག་ ནས་ ཆོས་སྟོན་ ཏོ་ ། །

source: “While seated on the lion throne, all the buddhas of the ten directions appear.
bo: དེ་ལྟར་ སེང་གེ་ -འི་ ཁྲི་ དེ་ ལ་ འདུག་པ་ ན་ ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཐམས་ཅད་ སྣང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: One hears all the dharmas that the blessed buddhas explain.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་དག་ གིས་ ཆོས་ གང་ བཤད་པ་ དེ་ ཐམས་ཅད་ ཀྱང་ ཐོས་ སོ་ ། །

source: Having heard them, one retains all of them through the power of dhāraṇī and does not forget them.
bo: ཐོས་ ནས་ ཀྱང་ གཟུངས་ ཀྱི་ སྟོབས་ ཀྱིས་ ཀུན་ དུ་ འཛིན་ ཏོ་ ། ། མི་ བརྗེད་ དོ་ ། །

source: Such dharmas cause one to experience the meaning of each of the dharmas.
bo: ཆོས་ དེ་ -ས་ ཆོས་ ཀྱི་ དོན་ སོ་སོ་ -ར་ མྱོང་བ་ -ར་ བྱེད་ དོ་ ། །

source: Listening to other dharmas does not prevent one from teaching the Dharma.
bo: དེ་ ཆོས་ གཞན་ ཉན་པ་ -ས་ ཆོས་སྟོན་པ་ ལ་ སྒྲིབ་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: Teaching the Dharma does not prevent one from listening to the Dharma.
bo: ཆོས་སྟོན་པ་ -ས་ ཆོས་ ཉན་པ་ ལ་ སྒྲིབ་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: By engaging in the sound of a single syllable, one engages in the sounds of all syllables.
bo: ཡི་གེ་ -འི་ སྒྲ་ གཅིག་ ལ་ འཇུག་པ་ -ས་ ཡི་གེ་ -འི་ སྒྲ་ ཐམས་ཅད་ ལ་ འཇུག་པ་ སྟོན་ ཏོ་ ། །

source: Thus, by uttering the first letter a, infinite doors to the Dharma are expressed.
bo: ཡི་གེ་ -འི་ དང་པོ་ ཨ་ཞེ་ -ས་ བྱ་བ་ བརྗོད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཀྱི་ སྒོ་ མཐའ་ཡས་པ་ བརྗོད་ དེ་ །

source: “All phenomena are without coming because they never come, unmoving because they never depart, nonabiding because they are never present, natureless because they are primordially pure, rootless because they are primordially unborn, limitless because they never occur, and without depletion because they are never in motion.
bo: འདི་ལྟ་སྟེ་ ། འོང་བ་ མེད་པ་ -འི་ མཚན་ཉིད་ ཀྱི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ འོང་བ་ མེད་པ་ -འོ་ ། ། འཕོ་བ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ སོང་བ་ མེད་པ་ -འོ་ ། ། གནས་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ གནས་པ་ མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ མ་ སྐྱེས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྩ་བ་ མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ བྱུང་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མཐའ་མ་ མེད་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ འགྲོ་བ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ ཟད་པ་ མེད་པ་ -འོ་ ། །

source: All phenomena are unborn because they are without conditioning, nonarising because they have no creator, without origination because they are unmoving, without discord because they are reciprocally intertwined, unceasing because they are without agency, unmoving because they are wishless, free of elaboration because they are unthinkable and nonconceptual, inexpressible because they have engaged all sound, unutterable because they are soundless, indemonstrable because they do not endure in any form, unconstructed because they are unthinkable, without conceit because they are unestablished, unconceited because they undeceiving, and imperceptible because they are equal to space.
bo: མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ མ་ སྐྱེས་པ་ -འོ་ ། ། བྱེད་པ་པོ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ སྐྱེ་བ་ མེད་པ་ -འོ་ ། ། རྒྱུ་བ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ འབྱུང་བ་ མེད་པ་ -འོ་ ། ། ཕན་ཚུན་ ཡང་དག་པ་ -ར་ འདུ་བ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ མི་ འཐུན་པ་ མེད་པ་ -འོ་ ། ། བདག་པོ་ མེད་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ མ་ འགགས་པ་ -འོ་ ། ། སྨོན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྒྱུ་བ་ མེད་པ་ -འོ་ ། ། མི་ རྟོག་ ཅིང་ རྣམ་པ་ -ར་ མི་ རྟོག་པ་ -འི་ ཚུལ་ གྱིས་ ཆོས་ ཐམས་ཅད་ ནི་ སྤྲོས་པ་ མེད་པ་ -འོ་ ། ། ཤིན་ཏུ་ སྒྲ་ ལ་ ཞུགས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྗོད་པ་ མེད་པ་ -འོ་ ། ། སྒྲ་མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྨྲ་བ་ མེད་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ གནས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བསྟན་ དུ་ མེད་པ་ -འོ་ ། ། རྟོག་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ བརྟགས་པ་ མ་ཡིན་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ བསྒྲུབས་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རློམ་སེམས་ མེད་པ་ -འོ་ ། ། རློམ་སེམས་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཡོ་བ་ མེད་པ་ -འོ་ ། ། ནམ་མཁའ་ དང་ མཉམ་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ ཤེས་པ་ མེད་པ་ -འོ་ ། །

source: “All phenomena are beyond conventional terms because they have no means of expression, without arising because they do not abide in any object, unborn because they do not abide in any place, primordially pure because they lack afflictive emotions, without self because they lack a nature of their own, without sentient beings because they are primordially pure, without life because of the absence of faculties, without individuality because they are aimless, and primordially empty because of inner peace.
bo: ཚིག་ གི་ ལམ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཐ་སྙད་ མེད་པ་ -འོ་ ། ། ཡུལ་ ན་ མི་ གནས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གནས་ མེད་པ་ -འོ་ ། ། ཕྱོགས་ ན་ མི་ གནས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྐྱེ་བ་ མེད་པ་ -འོ་ ། ། ཉོན་མོངས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -འོ་ ། ། བདག་ གི་ རང་བཞིན་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བདག་མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སེམས་ཅན་ མེད་པ་ -འོ་ ། ། དབང་པོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྲོག་མེད་པ་ -འོ་ ། ། དོན་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གང་ཟག་ མེད་པ་ -འོ་ ། ། ནང་ཉེ་ བར་ ཞི་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ སྟོང་པ་ -འོ་ ། །

source: “All phenomena are beyond conceptual signs because they are without limitations, wishless because they lack grasping, without conditioning because they are unconditioned, unconditioned because they completely transcend presence and absence, exceptional because they do not rely on anything external, without acceptance because they are without appropriation, without rejection because they are without abandonment, natureless because they are without bodies, lacking aspects because they are pure, actionless because they lack an agent, without maturation because they lack transmigration, and without anguish because of the absence of any seeds.
bo: མཐའ་མེད་པ་ -ར་ གྱུར་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། ། ཉེ་བར་ ལེན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྨོན་པ་ མེད་པ་ -འོ་ ། ། འདུས་བྱས་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ -འོ་ ། ། གནས་ མེད་པ་ དང་ ། གནས་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདུས་མ་བྱས་པ་ -འོ་ ། ། གཞན་ གྱི་ དྲིང་ མི་ འཇོག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཐུན་མོང་ མ་ཡིན་པ་ -འོ་ ། ། ལེན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བླང་བ་ མེད་པ་ -འོ་ ། ། འདོར་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ དོར་བ་ མེད་པ་ -འོ་ ། ། ལུས་མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ མེད་པ་ -འོ་ ། ། བྱེད་པ་པོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ལས་ མེད་པ་ -འོ་ ། ། འཕོ་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ སྨིན་པ་ མེད་པ་ -འོ་ ། ། ས་བོན་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གདུང་བ་ མེད་པ་ -འོ་ ། །

source: “All phenomena are signless because of the absence of apprehending, without wrong acts because they are not bound, unbound because they are not established, unestablished because they are not created, uncontaminated because they are not subject to contamination, unoriginated because they are primordially without origin, clear because they lack remedies, lacking remedies because they lack differentiated aspects, without materiality because they do not originate from the great elements, lacking feeling because of the absence of feeling, lacking perception because they completely transcend the pathways of perception, lacking formations because they are free of craving, and lacking consciousness because of the absence of discriminating knowledge.
bo: འཛིན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། ། མདུད་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ལོག་པ་ -འི་ ལས་ མེད་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ བསྒྲུབས་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མདུད་པ་ མེད་པ་ -འོ་ ། ། བྱས་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ བསྒྲུབས་པ་ མ་ཡིན་པ་ -འོ་ ། ། ཟག་པ་ མི་ སློང་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཟག་པ་ མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ བྱུང་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མ་བྱུང་བ་ -འོ་ ། ། གཉེན་པོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གསལ་བ་ -འོ་ ། ། རྣམ་པ་ སྣ་ཚོགས་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཉེན་པོ་ མེད་པ་ -འོ་ ། ། འབྱུང་བ་ ཆེན་པོ་ ལས་མ་ བྱུང་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟུགས་ཅན་ མ་ཡིན་པ་ -འོ་ ། ། ཚོར་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཚོར་བ་ མེད་པ་ -འོ་ ། ། འདུ་ཤེས་ ཀྱི་ ལམ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདུ་ཤེས་ མེད་པ་ -འོ་ ། ། སྲེད་པ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདུ་བྱེད་པ་ མེད་པ་ -འོ་ ། ། སོ་སོ་ -ར་ རྣམ་པ་ -ར་ རིག་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ ཤེས་པ་ མེད་པ་ -འོ་ ། །
