Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: Due to that the tathāgata wisdom penetrates unchallenged.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ནི་ ཟིལ་ གྱིས་ མི་ ནོན་པ་ སྟེ་ འདི་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ ནི་ ཟིལ་ གྱིས་ མི་ ནོན་པ་ -ར་ འཇུག་ གོ་ ། །

source: “The tathāgatas know the instructions and guidance by which śrāvakas cultivate their meditative absorptions.
bo: གདམས་པ་ གང་ དང་ རྗེས་སུ་ བསྟན་པ་ གང་ གིས་ ཉན་ཐོས་ རྣམས་ ཏིང་ངེ་འཛིན་ སྐྱེད་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: Likewise, they know those by which pratyekabuddhas and bodhisattvas cultivate theirs.
bo: དེ་བཞིན་ དུ་ རང་ སངས་རྒྱས་ དང་ ། དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: Understanding these, they instruct and guide beings accordingly.
bo: མཁྱེན་ ནས་ ཀྱང་ དེ་བཞིན་ དུ་ འདོམས་ ཤིང་ དེ་བཞིན་ དུ་ རྗེས་སུ་ སྟོན་ ཏེ་ །

source: This is the seventh tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བདུན་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘Through their naturally occurring wisdom, The victors know all the causes and conditions for beings’ pollution.
bo: འདི་ -ར་ ནི་ འགྲོ་བ་ -འི་ ཀུན་ ནས་ ཉོན་མོངས་ རྒྱུ་ དང་ རྐྱེན་ ། ། རྒྱལ་བ་ རང་བྱུང་ ཡེ་ཤེས་ ལྡན་པ་ -ས་ དེ་ ཀུན་མཁྱེན་ ། །

source: Likewise, the Dharma lords know the causes and conditions Of purification engendered by striving.
bo: དེ་བཞིན་ མངོན་པར་ བརྩོན་ རྒྱུས་ རྣམ་དག་ འགྱུར་བ་ ཡི་ ། ། རྒྱུ་ དང་ རྐྱེན་ དེ་ ཆོས་ ཀྱི་ རྗེས་ ནི་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘The cause is what is improper, and the condition is ignorance. The cause is ignorance, and the condition is the formations.
bo: ཚུལ་བཞིན་ མ་ ཡིན་ རྒྱུ་ སྟེ་ རྐྱེན་ ནི་ མ་རིག་པ་ ། ། རྒྱུ་ ནི་ མ་རིག་པ་ སྟེ་ རྐྱེན་ ནི་ འདུ་བྱེད་ ཡིན་ ། །

source: Consciousness, name and form, and the six sense faculties Are all causes and conditions for wandering through the stages of existence.
bo: རྣམ་པ་ -ར་ ཤེས་ དང་ མིང་ དང་ གཟུགས་ དང་ དབང་པོ་ དྲུག་ ། ཐམས་ཅད་ སྲེད་པ་ -འི་ ཡན་ལག་ འགྲོ་བ་ -འི་ རྒྱུ་ དང་ རྐྱེན་ ། །

source: “ ‘It is taught that afflictive emotions are causes and actions are conditions,
bo: ཉོན་མོངས་ རྣམས་ ནི་ རྒྱུ་ སྟེ་ དེ་བཞིན་ ལས་ རྣམས་ རྐྱེན་ ། །

source: Views are causes and craving the condition.
bo: ལྟ་བ་ རྒྱུ་ སྟེ་ དེ་བཞིན་ སྲེད་པ་ རྐྱེན་ དུ་ གསུངས་ ། །

source: Entanglements and their latent tendencies are causes for this.
bo: ཀུན་ དུ་ སྦྱོར་ དང་ བག་ ལ་ ཉལ་ འདི་ འདི་ -ར་ རྒྱུ་ སྟེ་ ། །

source: People subject to these causes are conditioned like that.
bo: མི་གང་ རྒྱུ་ལས་ ཀུན་ དུ་ བྱུང་བ་ དེ་ འདི་ -ར་ རྐྱེན་ ། །

source: “ ‘There are different pairs of causes or conditions for beings’ purification.
bo: འགྲོ་བ་ རྣམ་དག་ འགྱུར་བ་ -འི་ རྒྱུ་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། །

source: Hearing the agreeable sound of the Dharma from another and, having heard it, Correctly realizing phenomena to be inherently empty
bo: གཞན་ ལས་ འཐུན་པ་ -འི་ སྒྲ་ ཐོས་པ་ དང་ ཐོས་ ནས་ ཀྱང་ ། ། ཆོས་ རྣམས་ སྟོང་པ་ -ར་ ནང་ དུ་ ཚུལ་བཞིན་ རྟོག་ བྱེད་པ་ ། །

source: Liberates them from the ocean of existence.
bo: དེ་ ནི་ སྲིད་པ་ -འི་ མཚོ་ ལས་ རྣམ་པ་ -ར་ སྒྲོལ་བ་ -ར་ འགྱུར་ ། །

source: “ ‘Uniting tranquil abiding and special insight,
bo: ཞི་གནས་ ལྷག་མཐོང་ གཉི་ག་ ཟུང་ དུ་ འབྲེལ་ ལྡན་པ་ ། །

source: Meditating without any coming or going,
bo: སྒོམ་པ་ གང་ དུའང་ འགྲོ་བ་ མེད་ ཅིང་ འོང་བ་ མེད་ ། །

source: Where there is no birth, no death, transference, or thought,
bo: དེ་ ལ་ སྐྱེ་ མེད་ འཆི་ འཕོ་ དང་ ནི་ རྟོག་ མེད་ དེ་ ། །

source: And reaching the immaculate, one becomes purified.
bo: དེ་ ནི་ སྐྱོན་མེད་ རེག་ ཅིང་ རྣམ་པ་ -ར་ དག་པ་ -ར་ འགྱུར་ ། །

source: “ ‘Endowed with virtuous conduct and threefold knowledge, there is relaxation.
bo: རྐང་པ་ -ར་ ལྡན་ ནས་ རིག་པ་ གསུམ་ ནི་ རྗེས་སུ་ ཉལ་ ། །

source: Becoming heedful, one cultivates the three gates of liberation.
bo: བག་ ཡོད་ གྱུར་ ནས་ རྣམ་ཐར་ གསུམ་ གྱི་ སྒོ་ ལ་ སྒོམ་ ། །

source: One knows depletion and nonorigination and attains the truth.
bo: ཟད་པ་ དང་ ནི་ མི་ སྐྱེ་ ཤེས་ དང་ བདེན་པ་ ཐོབ་ ། །

source: These are the causes and conditions that direct one onto the path of purification.
bo: འདི་ ནི་ རྣམ་དག་ ལམ་ དུ་ འདྲེན་པ་ -འི་ རྒྱུ་ དང་ རྐྱེན་ ། །

source: “ ‘Attaining the first concentration, The victors reach cessation and emerge accordingly with mindfulness.
bo: རྒྱལ་བ་ བསམ་གཏན་ གཅིག་ ལ་ ཡང་དག་ སྙོམས་ ཞུགས་ ནས་ ། ། འགོག་པ་ -ར་ རེག་ སྟེ་ དེ་བཞིན་ དྲན་ དང་ ལྡན་པ་ -ར་ བཞེངས་ ། །

source: The Dharma kings attain the eight liberations In sequence, out of sequence, and in nonsequential order.
bo: རྗེས་སུ་ འཐུན་ དང་ མི་ འཐུན་པ་ དང་ ཐོད་རྒལ་ དུ་ ། ། ཆོས་ ཀྱི་ རྒྱལ་པོ་ རྣམ་ཐར་ བརྒྱད་ ལ་ སྙོམས་པར་ འཇུག་ །

source: “ ‘The incomparable abide in a state of equality,
bo: མཚུངས་པ་ མེད་པ་ མཉམ་པ་ཉིད་ ལ་ གནས་ ནས་ ནི་ ། །

source: Displaying countless absorptions from a single absorption.
bo: ཏིང་འཛིན་ གཅིག་ ལས་ ཏིང་འཛིན་ བྱེ་བ་ མཐའ་ ཡས་ སྟོན་ ། །

source: Their minds are not mixed up in this, and they have no thoughts about phenomena.
bo: སེམས་ ལ་ འདྲེས་པ་ མེད་ ཅིང་ ཆོས་ ལ་ རྣམ་རྟོག་ མེད་ ། །

source: Therefore, for the victors, their minds are never not in meditative equipoise.
bo: དེ་ཕྱིར་ རྒྱལ་བ་ མཉམ་པ་ -ར་ མ་ བཞག་ སེམས་ ཀྱང་ མེད་ ། །

source: All the millions of śrāvaka and pratyekabuddha absorptions And the absorptions of bodhisattvas.
bo: གང་དག་ ཉན་ཐོས་ དེ་བཞིན་ རང་རྒྱལ་ ཏིང་ངེ་འཛིན་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་འཛིན་ རྣམ་པ་ བྱེ་བ་ དག་ །

source: “ ‘A sugata’s absorption surpasses
bo: དེ་ ཀུན་ བདེ་གཤེགས་ ཏིང་ངེ་འཛིན་ གྱི་ ཟིལ་ གྱིས་ ནོན་ ། །

source: Knowing and being skilled in their instructions is the activity of the sugatas.’
bo: གདམས་པ་ ཤེས་ ལ་ མཁས་པ་ བདེ་གཤེགས་ འཕྲིན་ལས་ སོ་ ། །

source: “Moreover, son of noble family, the tathāgatas can recollect their own and other beings’ and other individuals’ various former existences.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བདག་ དང་སེམས་ ཅན་ གཞན་ རྣམས་ དང་ ། གང་ཟག་ གཞན་དག་ གི་ སྔོན་ གྱི་ གནས་ རྣམ་པ་ དུ་མ་ རྗེས་སུ་ དྲན་ ནོ་ ། །

source: They can recollect one or two, three or four, five or ten, twenty, thirty, forty, or fifty previous births.
bo: འདི་ལྟ་སྟེ་ ། སྐྱེ་བ་ གཅིག་ རྗེས་སུ་ དྲན་ ནོ་ ། ། གཉིས་ སམ་ ། གསུམ་ མམ་ ། བཞི་ -འམ་ ། ལྔ་ -འམ་ ། བཅུ་ -འམ་ ། ཉི་ཤུ་ -འམ་ ། སུམ་ཅུ་ -འམ་ ། བཞི་ བཅུ་ -འམ་ ། ལྔ་ བཅུ་ -འམ་ །

source: They can recollect one hundred or one thousand, one hundred thousand, or billions of births.
bo: སྐྱེ་བ་ བརྒྱ་ -འམ་ ། སྐྱེ་བ་ སྟོང་ ངམ་ ། སྐྱེ་བ་ བརྒྱ་ ཕྲག་ སྟོང་ ངམ་ ། སྐྱེ་བ་ བྱེ་བ་ བརྒྱ་ ཕྲག་ སྟོང་ ངམ་ །

source: They can recollect the eon of world destruction, the eon of world formation, and the eon of both destruction and formation.
bo: འཇིག་པ་ -འི་ བསྐལ་པ་ -འམ་ ། འཆགས་པ་ -འི་ བསྐལ་པ་ -འམ་ ། འཇིག་པ་ དང་ འཆགས་པ་ -འི་ བསྐལ་པ་ -འམ་ །

source: They can recollect many eons of destruction, many eons of formation, or many eons of destruction and formation.
bo: འཇིག་པ་ -འི་ བསྐལ་པ་ དུ་མ་ -འམ་ ། འཆགས་པ་ -འི་ བསྐལ་པ་ དུ་མ་ -འམ་ ། འཇིག་པ་ དང་ འཆགས་པ་ -འི་ བསྐལ་པ་ དུ་མ་ རྗེས་སུ་ དྲན་ ནོ་ ། །

source: “ ‘These beings went by this or that name.
bo: སེམས་ཅན་ དེ་དག་ མིང་ འདི་ ཞེས་ བྱ་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: I was born there with that name, in that clan, in that family lineage, eating that food, with that complexion and that shape.
bo: ང་ དེ་ -ར་ བྱུང་ སྟེ་ མིང་ ནི་ འདི་ ཞེས་ བྱ་ ། རུས་ ནི་ འདི་ ཞེས་ བྱ་ ། རིགས་ ནི་ འདི་ ཞེས་ བྱ་ ། ཁ་ཟས་ ནི་ འདི་ ལྟ་བུ་ ཞིག་ ཟ་ ཟ་ ། ཁ་དོག་ ནི་ འདི་ ལྟ་བུ་ ། དབྱིབས་ ནི་ འདི་ ལྟ་བུ་ །

source: I lived there during that period and experienced those joys and those sorrows.
bo: ཡུན་ ནི་ འདི་ སྲིད་ ཞིག་ ཏུ་ གནས་ གནས་ ། བདེ་བ་ དང་ སྡུག་བསྔལ་ ནི་ འདི་ ལྟ་བུ་ ཞིག་ མྱོང་ སྟེ་ །

source: Then, after I died and transmigrated from there, I was reborn as another being.
bo: བདག་ དེ་ནས་ ཤི་འཕོས་ ནས་ ཆེ་གེ་མོ་ ཞིག་ ཏུ་ སྐྱེས་ སོ་ ། །

source: Then, after I died and transmigrated from there, I was born here in this form, in this area, from this region.’
bo: དེ་ནས་ ཤི་འཕོས་ ནས་ འདི་ -ར་ སྐྱེས་པ་ -ར་ རྣམ་པ་ དང་ བཅས་ ། ཡུལ་ཕྱོགས་ དང་ བཅས་ ། གཞི་ ཅི་ ལས་ གྱུར་པ་ དང་ བཅས་པ་ -ར་ བདག་ དང་ །

source: Thus they recollect their own and other beings’ various former existences.
bo: སེམས་ཅན་ གཞན་དག་ གི་ སྔོན་ གྱི་ གནས་ རྣམ་པ་ དུ་མ་ རྗེས་སུ་ དྲན་ ནོ་ ། །

source: “They recollect the former existences of a being.
bo: དེ་ སེམས་ཅན་ དེ་ -འི་ སྔོན་ གྱི་ གནས་ རྗེས་སུ་ དྲན་ ནོ་ ། །

source: How and through which prior causes a given being was born—the tathāgatas know such prior causes.
bo: སྔོན་ གྱི་ རྒྱུ་ ཇི་ལྟ་བུ་ དང་ ། རྒྱུ་ གང་ གིས་ སེམས་ཅན་ གང་ ཀུན་ དུ་ བྱུང་བ་ དེ་ -འི་ སྔོན་ གྱི་ རྒྱུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: Knowing these, they teach the Dharma accordingly.
bo: མཁྱེན་ ནས་ ཀྱང་ དེ་བཞིན་ དུ་ ཆོས་སྟོན་ ཏོ་ ། །

source: “The tathāgatas know the movements of the minds of all past beings.
bo: འདས་པ་ -འི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ རྒྱུ་བ་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that following a given objective reference, there arises a mind having such an objective reference, that it has arisen due to the given objective reference, and that it ceases when this objective reference is incomplete.
bo: སེམས་ ཀྱི་ དམིགས་པ་ གང་ གི་ འོག་ ཏུ་ གང་ ལ་ དམིགས་པ་ -འི་ སེམས་ སྐྱེ་བ་ དང་ ། དམིགས་པ་ གང་ གིས་ སྐྱེས་པ་ དང་ ། དམིགས་པ་ གང་ མ་ཚང་ བས་ འགགས་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: The mind of a single being thus exists as an ongoing continuum, in which a given mind occurs following another. Even if one were to speak for as many eons as there are grains of sand in the river Ganges, it would be difficult to explain this with words.
bo: དེ་ལྟར་ ཇི་ཙམ་ དུ་ སེམས་ཅན་ གཅིག་ གི་ སེམས་ གཅིག་ ནས་ གཅིག་ ཏུ་ བརྒྱུད་ དེ་ འཇུག་པ་ སེམས་ དེ་ལྟ་ བུ་ ཞིག་ གི་ འོག་ ཏུ་ སེམས་ འདི་ ལྟ་བུ་ ཞིག་ བྱུང་བ་ དེ་ བསྐལ་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དུ་ ཡང་ ཚིག་ ཏུ་ བསྟན་པ་ -ས་ བསྟན་པ་ -ར་ དཀའ་ -འོ་ ། །

source: “In this way, the tathāgatas know the ongoing continuums of the individual minds of all sentient beings.
bo: དེ་བཞིན་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱིའང་ དེ་ལྟ་ བུར་ སོ་སོ་ -འི་ སེམས་ གཅིག་ ནས་ གཅིག་ ཏུ་ བརྒྱུད་པ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: Even if the tathāgatas were to explain this until the end of time on the basis of rational analysis, their wisdom would not reach its limit.
bo: ཡོངས་སུ་ བརྟག་པ་ ཉེ་བར་ བཟུང་ སྟེ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཕྱི་མ་ -འི་ མཐའ་ -འི་ མུ་ -ར་ ཐུག་པ་ -ར་ བསྟན་ ཀྱང་ དེ་ -འི་ ཡེ་ཤེས་ མཐར་ཐུག་པ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: The tathāgata knowledge that recollects previous existences is inconceivable, unequaled, and immeasurable.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ སྔོན་ གྱི་ གནས་ རྗེས་སུ་ དྲན་པ་ -འི་ མཁྱེན་པ་ འདི་ ནི་ བསམ་ གྱིས་ མི་ ཁྱབ་ ཅིང་ མཚུངས་པ་ མེད་ ལ་ཚད་ མེད་ དེ་ །

source: Its scope is not easy to explain.
bo: དེ་ -འི་ མཐའ་ -འི་ གནས་ ནི་ བསྟན་པ་ -ར་ སླ་བ་ མ་ ཡིན་ ནོ་ ། །

source: “Having become buddhas, the supreme leaders, the tathāgatas remind beings,
bo: སངས་རྒྱས་ ཀྱི་ ཁྱུ་མཆོག་ ཏུ་ གྱུར་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ དེ་དག་ ལ་ །

source: ‘Hey sentient beings! Roots of virtue generate either buddhahood, śrāvakahood, or pratyekabuddhahood!
bo: ཀྱེ་ སེམས་ཅན་ དག་ དགེ་བ་ -འི་ རྩ་བ་ སངས་རྒྱས་ ལ་ བསྐྱེད་པ་ -འམ་ ། ཉན་ཐོས་ ལ་ བསྐྱེད་པ་ -འམ་ ། རང་ སངས་རྒྱས་ ལ་ བསྐྱེད་པ་ དེ་ལྟ་ བུ་

source: Remember that! Remember!’
bo: དེ་ དྲན་པ་ -ར་ གྱིས་ ཤིག་ ། དྲན་པ་ -ར་ གྱིས་ ཤིག་ ཅེས་ དྲན་པ་ -ར་ མཛད་ དོ་ ། །

source: In this way, through the power of the buddhas, they also become mindful.
bo: འདི་ལྟ་སྟེ་ ། སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ དེ་དག་ གིས་ ཀྱང་ དྲན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “The tathāgatas teach them the Dharma in such a way that on account of the roots of virtue they observe in those beings, they will ensure that, whichever vehicle these beings take, they do not turn back from liberation.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ དེ་དག་ ལ་ དེ་ དགེ་བ་ -འི་ རྩ་བ་ ལ་ དམིགས་པ་ དེ་ -ས་ གང་ གི་ ཕྱིར་ ཅི་ ནས་ ཀྱང་ ཐེག་པ་ -ས་ རྣམ་པ་ -ར་ གྲོལ་བ་ ལས་ ཕྱིར་ མི་ ལྡོག་པ་ -ར་ འགྱུར་བ་ དེ་ལྟ་ དེ་ལྟར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the eighth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བརྒྱད་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The lamps of the world recollect without obstruction Countlessly many past existences— Their own and others’—
bo: དེ་ ནི་ བདག་ དང་ དེ་བཞིན་ གཞན་དག་ གི་ ། ། སྔོན་ གྱི་ མཐའ་ ནི་ བྱེ་བ་ ཁྲག་ཁྲིག་ དག་ ། ཐུག་པ་ མེད་པ་ -ར་ འཇིག་རྟེན་ སྒྲོན་མ་ -ས་ དྲན་ ། །

source: Like Indian gooseberries resting in the palm of one’s hand.
bo: སྐྱུ་རུ་ར་ ལྔ་ ཕྱག་ མཐིལ་ བཞག་པ་ བཞིན་ ། །

source: “ ‘Migrating through the transference of death From a lifetime with a certain name, clan, and complexion, with certain thoughts, And having reappeared as another being through a given cause, They teach the Dharma with knowledge of this temporal process.
bo: མིང་ རུས་ དེ་བཞིན་ ཁ་དོག་ རྣམ་རྟོག་ དང་ ། ། ཚེ་ གནས་ འཆི་ འཕོ་ དང་ ནི་ འགྲོ་བ་ དང་ ། ། རྒྱུ་ གང་ གིས་ ནི་ སེམས་ཅན་ གང་ འོངས་པ་ ། ། དེ་ ལ་དུ་ -ས་ མཁྱེན་ ནས་ ནི་ ཆོས་ ཀྱང་ སྟོན་ ། །

source: All about the minds of transmigrators and the factors arising from the mind, The past, endless and unimpeded, And what gives rise to any given state of mind.
bo: འགྲོ་བ་ -འི་ སེམས་ དང་སེམས་ ལས་ བྱུང་བ་ -འི་ ཆོས་ ། ། གང་དག་ འདས་པ་ མཐའ་ ཡས་ ཐུག་མེད་ དང་ ། ། གང་ གི་ འོག་ ཏུ་ སེམས་ ནི་ གང་ འབྱུང་བ་ ། །

source: “ ‘The victors know with their great wisdom
bo: ཡེ་ཤེས་ ཆེ་ ལྡན་ རྒྱལ་བ་ -ས་ ཐམས་ཅད་ མཁྱེན་ ། །

source: “ ‘The sugatas understand What constitute the prior and earlier mind states of a single being. Even if they were to explain them for as many eons As there are grains of sand in the river Ganges, there would be no end to it.
bo: སེམས་ཅན་ གཅིག་ གི་ སེམས་ ནི་ སྔ་མ་ གང་ ། ། འདས་པ་ གང་ཡིན་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ མཁྱེན་ ། ། བསྐལ་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་ སྙེད་ དུ་ ། ། དེ་ ནི་ བསྟན་ ཀྱང་ དེ་ ལ་ ཐུག་པ་ མེད་ ། །

source: “ ‘Even if they taught The countlessly many prior activities forever, Their unequaled wisdom would not be exhausted.
bo: གང་ཡང་ སྔོན་ གྱི་ སྤྱོད་པ་ བྱེ་བ་ དག་ ། མཐའ་ ཡས་ ཐུག་པ་ མེད་པ་ བསྟན་ ཀྱང་ ནི་ ། ། མཚུངས་པ་ མེད་པ་ -འི་ ཡེ་ཤེས་ མི་ཟད་ དེ་ ། །

source: That is what the ocean of sugata wisdom is like.
bo: བདེ་གཤེགས་ ཡེ་ཤེས་ རྒྱ་མཚོ་ དེ་ འདྲ་ -འོ་ ། །

source: “ ‘Those beings of virtuous intent Who have shown respect to the victors in the past
bo: སེམས་ཅན་ གང་དག་ བསམ་པ་ དགེ་ གྱུར་ དང་ ། ། གང་ གིས་ སྔོན་ཆད་ རྒྱལ་བ་ བསྟི་སྟང་ བྱས་ ། །

source: Are made mindful of their previous virtue By the strength of the buddhas’ miraculous power.
bo: སངས་རྒྱས་ རྫུ་འཕྲུལ་ སྟོབས་ ཀྱི་ ཤུགས་ གནས་ ཏེ་ ། ། སྔོན་ཆད་ དཀར་པོ་ བྱས་པ་ དྲན་པ་ -ར་ བྱེད་ ། །

source: “ ‘Mindful of their previous virtue Due to the power of the buddhas,
bo: སྔོན་ཆད་ དཀར་པོ་ དེ་ -ས་ བྱས་ ཅི་འདྲ་བ་ ། ། སངས་རྒྱས་ མཐུ་ -ས་ ནི་ དེ་དག་ དྲན་པ་ -ར་ འགྱུར་ ། །

source: And mindfully abiding in the three vehicles, They do not turn away from the virtuous path of liberation.
bo: དེ་ དྲན་ ནས་ ཀྱང་ ཐེག་པ་ གསུམ་ གནས་ ཏེ་ ། ། དེ་དག་ ཐར་ལམ་ དགེ་ལས་ ཕྱིར་ མི་ ལྡོག་ །

source: Of the limitless sugatas who appeared in the past. “ ‘No sentient being can conceive
bo: བདེ་གཤེགས་ རྣམས་ ཀྱི་ སྔོན་བྱུང་ མཐའ་ཡས་པ་ ། ། སེམས་ཅན་ ཀུན་ གྱིས་ བསམ་པ་ -ར་ མི་ ནུས་ ཏེ་ ། །

source: The endless taming of sentient beings Is the eighth activity of great beings.’
bo: གང་ གིས་ སེམས་ཅན་ ཐུག་པ་ མེད་ བཏུལ་བ་ ། ། སྐྱེས་བུ་ ཆེན་པོ་ རྣམས་ ཀྱི་ འཕྲིན་ལས་ བརྒྱད་ ། །

source: “Son of noble family, with their pure divine vision, which surpasses that of humans, the tathāgatas observe beings dying, transmigrating, and taking birth. They observe their migrations into happy or sad destinies, their goodness or wickedness, their beautiful or ugly complexions.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ལྷ་ -འི་ མིག་ རྣམ་པ་ -ར་ དག་པ་ མི་ལས་ ཤིན་ཏུ་ འདས་པ་ -ས་ སེམས་ཅན་ རྣམས་ འཆི་ འཕོ་ དང་ ། སྐྱེ་བ་ དང་ ། བཟང་པོ་ དང་ ། ངན་པ་ དང་ ། ཁ་དོག་ མཛེས་པ་ དང་ ། ཁ་དོག་ མི་ སྡུག་པ་ དང་ ། བདེ་འགྲོ་ -ར་ འགྲོ་བ་ དང་ ། ངན་འགྲོ་ -ར་ འགྲོ་བ་ རྣམས་ གཟིགས་ སོ་ ། །

source: “ ‘Alas! Regarding those sentient beings who have acted badly either physically, verbally, or mentally, who have denigrated the nobles ones, and who have held wrong views, once their bodies fail and they die they will be born as hell beings, falling into lower realms and miserable destinies because they took up actions based on their wrong views.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ལུས་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། ངག་ གིས་ ཉེས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། ཡིད་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། འཕགས་པ་ རྣམས་ ལ་ སྐུར་པ་ འདེབས་པ་ ། ལོག་པ་ -ར་ ལྟ་བ་ དག་ སྟེལོག་པ་ -ར་ ལྟ་བ་ -འི་ ལས་ ཡང་དག་པ་ -ར་ བླངས་པ་ -འི་ རྒྱུས་ ལུས་ ཞིག་ སྟེ་ ཤི་བ་ -འི་ འོག་ ཏུ་ ངན་སོང་ ངན་འགྲོ་ ལོག་པ་ -ར་ ལྟུང་བ་ སེམས་ཅན་ དམྱལ་བ་ རྣམས་ སུ་ སྐྱེ་བ་ -ར་ འགྱུར་ རོ་ ། །

source: “ ‘Regarding those sentient beings who have acted virtuously either physically, verbally, or mentally, who have not denigrated the noble ones, and who have held correct views, once their bodies fail and they die they will be born among gods in the higher realms and blissful destinies because they took up correct views.’
bo: སེམས་ཅན་ འདི་དག་ ནི་ ལུས་ ཀྱིས་ ལེགས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། ངག་ གིས་ ལེགས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། ཡིད་ ཀྱིས་ ལེགས་པ་ -ར་ སྤྱོད་པ་ དང་ ལྡན་པ་ ། འཕགས་པ་ རྣམས་ ལ་ སྐུར་པ་ མི་ འདེབས་པ་ ། ཡང་དག་པ་ -ར་ ལྟ་བ་ དག་ སྟེཡང་ དག་པ་ -ར་ ལྟ་བ་ ཡང་དག་པ་ -ར་ བླངས་པ་ -འི་ རྒྱུས་ ལུས་ ཞིག་ སྟེ་ ཤི་བ་ -འི་ འོག་ ཏུ་ བདེ་འགྲོ་ མཐོ་རིས་ ཀྱི་ འཇིག་རྟེན་ དུ་ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ་ -ར་ འགྱུར་ རོ་

source: Thus tathāgatas know how beings migrate due to actions.
bo: ཞེས་ ཇི་ལྟར་ ལས་ ཀྱིས་ ཉེ་བར་ འགྲོ་བ་ -འི་ སེམས་ཅན་ དག་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “The divine tathāgata vision is like this:
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལྷ་ -འི་ མིག་ ནི་ འདི་ ཡིན་ ཏེ་ །

source: It observes the destruction and formation of the worlds of the ten directions, all those that appear as fields in the limitless, innumerable, and incalculable buddhafields reaching to the end of space, the limitless realm of phenomena.
bo: མིག་ དེ་ -ས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ ཆོས་ ཀྱི་ དབྱིངས་ ཀྱིས་ ཀླས་པ་ ། ནམ་མཁའ་ -འི་ ཁམས་ ཀྱི་ མཐས་གཏུགས་པ་ ། ཚད་ མེད་པ་ ། གྲངས་མེད་པ་ ། བགྲང་བ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ན་ ཞིང་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ འཇིག་པ་ དང་ འཆགས་པ་ -ར་ གཟིགས་ སོ་ ། །

source: It observes the death, transmigration, and rebirth of all those beings who appear and the death, conception, and rebirth of all those bodhisattvas who appear.
bo: སེམས་ཅན་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ འཆི་ འཕོ་བ་ དང་ སྐྱེ་བ་ -ར་ གཟིགས་ སོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ འཆི་ འཕོ་བ་ དང་ ། མངལ་ དུ་ འཇུག་པ་ དང་ ། བཙའ་བ་ -ར་ གཟིགས་ སོ་ ། །

source: It observes the buddhas who appear attaining complete and perfect buddhahood, turning the wheel of Dharma, relinquishing the physical body, and entering into parinirvāṇa.
bo: སངས་རྒྱས་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ དང་ ། ཆོས་ ཀྱི་ འཁོར་ལོ་ སྐོར་བ་ དང་ ། ཚེ་ -འི་ འདུ་བྱེད་ འདོར་བ་ དང་ ། ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ གཟིགས་ སོ་ ། །

source: It observes the śrāvakas who appear becoming free and entering parinirvāṇa.
bo: ཉན་ཐོས་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ འགྲོལ་བ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ གཟིགས་ སོ་ ། །

source: And it observes the pratyekabuddhas who appear displaying miracles and purifying gifts.
bo: རང་ སངས་རྒྱས་ གང་དག་ ཁ་ཅིག་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ ནི་ རྫུ་འཕྲུལ་ སྟོན་ ཅིང་ ཡོན་ སྦྱོང་བ་ -ར་ གཟིགས་ སོ་ ། །

source: “Beings who do not appear and who are invisible for the five non-Buddhist superknowledges, for śrāvakas, for pratyekabuddhas, and for bodhisattvas—even they are visible to the divine tathāgata vision.
bo: སེམས་ཅན་ གང་དག་ སྣང་བ་ -ར་ མ་ གྱུར་པ་ དག་ དང་ ། གང་དག་ ཕྱི་རོལ་ གྱི་ མངོན་པར་ ཤེས་པ་ ལྔ་ དང་ ལྡན་པ་ རྣམས་ ཀྱིས་ མིག་ གི་ ལམ་ དུ་མ་ གྱུར་པ་ དང་ ། ཉན་ཐོས་ རྣམས་ ཀྱི་ མ་ཡིན་པ་ དང་ ། རང་ སངས་རྒྱས་ རྣམས་ ཀྱི་ མ་ཡིན་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ དག་ གི་ མ་ཡིན་པ་ དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ལྷ་ -འི་ མིག་ ལ་ སྣང་བ་ -ར་ འགྱུར་ རོ་ ། །

source: “Furthermore, those beings who are invisible in Jambudvīpa are visible to the tathāgatas. The gods and humans of the world realms of the vast trichiliocosm do not see them.
bo: ཡང་ ཤིང་རྟ་ -འི་ ཕང་ལོ་ ཙམ་ གྱི་ ས་ཕྱོགས་ ན་ སྣང་བ་ -ར་ མ་ གྱུར་པ་ -འི་ སེམས་ཅན་ གང་དག་ དེ་བཞིན་ གཤེགས་པ་ ལ་ སྣང་བ་ -ར་ གྱུར་པ་ དེ་དག་ ནི་ ཆེས་ མང་ གི་ ། སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ ལྷ་ དང་ མི་ རྣམས་ ནི་ དེ་ལྟ་ མ་ ཡིན་ ཏེ

source: The realms of such invisible beings are limitless.
bo: དེ་ལྟར་ སྣང་བ་ -ར་ མ་ གྱུར་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ནི་ ཚད་ མེད་ དོ་ ། །

source: “The divine tathāgata vision scans the realms of beings in all buddhafields, asking, ‘Who are the beings to be tamed by the buddhas?’
bo: དེ་ལྟར་ སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ -འི་ སེམས་ཅན་ གང་ཡིན་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལྷ་ -འི་ མིག་ གིས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ གྱི་ ཁམས་ ལ་ རྣམ་པ་ -ར་ གཟིགས་ ཏེ་ །

source: For as many kinds of beings to be tamed by the buddhas as exist, that many tathāgatas abide in their presence. Even as they tame these beings, other beings remain unaware of this.
bo: སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ -འི་ སེམས་ཅན་ གྱི་ རིས་ ཇི་སྙེད་པ་ དེ་དག་ གི་ མདུན་ ན་ དེ་སྙེད་ ཀྱི་ དེ་བཞིན་ གཤེགས་པ་ བཞུགས་ ཤིང་ སེམས་ཅན་ དེ་དག་ འདུལ་ ཡང་ དེ་དག་ མ་ཡིན་པ་ -འི་ སེམས་ཅན་ གཞན་ གྱིས་ མི་ ཤེས་ ཏེ

source: This is the ninth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ དགུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The divine vision of tathāgatas is unstained and luminous, Purified, limitless, meritorious, and splendid.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ལྷ་ ཡི་ མིག་ ནི་ དྲི་མེད་ འོད་གསལ་ ཏེ་ ། ། མིག་ ནི་ རྣམ་ སྦྱངས་ མཐའ་ ཡས་ བསོད་ནམས་ གཟི་བརྗིད་ གཟི་བརྗིད་ གྱུར་ ། །

source: It beholds the attributes throughout all the fields of the ten directions—
bo: ཕྱོགས་ བཅུ་ དག་ གི་ ཞིང་ རྣམས་ ཀུན་ དུ་ མཚན་ཉིད་ རྣམ་ གཟིགས་ ཏེ་ ། །

source: All that appears, will appear, and has appeared.
bo: གང་དག་ འབྱུང་ དང་ གང་དག་ འབྱུང་བ་ -ར་ འགྱུར་ དང་ གང་དག་ བྱུང་ ། །

source: “ ‘There the victors observe beings—whether they have form or not, Whether they exist in happy or miserable destinies, whether they are excellent, average, or inferior, And whether they are evildoers migrating toward the miserable existences Or the meritorious and karmically fortunate in the higher realms.
bo: དེ་ ན་ སེམས་ཅན་ གཟུགས་ཅན་ གཟུགས་ མེད་ གང་དག་ ཡོད་པ་ དང་ ། ། བདེ་འགྲོ་ ངན་འགྲོ་ དག་ ན་ རབ་ འབྲིང་ ཐ་མ་ གང་ མཆི་ དང་ ། ། སྡིག་པ་ བྱེད་པ་ གང་དག་ ངན་འགྲོ་ རྣམས་ སུ་ འགྲོ་བ་ དང་ ། གང་ཡང་ མཐོ་རིས་ བསོད་ནམས་ ལས་ཅན་ དེ་དག་ རྒྱལ་བ་ -ས་ གཟིགས་ ། །

source: Bodhisattvas engaged in their conduct in all the fields, Entering the womb, appearing, proceeding toward the tree of awakening, And taming Māra while seated in front of the tree of awakening.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་དག་ ཞིང་ རྣམས་ ཀུན་ ན་ སྤྱད་ སྤྱོད་ དང་ ། ། མངལ་ དུ་ འཇུག་ དང་ འབྱུང་ དང་ བྱང་ཆུབ་ ཤིང་ དྲུང་ འགྲོ་བ་ དང་ ། ། གང་དག་ ལ་ལ་ བྱང་ཆུབ་ ཤིང་ དྲུང་གནས་ ནས་ བདུད་འདུལ་བ་ ། །

source: “ ‘The divine vision of the all-seeing buddhas beholds
bo: དེ་ ཀུན་ སངས་རྒྱས་ ཐམས་ཅད་ གཟིགས་པ་ -ས་ ལྷ་ ཡི་ མིག་ གིས་ གཟིགས་ ། །

source: “ ‘The victors observe buddhas who are Dharma kings, who awaken to supreme awakening, Who turn the wheel of the Dharma, and who liberate gods and humans, Discarding the physical form of a victor after performing supreme buddha deeds And demonstrating nirvāṇa.
bo: སངས་རྒྱས་ ཆོས་ ཀྱི་ རྒྱལ་པོ་ གང་དག་ བྱང་ཆུབ་ མཆོག་ སངས་རྒྱས་ ། ། གང་དག་ ཆོས་ ཀྱི་ འཁོར་ལོ་ སྐོར་ ཞིང་ལྷ་ དང་ མི་ རྣམས་ འགྲོལ་ ། ། སངས་རྒྱས་ མཛད་པ་ མཆོག་ མཛད་ ནས་ ནི་ རྒྱལ་བ་ ཚེ་ འདོར་ དང་ ། ། གང་ཡང་ མྱ་ངན་ འདས་པ་ སྟོན་པ་ དེ་དག་ རྒྱལ་བ་ -ས་ གཟིགས་ ། །
