Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: The teaching on equality with space says, ‘Form is equal to space.’
bo: གཟུགས་ ནམ་མཁའ་ དང་ མཉམ་པ་ -འོ་ ཞེས་ ནམ་མཁའ་ དང་ མཉམ་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the nature of nirvāṇa says, ‘Form is of the nature of nirvāṇa.’ These teachings are all inexhaustible.
bo: གཟུགས་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ རང་བཞིན་ ནོ་ ཞེས་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ རང་བཞིན་ དུ་ བསྟན་པ་ མི་ཟད་པ་ -འོ་ ། །

source: “Similarly, by engaging in uttering a single sound, inexhaustible teachings are extensively applied to all that can be known, including all phenomena, that is, the aggregates, the elements, the sense fields, the collections of names, the collections of terms, and the collections of letters.
bo: དེ་བཞིན་ དུ་ ཕུང་པོ་ རྣམས་ དང་ ། ཁམས་ རྣམས་ དང་ ། སྐྱེ་མཆེད་ རྣམས་ དང་ ། མིང་ གི་ ཚོགས་ དང་ ། ཚིག་ གི་ ཚོགས་ དང་ ། ཡི་གེ་ -འི་ ཚོགས་ ཐམས་ཅད་ དང་ ། ཆོས་ ཐམས་ཅད་ ཀྱི་ བར་ ལ་ ཡང་ སྒྲ་ གཅིག་ བརྗོད་པ་ ལ་ འཇུག་པ་ -ས་ བསྟན་པ་ མི་ཟད་པ་ ཤེས་པ་ -ར་ ཐམས་ཅད་ ལ་ རྒྱས་པ་ -ར་ སྦྱར་ རོ་ ། །

source: The knowledge for expressing what is inexhaustible among this basket of a body arisen from the four great elements, the knowledge for entering into the inexhaustible Dharma discourses that are a basket of jewels, and the inexhaustible knowledge of the teachings are called the inexhaustible basket dhāraṇī.
bo: འབྱུང་བ་ ཆེན་པོ་ བཞི་ ལས་ གྱུར་པ་ ལུས་ ཀྱི་ ཟ་མ་ཏོག་ འདི་ -འི་ མི་ཟད་པ་ ཡོངས་སུ་ བརྗོད་པ་ ཤེས་པ་ དང་ ། རིན་པོ་ཆེ་ -འི་ ཟ་མ་ཏོག་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ མི་ཟད་པ་ ལ་ འཇུག་པ་ ཤེས་པ་ དང་ ། བསྟན་པ་ ཤེས་པ་ མི་ཟད་པ་ འདི་ ནི་ མི་ཟད་པ་ -འི་ ཟ་མ་ཏོག་ གི་ གཟུངས་ ཞེས་ བྱ་ སྟེ

source: Through the teaching of a mere introduction, the inexhaustible basket is uttered for an eon or more.
bo: གང་ ཆུང་ ཟད་ འཇུག་པ་ ཙམ་ ཞིག་ བསྟན་ གྱིས་ ། བསྐལ་པ་ -འམ་ དེ་ལས་ ལྷག་པར་ ཡང་ མི་ཟད་པ་ -འི་ ཟ་མ་ཏོག་ ཅེས་ བརྗོད་ དུ་ཡོད་ དོ་ ། །

source: “Son of noble family, you may then ask, ‘What is the limitless enfoldment dhāraṇī?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ འཁྱིལ་བ་ མཐའ་ ཡས་ ཀྱི་ གཟུངས་ གང་ཞེ་ན་ །

source: The ‘limits’ are nihilism and eternalism.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ ཆད་པ་ དང་ རྟག་པ་ -འོ་ ། །

source: The ‘enfoldment’ is the twelve links of dependent arising:
bo: འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ ཡན་ལག་ བཅུ་གཉིས་པ་ སྟེ་ །

source: Conditioned by ignorance, formations occur.
bo: མ་རིག་པ་ -འི་ རྐྱེན་ གྱིས་ འདུ་བྱེད་ རྣམས་ །

source: Conditioned by formations, consciousness occurs.
bo: འདུ་བྱེད་ ཀྱི་ རྐྱེན་ གྱིས་ རྣམ་པ་ -ར་ ཤེས་པ་ །

source: Conditioned by consciousness, name and form occur.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ རྐྱེན་ གྱིས་ མིང་ དང་ གཟུགས་ །

source: Conditioned by name and form, the six sense fields occur.
bo: མིང་ དང་ གཟུགས་ ཀྱི་ རྐྱེན་ གྱིས་ སྐྱེ་མཆེད་ དྲུག་ །

source: Conditioned by the six sense fields, contact occurs.
bo: སྐྱེ་མཆེད་ དྲུག་ གི་ རྐྱེན་ གྱིས་ རེག་པ་ །

source: Conditioned by contact, sensation occurs.
bo: རེག་པ་ -འི་ རྐྱེན་ གྱིས་ ཚོར་བ་ །

source: Conditioned by sensation, craving occurs.
bo: ཚོར་བ་ -འི་ རྐྱེན་ གྱིས་ སྲེད་པ་ །

source: Conditioned by craving, appropriation occurs.
bo: སྲེད་པ་ -འི་ རྐྱེན་ གྱིས་ ལེན་པ་ །

source: Conditioned by appropriation, becoming occurs.
bo: ལེན་པ་ -འི་ རྐྱེན་ གྱིས་ སྲིད་པ་ །

source: Conditioned by becoming, birth occurs.
bo: སྲིད་པ་ -འི་ རྐྱེན་ གྱིས་ སྐྱེ་བ་ །

source: Conditioned by birth, there occur old age, death, sorrow, lamentation, suffering, unhappiness, and chaos.
bo: སྐྱེ་བ་ -འི་ རྐྱེན་ གྱིས་ རྒ་ཤི་ དང་ ། མྱ་ངན་ དང་ ། སྨྲེ་སྔགས་ འདོན་པ་ དང་ ། སྡུག་བསྔལ་བ་ དང་ ། ཡིད་ མི་ བདེ་བ་ དང་ ། འཁྲུག་པ་ རྣམས་ འབྱུང་བ་ -ར་ འགྱུར་ ཏེ

source: In that manner, nothing but this great heap of sorrow occurs.
bo: དེ་ལྟར་ སྡུག་བསྔལ་ གྱི་ ཕུང་པོ་ ཆེན་པོ་ འདི་ འབའ་ཞིག་ འགྱུར་བ་ -ར་ འགྱུར་ རོ་ ། །

source: The infinite intent of the formula, the infinite doors to its expositions, and its infinite introductions provide knowledge of the limitless enfoldment dhāraṇī.
bo: དེ་ ལ་ སྔགས་ ཀྱི་ དགོངས་པ་ མཐའ་ཡས་པ་ དང་ ། སྔགས་ བསྟན་པ་ -འི་ སྒོ་ མཐའ་ཡས་པ་ དང་ ། གཞོལ་བ་ -ར་ འཇུག་པ་ མཐའ་ཡས་པ་ འདི་ ནི་ ། འཁྱིལ་བ་ མཐའ་ཡས་པ་ -འི་ གཟུངས་ ཤེས་པ་ -འོ་ ། ། མཐའ་ ཞེས་ བྱ་བ་ ནི་ ལེན་པ་ དང་ འདོར་བ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ མི་ ལེན་ མི་ འདོར་བ་ -འོ་ ། །

source: “The ‘limits’ are birth and cessation, whereas ‘enfoldment’ is beyond birth and cessation.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ སྐྱེ་བ་ དང་ འགགས་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ སྐྱེ་བ་ མེད་པ་ དང་ འགགས་པ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are pollution and purification, whereas ‘enfoldment’ is natural purity.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ དང་ རྣམ་པ་ -ར་ བྱང་བ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རང་བཞིན་ གྱིས་ རྣམ་པ་ -ར་ དག་པ་ -འོ་ ། །

source: The ‘limits’ are discursive signs and elaborations, whereas ‘enfoldment’ is their lack of origination.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ མཚན་མ་ དང་ སྤྲོས་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ ཀུན་ དུ་ འབྱུང་བ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are thoughts and conceptualization, whereas ‘enfoldment’ is beyond thoughts and conceptualization.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ རྟོག་པ་ དང་ རྣམ་པ་ -ར་ རྟོག་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རྟོག་པ་ མེད་པ་ དང་ ། རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are causes and views, whereas ‘enfoldment’ is comprehension of causes and views.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ རྒྱུ་ དང་ ལྟ་བ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རྒྱུ་ དང་ ལྟ་བ་ ཡོངས་སུ་ ཤེས་པ་ -འོ་ ། །

source: The ‘limits’ are name and form, whereas ‘enfoldment’ does not form cognitive representations.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ མིང་ དང་ གཟུགས་ སོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རྣམ་པ་ -ར་ རིག་བྱེད་ མ་ཡིན་པ་ -འོ་ ། །

source: The ‘limits’ are the conditioned and the unconditioned, whereas ‘enfoldment’ consists in the purity of all three spheres of agent, act, and object.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ འདུས་བྱས་ དང་ འདུས་མ་བྱས་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འོ་ ། །

source: “The ‘limits’ are inner and outer, whereas ‘enfoldment’ is not based on consciousness.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ ནང་ དང་ ཕྱི་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ གནས་པ་ -འོ་ ། །

source: The ‘limits’ are karma and maturation, whereas ‘enfoldment’ is beyond karma and maturation.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ལས་ དང་ རྣམ་པ་ -ར་ སྨིན་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ལས་ མེད་པ་ དང་ རྣམ་པ་ -ར་ སྨིན་པ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are virtue and nonvirtue, whereas ‘enfoldment’ is beyond conditioning.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ དགེ་བ་ དང་ མི་དགེ་བ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are having or lacking culpability, whereas ‘enfoldment’ is without duality.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ་ དང་ཁ་ ན་མ་ ཐོ་བ་ མེད་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ གཉིས་ སུ་ མེད་པ་ -འོ་ ། །

source: The ‘limits’ are karma and afflictive emotions, whereas ‘enfoldment’ is natural luminosity.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ལས་ དང་ ཉོན་མོངས་པ་ རྣམས་ སོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འོ་ ། །

source: The ‘limits’ are self and no self, whereas ‘enfoldment’ is complete purity.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ བདག་ དང་ བདག་མེད་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ དག་པ་ -འོ་ ། །

source: The ‘limits’ are saṃsāra and nirvāṇa, whereas ‘enfoldment’ means that all phenomena are thoroughly transcendent by nature.
bo: མཐའ་ ཞེས་ བྱ་བ་ ནི་ འཁོར་བ་ དང་ མྱ་ངན་ ལས་ འདས་པ་ -འོ་ ། ། འཁྱིལ་བ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ རང་བཞིན་ གྱིས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -འོ་ ། །

source: “Therefore, son of noble family, the teaching on limitlessness is boundless.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ མཐའ་ཡས་པ་ བསྟན་པ་ ཚད་ མེད་ དོ་ ། །

source: The teaching on enfoldment is boundless.
bo: འཁྱིལ་བ་ བསྟན་པ་ ཚད་ མེད་ དོ་ ། །

source: Since bodhisattvas established in this limitless enfoldment dhāraṇī are aligned with limitlessness and are aligned with enfoldment, even if they were to teach the Dharma for limitless hundreds of thousands of eons, they would not reach the end of the wisdom that retains meanings and syllables.
bo: འཁྱིལ་བ་ མཐའ་ཡས་པ་ -འི་ གཟུངས་ འདི་ ལ་ རབ་ཏུ་ གནས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ མཐའ་ཡས་པ་ -འི་ རྗེས་སུ་ སོང་ ། ཆོས་ འཁྱིལ་བ་ -འི་ རྗེས་སུ་ སོང་བ་ -ས་ བསྐལ་པ་ བརྒྱ་ སྟོང་ཕྲག་ མཐའ་ཡས་པ་ -ར་ ཆོས་སྟོན་ ཀྱང་ དོན་ དང་ ཚིག་འབྲུ་ -ས་ གཟུངས་ ཀྱི་ ཡེ་ཤེས་ འདི་ -འི་ མཐའ་ -ར་ མི་ ཕྱིན་ ཏོ་ ། །

source: This is the introduction to the limitless enfoldment dhāraṇī, the corresponding Dharma, the attendant realization of the illumination of wisdom, and the corresponding realization of unclouded wisdom with regard to this pure gateway.
bo: འདི་ ནི་ འཁྱིལ་བ་ མཐའ་ཡས་པ་ -འི་ གཟུངས་ ལ་ གཞོལ་བ་ -ར་ འཇུག་པ་ དང་ ། རྗེས་སུ་ འགྲོ་བ་ -ར་ བསྟན་པ་ དང་ ། ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ རྗེས་སུ་ རྟོགས་པ་ དང་ ། རྣམ་པ་ -ར་ དག་པ་ -འི་ སྒོ་ ལ་ རབ་རིབ་ མེད་པ་ -འི་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འགྲོ་བ་ རྗེས་སུ་ རྟོགས་པ་ -འོ་ ། །

source: “Son of noble family, you may then ask, ‘What is the ocean mudrā dhāraṇī?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ རྒྱ་མཚོ་ -འི་ ཕྱག་རྒྱ་ -འི་ གཟུངས་ གང་ཞེ་ན་ །

source: It is as follows:
bo: འདི་ལྟ་སྟེ་ །

source: To give an analogy, all that appears in the world realm of the four great continents comprises appearances in the form of beings, mountains, and trees;
bo: དཔེར་ན་ གླིང་བཞི་པ་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ གང་དག་ གཟུགས་ སུ་ སྣང་བ་ དང་ ། སེམས་ཅན་ གྱི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ ། རི་ -འི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ ། ཤིང་ གི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ །

source: grasses, bushes, medicinal herbs, forests, and harvests;
bo: རྩྭ་ དང་ ། ཤིང་ གེལ་པ་ དང་ ། སྨན་ དང་ ། ནགས་ཚལ་ དང་ ། ལོ་ཏོག་ གི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ །

source: the moon, the sun, the stars, gems, clouds, fire, and lightning;
bo: ཟླ་བ་ དང་ ། ཉི་མ་ དང་ ། སྐར་མ་ དང་ ། ནོར་བུ་ དང་ ། སྤྲིན་ དང་ ། མེ་ དང་ ། གློག་ གི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ །

source: the layouts of cities, towns, and hamlets; palaces and riches; parks, springs, ponds, sprouts, and fountains; and all resources or objects of enjoyment, whether inferior, average, or supreme.
bo: གྲོང་ དང་ ། གྲོང་ཁྱེར་ དང་ ། གྲོང་རྡལ་ གྱི་ དབྱིབས་ ཀྱི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ ། གཞལ་མེད་ ཁང་ དང་ ལོངས་སྤྱོད་ ཀྱི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ ། སྐྱེད་མོས་ཚལ་ དང་ ། ཆུ་མིག་ དང་ ། མཚེའུ་ དང་ ། ལྟེང་ཀ་ དང་ ། འབབ་ཆུ་ -འི་ གཟུགས་ སུ་ སྣང་བ་ -འམ་ ། ཉེ་བར་ སྤྱོད་པ་ -འམ་ ། ཡོངས་སུ་ སྤྱོད་པ་ ཐམས་ཅད་ ཀྱི་ གཟུགས་ སུ་ སྣང་བ་ ངན་པ་ དང་ ། འབྲིང་ དང་ ། རབ་ དང་ །

source: “Since all these forms of appearance are sealed by the great ocean in a manner that is not too little, not too much, and not excessive, the ocean is known to be great.
bo: གཟུགས་ སུ་ སྣང་བ་ དེ་དག་ ཐམས་ཅད་ རྒྱ་མཚོ་ ཆེན་པོ་ ལ་ རྒྱ་ དང་ བཅས་པ་ -ར་ མི་ ཉུང་ ། མི་ མང་ ། ལྷག་པ་ མེད་པ་ -ས་ དེ་ -འི་ ཕྱིར་ རྒྱ་མཚོ་ ཆེན་པོ་ ཞེས་ བྱ་ -འོ་ ། །

source: Son of noble family, for bodhisattvas who are established in the ocean mudrā dhāraṇī, it is like a seal that seals the bodies of all sentient beings, the speech of all sentient beings, and the minds of all sentient beings.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ དུ་ རྒྱ་མཚོ་ -འི་ ཕྱག་རྒྱ་ -འི་ གཟུངས་ ལ་ རབ་ཏུ་ གནས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡང་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ ལུས་ རྒྱ་ དང་ མཚུངས་པ་ ཡིན་ ནོ་ ། ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ ངག་ རྒྱ་ དང་ མཚུངས་པ་ ཡིན་ ནོ་ ། ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ སེམས་ རྒྱ་ དང་ མཚུངས་པ་ ཡིན་ ནོ་ ། །

source: To whatever extent these bodhisattvas engage in the liberating activity of speech in promulgating the Dharma of the blessed buddhas of the ten directions, it is as if they mark things with a seal by way of such utterance.
bo: ཕྱོགས་ བཅུ་ དག་ ན་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཆོས་སྟོན་པ་ -འི་ གསུང་ གི་ འཕྲིན་ལས་ ཇི་སྙེད་ འཇུག་པ་ དེ་དག་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ -འི་ ཁ་ -འི་ སྒོ་ ནས་ ཕྱག་རྒྱ་ -ས་ བཏབ་པ་ དང་ མཚུངས་པ་ -ར་ འབྱུང་ ངོ་ ། །

source: Anything that bodhisattvas may express, which bears the seal of the Tathāgata, the seal of nonconceptuality, teaches everyone the seal of the Tathāgata, the seal of nonconceptuality, without recourse to any extraneous means.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཕྱག་རྒྱ་ -ས་ བཏབ་ དེ་ གང་ཅི་ རྗོད་པ་ དེ་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཕྱག་རྒྱ་ -ས་ རྣམ་པ་ -ར་ མི་ རྟོག་པ་ -ར་ ཕྱག་རྒྱ་ ཐམས་ཅད་ སྟོན་པ་ ལ་ གཞན་ གྱི་ དྲིང་ མི་ འཇོག་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “Thus, the teaching concerning their seals is as follows.
bo: དེ་ ལ་ ཕྱག་རྒྱ་ བསྟན་པ་ ནི་ འདི་ ཡིན་ ཏེ་ ། འདི་ལྟ་སྟེ་ །

source: A is the seal of the unconditioned.
bo: ཨ་ཞེ་ -ས་ བྱ་བ་ ནི་ མངོན་པར་ འདུ་བྱེད་ མེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ra is the seal of the attainment of freedom from desire regarding any phenomenon.
bo: ར་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་ འདོད་ཆགས་ དང་ བྲལ་བ་ ཐོབ་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Pa is the seal of teachings on the ultimate.
bo: པ་ ཞེས་ བྱ་བ་ ནི་ དོན་དམ་པ་ བསྟན་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Tsa is the seal of pure vision.
bo: ཙ་ ཞེས་ བྱ་བ་ ནི་ མིག་ རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Na is the seal of the knowledge of all name and form.
bo: ན་ ཞེས་ བྱ་བ་ ནི་ མིང་ དང་ གཟུགས་ ཐམས་ཅད་ ཡོངས་སུ་ ཤེས་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: La is the seal of extrication from the vines of craving.
bo: ལ་ ཞེས་ བྱ་བ་ ནི་ སྲེད་པ་ -འི་ འཁྲི་ཤིང་ དང་ བྲལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Da is the seal of the pure ten strengths.
bo: ད་ ཞེས་ བྱ་བ་ ནི་ སྟོབས་ བཅུ་ ཡོངས་སུ་ དག་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ba is the seal of the pure factors of awakening and strengths.
bo: བ་ ཞེས་ བྱ་བ་ ནི་ སྟོབས་ དང་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ ཡོངས་སུ་ དག་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ḍa is the seal of freedom from upset and agony.
bo: ཌ་ ཞེས་ བྱ་བ་ ནི་ ཁྲག་ཁྲུག་ དང་ བྲལ་བ་ དང་ གདུང་བ་ -ས་ གདུང་བ་ དང་ བྲལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ṣa is the seal of attaining the six kinds of superknowledge.
bo: ཥ་ ཞེས་ བྱ་བ་ ནི་ མངོན་པར་ ཤེས་པ་ དྲུག་ འཐོབ་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ba is the seal of abandoning the left-hand path.
bo: བ་ ཞེས་ བྱ་བ་ ནི་ གཡོན་ཕྱོགས་ ཀྱི་ ལམ་ རྣམ་པ་ -ར་ སྤངས་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ta is the seal of the teaching on suchness.
bo: ཏ་ ཞེས་ བྱ་བ་ ནི་ དེ་ ཁོ་ན་ བསྟན་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ya is the seal that accords with the way things are.
bo: ཡ་ ཞེས་ བྱ་བ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sta is the seal of freedom from the afflictive emotion of arrogance.
bo: སྟ་ ཞེས་ བྱ་བ་ ནི་ ཁེངས་པ་ -འི་ ཐ་བ་ དང་ བྲལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ka is the seal of freedom from doubt.
bo: ཀ་ ཞེས་ བྱ་བ་ ནི་ ཐེ་ཚོམ་ དང་ བྲལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sa is the seal of teaching truth.
bo: ས་ ཞེས་ བྱ་བ་ ནི་ བདེན་པ་ བསྟན་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ma is the seal of the pure path.
bo: མ་ ཞེས་ བྱ་བ་ ནི་ ལམ་ རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ga is the seal of entry into the profound.
bo: ག་ ཞེས་ བྱ་བ་ ནི་ ཟབ་མོ་ ལ་ འཇུག་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sṭha is the seal of demonstrating power and might.
bo: སྠ་ ཞེས་ བྱ་བ་ ནི་ མཐུ་ དང་ སྟོབས་ ཀུན་ དུ་ བསྟན་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Dza is the seal of transcending old age and death.
bo: ཛ་ ཞེས་ བྱ་བ་ ནི་ རྒ་ཤི་ ལས་ ཤིན་ཏུ་ འདའ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Shwa is the seal of abandoning the hazards of wild animals.
bo: ཤྭ་ ཞེས་ བྱ་བ་ ནི་ གཅན་གཟན་ གྱི་ ཉེས་པ་ རྣམ་པ་ -ར་ སྤངས་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Dha is the seal of the stainless realm of phenomena.
bo: དྷ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཀྱི་ དབྱིངས་ འདྲེས་པ་ མེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sha is the seal of the perfection of tranquil abiding.
bo: ཤ་ ཞེས་ བྱ་བ་ ནི་ ཞི་གནས་ ཡོངས་སུ་ རྫོགས་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Kha is the seal of the basic nature of imperishable space.
bo: ཁ་ཞེ་ -ས་ བྱ་བ་ ནི་ ནམ་མཁའ་ མི་ཟད་པ་ -འི་ ཆོས་ཉིད་ ཀྱི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Kṣha is the seal of knowledge of the perishable and of the unborn.
bo: ཀྵ་ ཞེས་ བྱ་བ་ ནི་ ཟད་པ་ ཤེས་པ་ དང་ ། མི་ སྐྱེ་བ་ ཤེས་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Su is the seal of abandoning the obscuration of dullness.
bo: སུ་ ཞེས་ བྱ་བ་ ནི་ རྨུགས་པ་ -འི་ སྒྲིབ་པ་ རྣམ་པ་ -ར་ སྤང་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sa is the seal of gaining omniscience for all sentient beings.
bo: ས་ ཞེས་ བྱ་བ་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀུན་ དུ་ ཤེས་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Hwa is the seal of abandoning dharmas that facilitate degeneration.
bo: ཧ་ ཞེས་ བྱ་བ་ ནི་ ཉམས་པ་ ལ་ བསྟེན་པ་ -འི་ ཆོས་ རྣམ་པ་ -ར་ སྤང་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Bha is the seal of gaining realization of existence and nonexistence.
bo: བྷ་ ཞེས་ བྱ་བ་ ནི་ དངོས་པོ་ དང་ དངོས་པོ་ མེད་པ་ རྗེས་སུ་ རྟོགས་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Tsha is the seal of relinquishing attachment, aversion, fear, and stupidity.
bo: ཚ་ ཞེས་ བྱ་བ་ ནི་ འདོད་པ་ དང་ ། ཞེ་སྡང་ དང་ ། འཇིག་པ་ དང་ ། གཏི་མུག་ རྣམ་པ་ -ར་ སྤོང་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sma is the seal of mindfulness, alertness, and nonforgetfulness.
bo: སྨ་ ཞེས་ བྱ་བ་ ནི་ དྲན་པ་ དང་ ། ཤེས་བཞིན་ དང་ ། བརྗེད་པ་ མེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Hwa is the seal of summoning.
bo: ཧྭ་ ཞེས་ བྱ་བ་ ནི་ བོད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Sa is the seal of rejecting all afflictive emotions.
bo: ས་ ཞེས་ བྱ་བ་ ནི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ དོར་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Gha is the seal of eliminating opacity, distorted vision, and ignorance.
bo: གྷ་ ཞེས་ བྱ་བ་ ནི་ ཐིབས་པོ་ དང་ ། ལིང་ཏོག་ དང་ ། མ་རིག་པ་ སེལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ṭha is the seal of reaching the ultimate.
bo: ཋ་ ཞེས་ བྱ་བ་ ནི་ མཐར་ཐུག་པ་ -ར་ འགྲོ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ṇa is the seal of gaining realization of excellent qualities.
bo: ཎ་ ཞེས་ བྱ་བ་ ནི་ གྱ་ནོམ་པ་ -འི་ ཆོས་རྗེ་ -ས་ སུ་ རྟོགས་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Pha is the seal of attaining the result.
bo: ཕ་ ཞེས་ བྱ་བ་ ནི་ འབྲས་བུ་ ཐོབ་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ska is the seal of gaining comprehension of the aggregates.
bo: སྐ་ ཞེས་ བྱ་བ་ ནི་ ཕུང་པོ་ ཡོངས་སུ་ ཤེས་པ་ -ར་ བྱ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Dzwa is the seal of eradicating contagious diseases.
bo: ཛྭ་ ཞེས་ བྱ་བ་ ནི་ རིམས་ནད་ སེལ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Shtsa is the seal of directly and perfectly awakening wondrous marvelous qualities.
bo: ཤྩ་ ཞེས་ བྱ་བ་ ནི་ ངོ་མཚར་ རྨད་ དུ་ བྱུང་བ་ -འི་ ཆོས་ མངོན་པར་ རྫོགས་པ་ -ར་ བྱང་ཆུབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: Ba is the seal of reaching the end of the path and arriving in nirvāṇa.
bo: བ་ ཞེས་ བྱ་བ་ ནི་ ལམ་ གྱི་ རྒྱུན་ གཅོད་ ཅིང་ མྱ་ངན་ ལས་ འདས་པ་ རྗེས་སུ་ ཐོབ་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: La is the seal of the infinitude of syllables.
bo: ལ་ ཞེས་ བྱ་བ་ ནི་ ཡི་གེ་ -འི་ མཐའ་ ཐུག་པ་ མེད་པ་ -འི་ ཕྱག་རྒྱ་ -འོ་ ། །

source: “In this way, son of noble family, bodhisattvas, in as many ways as there are, comprehend the teaching of the seals represented by all these syllables used to teach the Dharma.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམ་པ་ ཇི་སྙེད་ ཀྱིས་ ཆོས་སྟོན་པ་ -འི་ ཡི་གེ་ དེ་དག་ ཐམས་ཅད་ ཀྱི་ ཕྱག་རྒྱ་ བསྟན་པ་ རབ་ཏུ་ ཤེས་ ཏེ་ །

source: Son of noble family, this introduces the gateway of the ocean mudrā dhāraṇī.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ནི་ རྒྱ་མཚོ་ -འི་ ཕྱག་རྒྱ་ -འི་ གཟུངས་ ཀྱི་ སྒོར་ འཇུག་པ་ -འོ་ ། །

source: “Son of noble family, you may then ask, ‘What is the dhāraṇī called lotus array?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ པད་མ་ བཀོད་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ དེ་ གང་ཞེ་ན་ །

source: Regarding bodhisattvas who are established in this dhāraṇī, wherever and in whichever assembly they choose to teach the Dharma, various beautiful lotus seats will blossom forth.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ འདི་ ལ་ རབ་ཏུ་ གནས་པ་ ནི་ འཁོར་ གྱི་ དཀྱིལ་འཁོར་ གང་དང་གང་ དུ་ ཆོས་ བསྟན་པ་ དེ་ དང་ དེ་ -ར་ དེ་ -འི་ པད་མ་ -འི་ སྟན་ སྣ་ཚོགས་པ་ བལྟ་ ན་ སྡུག་པ་ འབྱུང་ སྟེ

source: As soon as they sit down on their lotus seats, a rain of lotus flowers will shower from the sky,
bo: དེ་ པད་མ་ -འི་ སྟན་ དེ་ ལ་ འདུག་ མ་ ཐག་ ཏུ་ སྟེང་ གི་ བར་སྣང་ ལས་ པད་མ་ -འི་ ཆ་ -ར་ འབབ་བོ་ ། །

source: and various kinds of doctrinal teachings will issue forth from them: profound discourses, variegated discourses, illustrative discourses, expositions, melodic verses, prophecies, metered verses, praises, ethical narratives, ancient narratives, past life accounts, epic stories, and authoritative explications will manifest in this way.
bo: པད་མ་ དེ་དག་ ལས་ ཀྱང་ ཆོས་ བསྟན་པ་ རྣམ་པ་ སྣ་ཚོགས་ འབྱུང་ སྟེ་ ། འདི་ལྟ་སྟེ་ ། ཟབ་མོ་ བསྟན་པ་ དང་ ། སྣ་ཚོགས་ བསྟན་པ་ དང་ ། དཔེ་ བརྗོད་པ་ བསྟན་པ་ དང་ ། མདོ་ དང་ དབྱངས་ ཀྱིས་ བསྙད་པ་ དང་ ། ལུང་བསྟན་པ་ དང་ ། ཚིགས་ སུ་ བཅད་པ་ དང་ ། ཆེད་ དུ་ བརྗོད་པ་ དང་ ། གླེང་ གཞི་ དང་ ། དེ་ལྟ་ བུ་ འབྱུང་བ་ དང་ ། སྐྱེས་པ་ -འི་ རབས་ དང་ ། ཤིན་ཏུ་ རྒྱས་པ་ དང་ ། ཆོས་ གཏན་ ལ་ དབབ་པ་ བསྟན་པ་ དག་ སྟོན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “The reverberation of Dharma emanating from the lotus flowers alleviates suffering.
bo: པད་མ་ ལས་ ཆོས་ བརྗོད་པ་ བྱུང་བ་ དེ་ -འང་ དེ་ བྱེད་པ་ -འི་ སྡུག་བསྔལ་ ཡང་དག་པ་ -ར་ ཟད་པར་ འགྱུར་ རོ་ ། །

source: The bodhisattvas remain neutral and silent without abandoning resting in equipoise.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ཡང་ བཏང་སྙོམས་ སུ་ བྱེད་ ཅིང་ མི་སྨྲ་བ་ དང་ ། མཉམ་པ་ -ར་ བཞག་པ་ -འི་ གནས་ ཀྱང་ མི་ འདོར་ རོ་ ། །

source: The deliverance issuing from the manifested lotus flowers alleviates suffering and instigates the buddha activities.
bo: པད་མ་ འབྱུང་བ་ ལས་ ངེས་པར་ བྱུང་བ་ དེ་ཡང་ དེ་ བྱེད་པ་ -འི་ སྡུག་བསྔལ་ ཡང་དག་པ་ -ར་ ཟད་པར་ འགྱུར་ ཏེ་ ། སངས་རྒྱས་ ཀྱི་ མཛད་པ་ ཡང་ བྱེད་ དོ་ ། །

source: “Light rays burst forth from each and every pore of the bodhisattvas’ bodies.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ -འི་ ལུས་ ཀྱི་ སྤུ་ -འི་ ཁུང་བུ་ ཐམས་ཅད་ ནས་ འོད་ཟེར་ དག་ འབྱུང་ ངོ་ ། །

source: Lotus flowers blossom from these light rays, and more bodhisattva forms emerge from these lotus flowers.
bo: འོད་ཟེར་ དེ་དག་ ལས་ ཀྱང་ པད་མ་ དག་ འབྱུང་ ངོ་ ། ། པད་མ་ དེ་དག་ ལས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ གཟུགས་ རྣམས་ འབྱུང་ སྟེ་ །

source: These disperse into the vast, immeasurable world realms in the ten directions and perform buddha activities.
bo: དེ་དག་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐའ་ ཡས་ མུ་མེད་པ་ དག་ ཏུ་ དོང་ ནས་ སངས་རྒྱས་ ཀྱི་ མཛད་པ་ བྱེད་ དེ་ །

source: This is the introduction to the gateway of the lotus array dhāraṇī.
bo: འདི་ ནི་ པད་མ་ བཀོད་པ་ -འི་ གཟུངས་ ཀྱི་ སྒོར་ འཇུག་པ་ -འོ་ ། །

source: “Son of noble family, you may then ask, ‘What is the entering the gate of nonattachment dhāraṇī?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ ཆགས་པ་ མེད་པ་ -འི་ སྒོར་ འཇུག་པ་ ཞེས་ བྱ་བ་ -འི་ གཟུངས་ གང་ཞེ་ན་ །

source: It consists in not being attached to a single teaching and not being attached to two, three, four, five, six, seven, eight, nine, or ten teachings.
bo: འདི་ལྟ་སྟེ་ ། བསྟན་པ་ གཅིག་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ གཉིས་ དང་ ། གསུམ་ དང་ ། བཞི་ དང་ ། ལྔ་ དང་ ། དྲུག་ དང་ ། བདུན་ དང་ ། བརྒྱད་ དང་ ། དགུ་ དང་ བཅུ་ དག་ ལ་ མི་ ཆགས་ སོ་ ། །

source: It consists in not being attached to twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, or a hundred teachings.
bo: བསྟན་པ་ ཉི་ཤུ་ དང་ ། སུམ་ཅུ་ དང་ ། བཞི་ བཅུ་ དང་ ། ལྔ་ བཅུ་ དང་ ། དྲུག་ཅུ་ དང་ ། བདུན་ཅུ་ དང་ ། བརྒྱད་ཅུ་ དང་ ། དགུ་ བཅུ་ དང་ ། བརྒྱ་ དག་ ལ་ མི་ ཆགས་ སོ་ ། །

source: It consists in not being attached to a thousand, a hundred thousand, ten million, ten thousand million, or a hundred thousand million teachings. It consists in not being attached to a quadrillion, one hundred quadrillion, ten quintillion, immeasurable, innumerable, an incomparable number of, or an unfathomable number of teachings.
bo: བསྟན་པ་ སྟོང་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ བྱེ་བ་ བརྒྱ་ ཕྲག་ སྟོང་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ ཐེར་འབུམ་ དང་ ། ཁྲག་ཁྲིག་ དང་ ། གཏམས་ དང་ ། དཀྲིགས་ དང་ ། མི་ འཁྲུགས་པ་ དང་ ། ཚད་ མེད་པ་ དང་ ། གྲངས་མེད་པ་ དང་ ། མཚུངས་པ་ མེད་པ་ དང་ ། གཞལ་ དུ་ མེད་པ་ དང་ ། དཔག་ ཏུ་ མེད་པ་ ལ་ མི་ ཆགས་ སོ་ ། །

source: “It consists in not being attached to a number of teachings as vast as the number of grains of sand in the river Ganges, as vast as the number of particles in Jambudvīpa, as vast as the number of atoms of the four continents, as vast as the number of atoms in twenty, thirty, forty, or fifty trichiliocosms or in a buddhafield.
bo: བསྟན་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ འཛམ་བུ་ -འི་ གླིང་ གི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ གླིང་བཞི་པ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་ སོ་ ། ། བསྟན་པ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ ཉི་ཤུ་ དང་ ། སུམ་ཅུ་ དང་ ། བཞི་ བཅུ་ དང་ ། ལྔ་ བཅུ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ལ་ མི་ ཆགས་ སོ་ ། །
