Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: intelligence with regard to meaning rather than words or syllables, intelligent wisdom rather than intelligent consciousness, intelligence involving Dharma instead of afflictive emotions, intelligence involving reason instead of what is contrary to reason, the intelligence of bodhicitta rather than the intelligence of a śrāvaka or pratyekabuddha, tremendous intelligence rather than lesser intelligence, the intelligence of a buddha instead of the intelligence of Māra, and compassionate intelligence instead of intelligence that is hostile toward sentient beings.
bo: དོན་ གྱི་ བློ་གྲོས་ ཡིན་ གྱི་ ཚིག་འབྲུ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། ཡེ་ཤེས་ ཀྱི་ བློ་གྲོས་ ཡིན་ གྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། ཆོས་ ཀྱི་ བློ་གྲོས་ ཡིན་ གྱི་ ཉོན་མོངས་པ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། རིག་པ་ -འི་ བློ་གྲོས་ ཡིན་ གྱི་ འགལ་བ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། བྱང་ཆུབ་ ཀྱི་ སེམས་ ཀྱི་ བློ་གྲོས་ ཡིན་ གྱི་ ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ ཀྱི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། རླབས་པོ་ཆེ་ -འི་ བློ་གྲོས་ ཡིན་ གྱི་ དམན་པ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ བློ་གྲོས་ ཡིན་ གྱི་ བདུད་ ཀྱི་ བློ་གྲོས་ མ་ཡིན་པ་ དང་ ། སྙིང་རྗེ་ ཆེན་པོ་ -འི་ བློ་གྲོས་ ཡིན་ གྱི་ སེམས་ཅན་ ལ་ རྣམ་པ་ -ར་ འཚེ་བ་ -འི་ བློ་གྲོས་ མ་ཡིན་པ་ སྟེ་ །

source: “Son of noble family, there are eight bodhisattva illuminations of comprehension:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ རྟོགས་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: gaining comprehension of all teachings, of the underlying intent of what was taught, of the dispositions of beings, of the knowledge of the types of discriminating knowledge, of profound dependent arising, of the teachings via nonsequential progression, of the teachings via reverse progression, and of all the qualities of the Buddha.
bo: ཆོས་ ཐམས་ཅད་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། དགོངས་ ཏེ་ བསྟན་པ་ རྣམས་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། སེམས་ཅན་ གྱི་ བསམ་པ་ རྣམས་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ -འི་ ཤེས་པ་ རྣམས་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ ཟབ་མོ་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། སྣྲེལ་ ཞི་ -འི་ རྒྱུད་ བསྟན་པ་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། སྤྱིའུ་ཚུགས་ ཀྱི་ རྒྱུད་ བསྟན་པ་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ར་ འགྱུར་བ་ སྟེ་ །

source: “Son of noble family, there are eight bodhisattva illuminations of phenomena:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཆོས་ ཀྱི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: the illuminations of mundane factors through teaching sentient beings to engage in appropriate deeds; of supramundane factors through insightfully teaching those who wish for liberation; of unobscured factors since they have cultivated the path; of uncontaminated factors since they do not take up the defilements of desire, existence, ignorance, or views; of unconditioned factors since they have accomplished the certainty of the noble ones; of factors of pollution since they comprehend well the adventitious afflictive emotions; of factors of purification since their minds are naturally luminous; and of the factors of nirvāṇa since phenomena are totally pacified.
bo: སེམས་ཅན་ རྣམས་ ལ་ལས་ ཀྱི་ བྱ་བ་ ལ་ འཇུག་པ་ སྟོན་པ་ -ས་ འཇིག་རྟེན་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། ཐར་པ་ འདོད་པ་ རྣམས་ ལ་ ཤེས་རབ་ ཀྱིས་ སྟོན་པ་ -ས་ འཇིག་རྟེན་ ལས་ འདས་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། ལམ་ ཤིན་ཏུ་ བསྒོམས་པ་ -འི་ ཕྱིར་ སྒྲིབ་པ་ མེད་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། འདོད་པ་ དང་ ། སྲིད་པ་ དང་ ། མ་རིག་པ་ དང་ ། ལྟ་བ་ -འི་ ཟག་པ་ མི་ སློང་བ་ -འི་ ཕྱིར་ ཟག་པ་ མེད་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། འཕགས་པ་ རྣམས་ ཀྱི་ ངེས་པར་ གྱུར་པ་ མངོན་སུམ་ དུ་ བྱེད་པ་ -འི་ ཕྱིར་ འདུས་མ་བྱས་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། གློ་བུར་ གྱི་ ཉོན་མོངས་པ་ ལ་ ཤིན་ཏུ་ རྟོགས་པ་ -འི་ ཕྱིར་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། སེམས་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འི་ ཕྱིར་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ དང་ ། ཆོས་ རྣམས་ ཤིན་ཏུ་ ཉེ་བར་ ཞི་བ་ -འི་ ཕྱིར་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ ཆོས་ ཀྱི་ སྣང་བ་ སྟེ་ །

source: “Son of noble family, there are eight bodhisattva illuminations of knowledge:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཤེས་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: the illuminations of knowledge of someone who has eight existences remaining, a stream enterer, a once-returner, a non-returner, an arhat, a pratyekabuddha, a bodhisattva, and a fully awakened buddha.
bo: བརྒྱད་པ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། རྒྱུན་ དུ་ ཞུགས་པ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། ལན་ཅིག་ ཕྱིར་ འོང་བ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། ཕྱིར་ མི་ འོང་བ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། དགྲ་བཅོམ་པ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ མཁྱེན་པ་ -འི་ སྣང་བ་ སྟེ་ །

source: “Son of noble family, there are eight bodhisattva illuminations of truth:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བདེན་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: the illuminations of the cultivation of the truth by which they enter a state of certainty, by which they attain the first fruition, by which they attain the second fruition, by which they attain the third fruition, by which they attain the fourth fruition, by which they attain pratyekabuddhahood, by which they attain the acceptance of a bodhisattva, and by which they completely and perfectly awaken to the awakening of a buddha.
bo: བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ ངེས་པར་ གྱུར་པ་ ལ་ འཇུག་པ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ འབྲས་བུ་ དང་པོ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ འབྲས་བུ་ གཉིས་པ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ འབྲས་བུ་ གསུམ་པ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ འབྲས་བུ་ བཞི་པ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ རང་ སངས་རྒྱས་ ཉིད་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བཟོད་པ་ རབ་ཏུ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ དང་ ། བདེན་པ་ བསྒོམ་པ་ གང་ གིས་ སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ -ར་ འགྱུར་བ་ དེ་ ལ་ དེ་ -འི་ སྣང་བ་ སྟེ་ །

source: “Son of noble family, there are eight bodhisattva illuminations of superknowledge:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ མངོན་པར་ ཤེས་པ་ -འི་ སྣང་བ་ ནི་ བརྒྱད་པོ་ འདི་དག་ སྟེ་ །

source: the illuminations of clarity because bodhisattvas see all forms with the divine eye, of comprehension because they hear all sounds with the divine ear, of recollection because they recollect countless eons of previous existences, of natural luminosity because they gaze upon the minds of all beings, of the unobscured sky because they move by miraculous power through boundless buddhafields, of knowledge because they accomplish a knowledge that is free of defilements, of the accumulation of merit because they sustain all beings, and of the accumulation of wisdom because they eliminate the doubts of all sentient beings.
bo: ལྷ་ -འི་ མིག་ གིས་ གཟུགས་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ མཐོང་བ་ -འི་ ཕྱིར་ གསལ་བ་ -འི་ སྣང་བ་ དང་ ། ལྷ་ -འི་ རྣ་བ་ -ས་ སྒྲ་ ཐམས་ཅད་ ཐོས་པ་ -འི་ ཕྱིར་ ངེས་པར་ རྟོགས་པ་ -འི་ སྣང་བ་ དང་ ། སྔོན་ གྱི་ གནས་བསྐལ་པ་ གྲངས་མེད་པ་ རྗེས་སུ་ དྲན་པ་ -འི་ ཕྱིར་ རྗེས་སུ་ དྲན་པ་ -འི་ སྣང་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ལ་ ལྟ་བ་ -འི་ ཕྱིར་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འི་ སྣང་བ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ མཐའ་ཡས་པ་ -ར་ རྫུ་འཕྲུལ་ གྱིས་ འགྲོ་བ་ -འི་ ཕྱིར་ ནམ་མཁའ་ སྒྲིབ་པ་ མེད་པ་ -འི་ སྣང་བ་ དང་ ། ཟག་པ་ མེད་པ་ -འི་ ཤེས་པ་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་པ་ -འི་ ཕྱིར་ ཤེས་པ་ -འི་ སྣང་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཉེ་བར་ འཚོ་བ་ -འི་ ཕྱིར་ བསོད་ནམས་ ཀྱི་ ཚོགས་ ཀྱི་ སྣང་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དོགས་པ་ གཅོད་པ་ -འི་ ཕྱིར་ ཡེ་ཤེས་ ཀྱི་ ཚོགས་ ཀྱི་ སྣང་བ་ སྟེ་ །

source: “Son of noble family, there are nine bodhisattva illuminations of accomplishment:
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྒྲུབ་པ་ -འི་ སྣང་བ་ ནི་ དགུ་པོ་ འདི་དག་ སྟེ་ །

source: the illuminations through accomplishment of wisdom, insight, understanding, correct view, tranquil abiding, special insight, the intentions of beings, a liberated mind that is unperturbed, and the final illumination.”
bo: སྒྲུབ་པ་ -ས་ ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ ཤེས་རབ་ ཀྱི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ བློ་ -འི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ ཡང་དག་པ་ -འི་ ལྟ་བ་ -འི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ ཞི་གནས་ ཀྱི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ ལྷག་མཐོང་ གི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ སེམས་ཅན་ གྱི་ བསམ་པ་ -འི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ འཁྲུགས་པ་ མེད་པ་ -ར་ སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ སྣང་བ་ དང་ ། སྒྲུབ་པ་ -ས་ ཤིན་ཏུ་ མཐར་ཐུག་པ་ -འི་ སྣང་བ་ སྣང་བ་ སྟེ་ །

source: Then, the Blessed One spoke the following verses:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གསུངས་ སོ་ ། །

source: “Bodhisattvas imbued with mindfulness Do not waste the roots of virtue accumulated in the past.
bo: དྲན་པ་ དེ་ དང་ ཡང་དག་ འདྲེས་པ་ ནི་ ། ། སྔོན་ཆད་ ལས་ དགེ་ བསགས་པ་ ཆུད་ མི་ གཟོན་ ། །

source: Their excellence in subtle dedication Accomplishes buddhafields for the sake of the future.
bo: ཕྲ་བ་ -ར་ སྔོ་བ་ ཕུན་སུམ་ ཚོགས་པ་ དེ་ ། ། ཕྱི་ཕྱིར་ ཞིང་ ནི་ ཡང་དག་ སྒྲུབ་པ་ -ར་ བྱེད་ ། །

source: “They never forget the teachings they have heard, And they swiftly reach a state of certainty.
bo: ཐོས་པ་ -འི་ ཆོས་ རྣམས་ ལ་ ནི་ བརྗེད་པ་ མེད་ ། ། རྣམ་པ་ -ར་ ངེས་པ་ མྱུར་ དུ་ འཐོབ་པ་ -ར་ འགྱུར་ ། །

source: At peace, they are shielded from the sense objects.
bo: ཉེ་བར་ ཞི་བ་ -ས་ ཡུལ་ རྣམས་ ལས་ ནི་ སྦ་ -ས་ ། །

source: Endowed with mindfulness, they are freed from nonvirtue.
bo: དྲན་ དང་ ལྡན་པ་ མི་དགེ་ རྣམས་ དང་ བྲལ་ ། །

source: Having accumulated vast mindfulness, They discern which actions are to be performed.
bo: དྲན་པ་ རྒྱ་བོ་ ཆེ་ ནི་ ཤིན་ཏུ་ བསགས་ ། ། བྱ་བ་ བྱ་བ་ དག་ ནི་ རྣམ་པ་ -ར་ འབྱེད་ ། །

source: “With the blessing of the self-arisen victors Who know that they are endowed with mindfulness,
bo: དྲན་པ་ དག་ དང་ ལྡན་པ་ -ར་ རིག་ ནས་ ནི་ ། ། རྒྱལ་བ་ རང་བྱུང་ དག་ གི་ བྱིན་ གྱིས་ རློབ་ ། །

source: The bodhisattvas guard the city of the noble Dharma And teach Dharma to beings.
bo: དམ་པ་ -འི་ ཆོས་ ཀྱི་ གྲོང་ཁྱེར་ སྐྱོང་བྱེད་པ་ ། ། དེ་ ནི་ འགྲོ་བ་ རྣམས་ ལ་ ཆོས་སྟོན་ ནུས་ ། །

source: “Endowed with wisdom and separated from gloom, They accomplish the benefit of gods and humans.
bo: ཤེས་རབ་ ལྡན་པ་ མུན་པ་ རྣམ་ བྲལ་ ཏེ་ ། ། ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ནི་ དོན་ ཀྱང་ བྱེད་ ། །

source: Having attained the illumination of excellent intelligence, They eliminate doubts and hesitations.
bo: བློ་གྲོས་ བཟང་ལྡན་ སྣང་བ་ ཐོབ་ གྱུར་ ནས་ ། ། དོགས་པ་ དང་ ནི་ ཐེ་ཙོམ་ རྣམས་ ཀྱང་ གཅོད་ ། །

source: Endowed with mindfulness, their spontaneous wisdom Brings swift realization of awakening.
bo: དྲན་ དང་ ལྡན་པ་ རང་ འབྱུང་ ཡེ་ཤེས་ ཀྱིས་ ། ། བྱང་ཆུབ་ མྱུར་ དུ་ རྗེས་སུ་ རྟོགས་པ་ -ར་ བྱེད་ ། །

source: “Bodhisattvas are endowed with intelligence regarding meaning Rather than words, letters, or grammar.
bo: དེ་ ནི་ དོན་ གྱི་ བློ་གྲོས་ ཅན་ ཡིན་ གྱི་ ། ། ཚིག་འབྲུ་ -འི་ རྗེས་སུ་ མི་ རྒྱུག་ སྒྲ་ ལ་ -འང་ མིན་ ། །

source: Pure beings endowed with the intelligence of wisdom Do not long for the intelligence of ordinary consciousness.
bo: སེམས་ཅན་ དག་པ་ ཡེ་ཤེས་ བློ་གྲོས་ ཅན་ ། ། རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ བློ་གྲོས་ འདོད་མ་ ཡིན་ ། །

source: “Endowed with intelligence involving Dharma, They dispel intelligence involving afflictive emotion and are freed from delusion.
bo: ཆོས་ ཀྱི་ བློ་གྲོས་ ལྡན་པ་ -ར་ གྱུར་པ་ དེ་ ། ། ཉོན་མོངས་ བློ་གྲོས་ སེལ་ ཅིང་ གཏི་མུག་ བྲལ་ ། །

source: Knowing the ways of insight and method, They do not contravene the awakening of the Victor.
bo: ཤེས་རབ་ དང་ ནི་ ཐབས་ ཀྱི་ ཚུལ་ ཤེས་པ་ ། ། དེ་ ནི་ རྒྱལ་བ་ -འི་ བྱང་ཆུབ་ འགལ་ མི་ བྱེད་ ། །

source: “Their intelligence is focused on becoming buddhas, Not on becoming śrāvakas or pratyekabuddhas.
bo: དེ་ ནི་ སངས་རྒྱས་ འགྱུར་བ་ -འི་ བློ་གྲོས་ ལྡན་ ། ། ཉན་ཐོས་ འགྱུར་ མིན་ རང་རྒྱལ་ འགྱུར་ མ་ ཡིན་ ། །

source: They are constantly endowed with tremendous intelligence And do not long for intelligence of a lesser kind.
bo: རྟག་ ཏུ་ རླབས་ཆེན་ བློ་གྲོས་ ཅན་ ཡིན་ གྱི་ ། ། དེ་ ནི་ བློ་གྲོས་ ཆུང་ངུ་ འདོད་མ་ ཡིན་ ། །

source: “They are perpetually endowed with the intelligence of a buddha, Which does not turn into the intelligence of Māra.
bo: སངས་རྒྱས་ བློ་གྲོས་ རྟག་ ཏུ་ ལྡན་ ཡིན་ གྱི་ ། ། བདུད་ ཀྱི་ བློ་གྲོས་ སུ་ ནི་ འགྱུར་ མ་ ཡིན་ ། །

source: These intelligent ones are committed to great compassion, Not to harming any beings in any way.
bo: བློ་གྲོས་ ལྡན་པ་ སྙིང་རྗེ་ ཆེ་ -ར་ གཞོལ་ གྱི་ ། ། སེམས་ཅན་ གང་ ལ་ -འང་ རྣམ་པ་ -ར་ འཚེ་བ་ མིན་ ། །

source: “Bodhisattvas comprehend and are free from hesitation Regarding any of the teachings that the Buddha has taught.
bo: ཆོས་ འགའ་ བསྟན་པ་ གང་ཡིན་ དེ་ ལ་ ནི་ ། ། ཐེ་ཚོམ་ མེད་ ཅིང་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་ ། །

source: They become skilled in communicating their intended meanings, And they understand the conduct of sentient beings.
bo: དེ་ ནི་ དགོངས་ ཏེ་ གསུང་ ལ་ མཁས་ འགྱུར་ ཞིང་ ། ། སེམས་ཅན་ སྤྱོད་པ་ རྣམས་ ལ་ རྟོགས་ དང་ ལྡན་ ། །

source: “They comprehend discriminating knowledge And have no attachment to the application of such knowing.
bo: སོ་སོ་ ཡང་དག་ རིག་ ལ་ རྟོགས་ལྡན་ ཞིང་ ། ། དེ་ ཡི་ ཤེས་པ་ འཇུག་པ་ ཆགས་པ་ མེད་ ། །

source: They know well that conditioned phenomena Are dependently arisen and have no creator.
bo: རྐྱེན་ བྱུང་ བྱེད་པ་པོ་ དང་ རྣམ་ བྲལ་བ་ -ར་ ། ། རྟེན་པ་ -འི་ ཆོས་ རྣམས་ དག་ ནི་ རབ་ཏུ་ ཤེས་ ། །

source: “They are learned in the causes of nonsequential progression, And they comprehend the ways of reverse progression.
bo: དེ་ ནི་ སྣྲེལ་ ཞི་ -འི་ རྒྱུ་ལ་ མཁས་ གྱུར་ ཅིང་ ། ། སྤྱིའུ་ཚུགས་ ཚུལ་ ནི་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་ ། །

source: They attain comprehension Of the whole spectrum of the teachings of the Buddha.
bo: སངས་རྒྱས་ ཀྱི་ ནི་ ཆོས་ རྣམས་ ཇི་སྙེད་པ་ ། ། ཐམས་ཅད་ ཀྱང་ ནི་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་ ། །

source: “By means of their illumination of mundane phenomena, Bodhisattvas know the deeds of gods and humans.
bo: འཇིག་རྟེན་པ་ ཡི་ ཆོས་ ཀྱི་ སྣང་བ་ ཡིས་ ། ། ལྷ་ མི་ རྣམས་ ཀྱི་ ལས་ ཀྱི་ བྱ་བ་ ཤེས་ ། །

source: Through supramundane wisdom, They are endowed with the illumination of insight.
bo: འཇིག་རྟེན་ ལས་ ནི་ འདས་པ་ -འི་ ཡེ་ཤེས་ ཀྱིས་ ། ། ཤེས་རབ་ སྣང་བ་ དང་ ནི་ ལྡན་པ་ ཡིན་ ། །

source: They apply exceedingly bright wisdom Both to those with and without fault.
bo: ཁ་ན་མ་ཐོ་ -ར་ བཅས་ དང་ མ་ ཐོ་ མེད་ ། ། ཡེ་ཤེས་ རབ་ཏུ་ གསལ་བ་ ཆེན་པོ་ འཇུག་ །

source: “Because bodhisattvas have cultivated the path, They always teach the Dharma that bears fruit.
bo: ལམ་ ནི་ ཤིན་ཏུ་ བསྒོམས་པ་ -ར་ གྱུར་པ་ -འི་ ཕྱིར་ ། ། རྟག་ ཏུ་ འབྲས་བུ་ ཡོད་པ་ -ར་ ཆོས་སྟོན་ ཏོ་ ། །

source: They apply its illumination Both to contaminated and uncontaminated phenomena.
bo: ཟག་པ་ -ར་ བཅས་ དང་ ཟག་པ་ མེད་པ་ ཡི་ ། ། ཆོས་ ལ་ དེ་ ཡི་ སྣང་བ་ རབ་ཏུ་ འཇུག་ །

source: They abandon all contaminants And thus benefit both gods and humans.
bo: དེ་ ནི་ ཟག་པ་ ཐམས་ཅད་ སྤོང་ བྱེད་ ཅིང་ ། ། ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ནི་ དོན་ ཀྱང་ བྱེད་ ། །

source: “Bodhisattvas constantly apply their knowledge Both to conditioned and unconditioned phenomena.
bo: འདུས་མ་བྱས་ དང་ འདུས་བྱས་ ཆོས་ རྣམས་ ལ་ ། ། དེ་ ཡི་ ཤེས་པ་ རྟག་ ཏུ་ རབ་ཏུ་ འཇུག་ །

source: They are thereby free from stains and without distorted vision.
bo: དེ་ ནི་ དེ་ ཡིས་ དྲི་བྲལ་ རབ་རིབ་ མེད་ ། །

source: Having attained flawlessness, they likewise engage in good conduct.
bo: སྐྱོན་མེད་ ཐོབ་ ནས་ སྤྱད་པ་ རྣམས་ ཀྱང་ སྤྱོད་ ། །

source: “Bodhisattvas apply their unobscured knowledge To the factors of purification and pollution.
bo: རྣམ་པ་ -ར་ བྱང་ དང་ ཀུན་ ནས་ ཉོན་མོངས་ ལ་ ། ། དེ་ ཡི་ ཤེས་པ་ སྒྲིབ་པ་ མེད་པ་ འཇུག་ །

source: Thus they understand that the mind is luminous by nature And the ways in which it becomes polluted.
bo: རང་བཞིན་ གྱིས་ ནི་ སེམས་ འོད་གསལ་བ་ དང་ ། ། ཀུན་ ནས་ ཉོན་མོངས་པ་ ཡི་ ཚུལ་ ཡང་ ཤེས་ ། །

source: “Bodhisattvas know how the state of nirvāṇa Is unborn and without origination.
bo: ཇི་ལྟར་ མྱ་ངན་ འདས་པ་ -ར་ གྱུར་པ་ ནི་ ། ། སྐྱེ་བ་ མེད་ ཅིང་ འབྱུང་བ་ མེད་པ་ -ར་ ཤེས་ ། །

source: In the same way, in the Great Vehicle, The illuminations of phenomena are infinite.
bo: འདི་འདྲ་ འདི་ ནི་ ཐེག་པ་ ཆེན་པོ་ ལ་ ། ། ཆོས་ ཀྱི་ སྣང་བ་ མཐའ་ ཡས་ གྱུར་པ་ ཡིན་ ། །

source: “Bodhisattvas pursue the knowledge of one with eight existences remaining And the knowledge of a stream enterer. They pursue the knowledge of a once-returner And the knowledge of a non-returner.
bo: དེ་ ནི་ བརྒྱད་པ་ ཡི་ ནི་ ཤེས་པ་ དང་ ། ། རྒྱུན་ དུ་ ཞུགས་ ལ་ ཤེས་པ་ འཇུག་པ་ དང་ ། ། ལན་ཅིག་ ཕྱིར་ འོང་བ་ ཡི་ ཤེས་པ་ དང་ ། ། ཕྱིར་ མི་ འོང་ ལ་ ཤེས་པ་ འཇུག་པ་ དང་ ། །

source: “They pursue the knowledge and accomplishments Of all the arhats and pratyekabuddhas,
bo: དེ་ ནི་ དགྲ་བཅོམ་པ་ དང་ རང་རྒྱལ་ དང་ ། ། འཇིག་རྟེན་ མགོན་པོ་ བྱང་ཆུབ་ སེམས་དཔའ་ དག་ །

source: Of all the world protectors and the bodhisattvas, Without a single exception.
bo: ཀུན་ ལ་ དེ་ ཡི་ ཤེས་ དང་ སྒྲུབ་པ་ རྣམས་ ། ། ལྷག་མ་ ལུས་པ་ མེད་པ་ -ར་ རབ་ཏུ་ འཇུག་ །

source: “Those heroes who Attain the fruitions, Who gain deliverance in the imperturbable ultimate,
bo: གང་ གིས་ འབྲས་བུ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ དང་ ། ། འཁྲུགས་ མེད་ དོན་དམ་ ངེས་པར་ འབྱུང་འགྱུར་བ་ ། །

source: And who disclose its cultivation embody the illumination of the truths.
bo: དེ་ ལ་ རབ་ བསྒོམས་ སྨྲ་བ་ དཔའ་བོ་ རྣམས་ ། ། བདེན་པ་ -འི་ སྣང་བ་ དག་ དང་ ལྡན་པ་ ཡིན་ ། །

source: “Since they have cultivated those truths, They enter a state of flawlessness and attain the first fruition.
bo: བདེན་པ་ དག་ ནི་ བསྒོམ་པ་ བྱས་པ་ -ས་ ན་ ། ། སྐྱོན་མེད་ འཇུག་ དང་ འབྲས་བུ་ དང་པོ་ འཐོབ་ ། །

source: They also attain the second, the third, the fourth, And likewise the fruition of pratyekabuddhahood.
bo: གཉིས་ དང་ གསུམ་ དང་ དེ་བཞིན་ བཞི་པ་ དང་ ། ། རང་རྒྱལ་ རྣམས་ ཀྱི་ འབྲས་བུ་ ཐོབ་པ་ -ར་ འགྱུར་ ། །

source: “Those tigers of speech who through cultivation Attain acceptance And attain the awakening of the victors Will illuminate those truths.
bo: བསྒོམ་པ་ གང་ གིས་ སུ་ ནི་ སྨྲ་བ་ -འི་ སྟག་ ། དེ་དག་ བཟོད་པ་ དག་ ནི་ འཐོབ་ འགྱུར་ དང་ ། ། གང་ གིས་ རྒྱལ་བ་ བྱང་ཆུབ་ འཚང་རྒྱ་བ་ ། ། བདེན་པ་ དེ་དག་ ལ་ ནི་ སྣང་བ་ -ར་ འགྱུར་ ། །

source: “Bodhisattvas see all aspects of form With the divine eye.
bo: ལྷ་ ཡི་ མིག་ གིས་ སུ་ ནི་ དེ་ ཡིས་ ཀྱང་ ། ། གཟུགས་ ཀྱི་ རྣམ་པ་ དག་ ནི་ ཐམས་ཅད་ མཐོང་ ། །

source: They perceive the sounds of the ten directions Through the discernment of the divine ear.
bo: ལྷ་ ཡི་ རྣ་བ་ ངེས་པར་ རྟོགས་པ་ ཡིས་ ། ། ཕྱོགས་ བཅུ་ དག་ གི་ སྒྲ་ རྣམས་ རྟོགས་པ་ -ར་ འགྱུར་ ། །

source: “Through the illumination of the knowledge of previous existences, They recall billions of eons.
bo: སྔོན་ གྱི་ གནས་ ཤེས་པ་ ཡི་ སྣང་བ་ ཡིས་ ། ། བསྐལ་པ་ ཁྲག་ཁྲིག་ དག་ ནི་ རྗེས་སུ་ དྲན་ ། །

source: Through the illumination of the knowledge of luminosity, They have knowledge of the mental conduct of others.
bo: འོད་གསལ་བ་ ཡི་ ཤེས་པ་ -འི་ སྣང་བ་ ཡིས་ ། ། གཞན་ གྱི་ སེམས་ ཀྱི་ སྤྱོད་པ་ རྣམས་ ལ་ མཁས་ ། །

source: “Through the illumination of the knowledge of miracles, They move throughout billions of buddhafields in the ten directions.
bo: རྫུ་འཕྲུལ་ གྱི་ ནི་ ཤེས་པ་ -འི་ སྣང་བ་ ཡིས་ ། ། ཕྱོགས་ བཅུ་ -འི་ ཞིང་ ནི་ ཁྲག་ཁྲིག་ རྣམས་ སུ་ འགྲོ་ ། །

source: Their illumination of uncontaminated knowledge Is similar to space.
bo: ཟག་པ་ མེད་པ་ -འི་ ཤེས་པ་ -འི་ སྣང་བ་ ནི་ ། ། ནམ་མཁའ་ དང་ ནི་ མཚུངས་ ཤིང་ འདྲ་བ་ ཡིན་ ། །

source: “Through the meritorious illumination of boundless superknowledge, Bodhisattvas first approach beings,
bo: བསོད་ནམས་ ཀྱི་ ནི་ སྣང་བ་ མཐའ་ཡས་པ་ -འི་ ། ། མངོན་ཤེས་ ཐོག་མ་ འགྲོ་བ་ ཉེ་བར་ འགྲོ་ ། །

source: And then, through dispassionate knowledge of them, They eliminate the doubts of those beings.
bo: དེ་ ཡི་ ཤེས་པ་ ཆགས་པ་ མེད་པ་ ཡིས་ ། ། འགྲོ་བ་ -འི་ དོགས་པ་ དག་ ནི་ གཅོད་པ་ -ར་ བྱེད་ ། །

source: “Yogic practitioners who apply themselves vigorously Thus gain the illuminations of mindfulness, Intelligence, comprehension, phenomena, and knowledge, The boundless illumination of truth, And the illumination of superknowledge.
bo: ནན་ཏན་ སྙིང་པོ་ -ར་ བྱེད་པ་ -འི་ རྣལ་འབྱོར་པ་ ། ། དྲན་ དང་ བློ་གྲོས་ རྟོགས་ དང་ ཆོས་ཤེས་ སྣང་ ། ། བདེན་པ་ ཡི་ ནི་ སྣང་བ་ མཐའ་ ཡས་ ཏེ་ ། ། མངོན་པར་ ཤེས་པ་ -འི་ སྣང་བ་ -ར་ གྱུར་པ་ ཡིན་ ། །

source: “Accomplishment culminates in wisdom and insight, Vast understanding and boundless eloquence, Correct view and special insight, And total imperturbability.
bo: སྒྲུབ་པ་ -ས་ ཡེ་ཤེས་ དང་ ནི་ ཤེས་རབ་ དང་ ། ། རྒྱ་ ཆེན་ བློ་ དང་ སྤོབས་པ་ མཐའ་ ཡས་ དང་ ། ། ཡང་དག་ ལྟ་བ་ དང་ ནི་ ལྷག་མཐོང་ དང་ ། ། ཤིན་ཏུ་ འཁྲུགས་པ་ མེད་པ་ མཐར་ཐུག་ གྱུར་ ། །

source: “Even though those powerful beings In whom these eight pure illuminations are present Might not obtain awakening right now, They will nonetheless perform buddha activities.”
bo: སྣང་བ་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ དག་པ་ བརྒྱད་ ། ། འདི་དག་ མཐུ་ཆེན་ གང་ ལ་ ཡོད་པ་ ནི་ ། ། རེ་ཞིག་ བྱང་ཆུབ་ ཐོབ་པ་ -ར་ མ་ གྱུར་ ཀྱང་ ། ། དེ་ ནི་ སངས་རྒྱས་ མཛད་པ་ བྱེད་པ་ -ར་ འགྱུར་ ། །

source: Then the Blessed One told Dhāraṇīśvara­rāja,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ བཀའ་ སྩལ་པ་ །

source: “Son of noble family, there are sixteen ways in which bodhisattvas give rise to great bodhisattva compassion for sentient beings.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམ་པ་ བཅུ་དྲུག་ གིས་ སེམས་ཅན་ རྣམས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ སྐྱེ་ -འོ་ ། །

source: What are these sixteen ways?
bo: བཅུ་དྲུག་ གང་ཞེ་ན་ །

source: Son of noble family, bodhisattvas give rise to a bodhisattva’s great compassion for sentient beings while thinking as follows:
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ འདི་ སྙམ་ དུ་ །

source: “ ‘Alas, these beings are fettered by personalistic views, and they are mixed up with various kinds of wrong views.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ -ས་ བཅིངས་པ་ ། ལྟ་བ་ སྣ་ཚོགས་ དང་ འདྲེས་པ་ དག་ སྟེ་ །

source: To help them abandon all those views, I shall teach them the Dharma.
bo: ལྟ་བ་ ཐམས་ཅད་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings, due to misapprehension about what is actually the case, perceive what is impermanent to be permanent, what is painful to be pleasant, what is no self to be a self, and what is repulsive to be attractive.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ཡོད་པ་ མ་ཡིན་པ་ -འི་ ཕྱིན་ ཅི་ ལོག་ ཏུ་ གྱུར་ ནས་ མི་རྟག་པ་ ལ་ རྟག་པ་ -ར་ འདུ་ཤེས་ ། སྡུག་བསྔལ་བ་ ལ་ བདེ་བ་ -ར་ འདུ་ཤེས་ ། བདག་མེད་པ་ ལ་ བདག་ ཏུ་ འདུ་ཤེས་ ། མི་ སྡུག་པ་ ལ་ སྡུག་པ་ -ར་ འདུ་ཤེས་པ་ དག་ སྟེ

source: To help them abandon all misapprehensions, I shall teach them the Dharma.
bo: ཕྱིན་ ཅི་ ལོག་ ཐམས་ཅད་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are stuck grasping onto I and mine, and they perceive what is insubstantial to be substantial.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ངར་ འཛིན་པ་ དང་ ། ང་ ཡི་ -ར་ འཛིན་པ་ ལ་ གནས་པ་ ། དངོས་པོ་ མེད་པ་ ལ་ དངོས་པོ་ -ར་ འདུ་ཤེས་པ་ དག་ སྟེ

source: To help them abandon grasping onto I and mine, I shall teach them the Dharma.
bo: ངར་ འཛིན་པ་ དང་ ང་ ཡི་ -ར་ འཛིན་པ་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are obstructed by the five obstructions: they are tormented by sharp pangs of desire, they are very aggressive, they are attached to fogginess and sleep, they are excited and regretful toward ignoble objects, and they are unable to reach certainty about the holy Dharma.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ སྒྲིབ་པ་ ལྔ་ -ས་ བསྒྲིབས་ ཏེ་ འདོད་པ་ -འི་ ཟུག་རྔུ་ -ས་ ཟུག་པ་ ། ཁོང་ཁྲོ་བ་ མང་བ་ ། རྨུགས་པ་ དང་ གཉིད་ ལ་ ཆགས་པ་ ། དམ་པ་ མ་ཡིན་པ་ ལ་ འགྱོད་པ་ ཀུན་ ནས་ ལངས་པ་ ། ཟབ་མོ་ -འི་ ཆོས་ ལ་ ངེས་པ་ མ་ ཐོབ་པ་ དག་ སྟེ

source: To help them abandon all obstructions, I shall teach them the Dharma.
bo: སྒྲིབ་པ་ ཐམས་ཅད་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are bound by attachment to the six sense fields:
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་ ནི་ སྐྱེ་མཆེད་ དྲུག་ གིས་ ཆགས་པ་ -ས་ ཆགས་ ཏེ
