Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: They know the realms of beings who have become human, the causes of their birth, and the causes of their liberation.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ མི་ -ར་ གྱུར་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ -འི་ སྐྱེ་བ་ -འི་ རྒྱུ་ དང་ ཐར་པ་ -འི་ རྒྱུ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the realms of beings who are currently gods, the causes of their birth, and the causes of their liberation.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ ལྷ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ -འི་ སྐྱེ་བ་ -འི་ རྒྱུ་ དང་ ཐར་པ་ -འི་ རྒྱུ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the mindstreams of present sentient beings, their afflictive emotions, and their lack of afflictive emotions.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ རྒྱུན་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་དག་ ཉོན་མོངས་པ་ དང་ བཅས་པ་ དང་ ། ཉོན་མོངས་པ་ དང་ བྲལ་བ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the faculties of present beings fit to be tamed and those who are not fit to be tamed.
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ གདུལ་བ་ -ར་ འོས་པ་ རྣམས་ ཀྱི་ དབང་པོ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “Even though the tathāgatas know in this manner, they have no consciousness that pursues dualities, and they teach the Dharma to beings in order to introduce them to nonduality.
bo: གདུལ་བ་ -ར་ འོས་པ་ མ་ཡིན་པ་ དག་ གི་ དབང་པོ་ རྣམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་བཞིན་ གཤེགས་པ་ -ས་ དེ་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ གཉིས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ མེད་ ཅིང་ གཉིས་ སུ་ མེད་པ་ ལ་ གཟུད་པ་ -འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ

source: This is the thirty-second tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ སུམ་ཅུ་རྩ་གཉིས་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The sphere of activity of the victors is infinite.
bo: རྒྱལ་བ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ཐུག་པ་ མེད་ ། །

source: It is immeasurable, unfathomable, and inconceivable,
bo: ཚད་ མེད་ གཞལ་ དུ་ མེད་ ཅིང་ བསམ་ མི་ ཁྱབ་ ། །

source: Equal to space and beyond compare.
bo: ནམ་མཁའ་ མཚུངས་ ཤིང་ དཔེ་ ཡང་ མེད་པ་ སྟེ་ ། །

source: No one is capable of knowing it.
bo: འགྲོ་བ་ ཀུན་ གྱིས་ ཤེས་པ་ -ར་ མི་ ནུས་ སོ་ ། །

source: “ ‘The victors know fully Each and every action performed by beings In the present moment, throughout the ten directions.
bo: ཕྱོགས་ བཅུ་ དག་ ན་ ད་ལྟར་ བྱུང་བ་ ཡི་ ། ། འགྲོ་བ་ -འི་ བྱ་བ་ -ར་ གྱུར་པ་ ཇི་སྙེད་པ་ ། ། དེ་དག་ ཐམས་ཅད་ རྒྱལ་བ་ -ས་ རྗེས་སུ་ མཁྱེན་ ། །

source: This is the supreme activity of the spontaneously arisen ones.’
bo: འདི་ ནི་ རང་བྱུང་ རྣམས་ ཀྱི་ ལས་ ཀྱི་ མཆོག་ །

source: “Son of noble family, these are the thirty-two tathāgata activities.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ནི་ སུམ་ཅུ་རྩ་གཉིས་པོ་ འདི་དག་ སྟེ་ །

source: With these the tathāgatas tame the masses of beings.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ དེ་དག་ དང་ ལྡན་པ་ -ས་ སེམས་ཅན་ གྱི་ ཁམས་ འདུལ་ ལོ་ ། །

source: Even though the tathāgata activities are immeasurable, they are presented in abbreviated form in order to guide beings.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ནི་ ཚད་ མེད་ མོད་ ཀྱི་ ། སེམས་ཅན་ རྣམས་ གཟུད་པ་ -འི་ ཕྱིར་ མདོ་ ཙམ་ དུ་ ཚད་ ཀྱིས་ བསྟན་ ཏོ་ །། །།

source: “Son of noble family, the tathāgata activity of the tathāgatas is immeasurable.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ གང་ཡིན་པ་ དེ་ ནི་ ཚད་ མེད་པ་ -འོ་ ། །

source: It is inconceivable.
bo: བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ། །

source: It remains unknowable to the whole world, indescribable by language, and hard for others to achieve.
bo: འཇིག་རྟེན་ ཐམས་ཅད་ ཀྱིས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འོ་ ། ། ཡི་གེ་ རྣམས་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འོ་ ། ། གཞན་དག་ གིས་ ཐོབ་པ་ -ར་ དཀའ་བ་ -འོ་ ། །

source: It exists unceasingly in all buddhafields, conforms equally to all buddhas, and completely transcends all efforts.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ དུ་ རྒྱུན་ ཆད་པ་ མེད་པ་ -འོ་ ། ། སངས་རྒྱས་ ཐམས་ཅད་ དང་ མཉམ་པ་ཉིད་ དུ་ རྗེས་སུ་ སོང་བ་ -འོ་ ། ། འབད་པ་ -འི་ བྱ་བ་ ཐམས་ཅད་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འོ་ ། །

source: It is nonconceptual since it is equal to space.
bo: ནམ་མཁའ་ དང་ མཉམ་པ་ཉིད་པ་ -ས་ རྣམ་པ་ -ར་ མི་ རྟོག་པ་ -འོ་ ། །

source: Since it is the action of the realm of phenomena, it does not act in a differentiated way.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ཀྱི་ བྱ་བ་ མ་ཡིན་པ་ -ས་ སྣ་ཚོགས་ སུ་ བྱར་མེད་པ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Son of noble family, the blessed buddhas do not appear in order to deliver differentiated discourses.
bo: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ནི་ གཏམ་ སྣ་ཚོགས་ ཀྱི་ ཆེད་ དུ་ འབྱུང་བ་ མ་ ཡིན་ ཏེ་ །

source: Nor, indeed, do they appear in order to deliver discourses that differentiate beings, buddhafields, dharmas, intentions, liberations, or types of nirvāṇa.
bo: སེམས་ཅན་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ ། ཞིང་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ ། བསྟན་པ་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ ། བསམ་པ་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ ། ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ སྣ་ཚོགས་ ཀྱི་ གཏམ་ གྱི་ ཕྱིར་ མ་ ཡིན་ གྱི་ །

source: Rather, upon attaining complete and perfect buddhahood, the tathāgatas—who are of one taste with the realm of phenomena, who are unobstructed, and who provide opportunity to all beings—set in motion the unobstructed wheel of the Dharma—the irreversible wheel of the Dharma—so that beings may comprehend the Dharma.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཆོས་ ཀྱི་ དབྱིངས་ རོ་ གཅིག་པ་ ། སྒྲིབ་པ་ མེད་པ་ ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ གོ་སྐབས་ འབྱེད་པ་ ། མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ནས་ སེམས་ཅན་ རྣམས་ ཆོས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ སྒྲིབ་པ་ མེད་པ་ -འི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ འདི་ལྟ་སྟེ་ ། ཕྱིར་ མི་ ལྡོག་པ་ -འི་ འཁོར་ལོ་ རབ་ཏུ་ བསྐོར་ རོ་ ། །

source: “Consider, son of noble family, the analogy of an expert jeweler who knows the procedure for purifying gems.
bo: རིགས་ ཀྱི་ བུ་ འདི་ལྟ་སྟེ་ ། དཔེར་ན་ ནོར་བུ་ མཁན་ མཁས་པ་ ནོར་བུ་ སྦྱང་བ་ -འི་ ཆོ་ག་ ཤིན་ཏུ་ ཤེས་པ་ དེ་ -ས་ ནོར་བུ་ -འི་ རིགས་ ལས་ སྦྱང་བ་ མ་ བྱས་པ་ -འི་ ནོར་བུ་ རིན་པོ་ཆེ་ བླངས་ ནས་

source: He picks out a rough gem from a mine and rinses it in a strong soda solution.
bo: བུལ་ ཐོག་ གི་ ཆུ་ རྣོན་པོ་ -ས་ བཀྲུས་ ཏེ་ །

source: He then polishes it with a cloth made of black hair. But his efforts do not stop there.
bo: སྐྲ་ ནག་པོ་ -འི་ ལ་བ་ -ས་ བྱི་དོར་ བྱ་བ་ -ས་ བྱི་དོར་ བྱེད་ ཀྱང་ དེ་ཙམ་ གྱིས་ བརྩོན་འགྲུས་ རྒྱུན་ མི་ གཅོད་ ཀྱི་ །

source: Next he rinses the gem in a strong quicksilver solution and polishes it with sawdust and woolen cloth.
bo: དེ་ -འི་ འོག་ ཏུ་ དངུལ་ཆུ་ རྣོན་པོ་ དང་ བཅས་པ་ -ས་ བཀྲུས་ ཏེ་ ། ཤིང་ དང་ སྣམ་བུ་ -ས་ བྱི་དོར་ བྱ་བ་ -ས་ བྱི་དོར་ བྱེད་ དོ་ ། །

source: But his efforts do not stop there.
bo: དེ་ཙམ་ གྱིས་ ཀྱང་ བརྩོན་འགྲུས་ རྒྱུན་ མི་ གཅོད་ དེ་ །

source: Finally he rinses it in a great purifying liquid and polishes it with the finest cotton.
bo: དེ་ -འི་ འོག་ ཏུ་ ཡང་ སྨན་ཆེན་པོ་ -འི་ ཁུ་བ་ -ས་ བཀྲུས་ ཏེ་ ། རས་ ཕྲ་མོ་ -ས་ བྱི་དོར་ བྱ་བ་ -ས་ བྱི་དོར་ བྱེད་ དོ་ ། །

source: Once he has polished it and separated it from the lesser quartz, it may thenceforth be called beryl.
bo: བྱི་དོར་ བྱས་ ཏེ་ ནོར་བུ་ མཆིང་བུ་ -འི་ རིགས་ དང་ བྲལ་ ནས་ བཻ་ དཱུརྱ་ ཞེས་ བྱ་ -འོ་ ། །

source: “In the same way, son of noble family, when the tathāgatas know the masses of completely impure beings, they cause beings who delight in saṃsāra to experience revulsion through discourses on impermanence, suffering, no self, and unattractiveness, which provoke revulsion.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡོངས་སུ་ མ་ དག་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ རིག་ ནས་ མི་རྟག་པ་ དང་ ། སྡུག་བསྔལ་བ་ དང་ ། བདག་མེད་པ་ དང་ ། མི་ སྡུག་པ་ ཡིད་འབྱུང་ བར་ འགྱུར་བ་ -འི་ གཏམ་ གྱིས་ འཁོར་བ་ ལ་ མངོན་པར་ དགའ་བ་ -འི་ སེམས་ཅན་ རྣམས་ ཡིད་འབྱུང་ བར་ བྱེད་ །

source: Then, they cause them to enter the Dharma and Vinaya of the noble ones.
bo: འཕགས་པ་ -འི་ ཆོས་ འདུལ་བ་ ལ་ འཇུག་པ་ -ར་ བྱེད་ དོ་ ། །

source: But the efforts of the tathāgatas do not stop there.
bo: དེ་ཙམ་ གྱིས་ དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ རྒྱུན་ མི་ གཅོད་ ཅིང་ །

source: Next, they cause beings to comprehend the way of the tathāgatas through discourses on emptiness, signlessness, and wishlessness.
bo: དེ་ -འི་ འོག་ ཏུ་ སྟོང་པ་ཉིད་ དང་ ། མཚན་མ་ མེད་པ་ དང་ ། སྨོན་པ་ མེད་པ་ -འི་ གཏམ་ གྱིས་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ ཚུལ་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱེད་ དོ་ ། །

source: But the efforts of the tathāgatas do not stop there.
bo: དེ་ཙམ་ གྱིས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ རྒྱུན་ མི་ གཅོད་ ཀྱི་ །

source: Finally, they guide beings into the domain of the tathāgatas through discourses known as The Irreversible Wheel of the Dharma and The Purification of the Triple Sphere.
bo: དེ་ -འི་ འོག་ ཏུ་ ཕྱིར་ མི་ ལྡོག་པ་ -འི་ འཁོར་ལོ་ -འི་ གཏམ་ དང་ ། འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ -འི་ གཏམ་ གྱིས་ སེམས་ཅན་ དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡུལ་ ལ་ འཛུད་ དོ་ ། །

source: Once beings with their various causes and natures have entered equality, they comprehend the true nature of the tathāgatas and may thenceforth be called unsurpassed recipients of generosity.
bo: སེམས་ཅན་ རྒྱུ་ དང་ ། རང་བཞིན་ སྣ་ཚོགས་པ་ དེ་དག་ མཉམ་ དུ་ ཞུགས་ ནས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཆོས་ཉིད་ ཁོང་ དུ་ ཆུད་པ་ -ས་ སྦྱིན་གནས་ བླ་ ན་ མེད་པ་ རྣམས་ ཞེས་ བྱ་ -འོ་ ། །

source: “Therefore, son of noble family, you should understand by way of this exposition that tathāgata activity is inconceivable, universally applicable, flawless in every way, and attuned with the three times, and that it constitutes the unbroken continuity of the lineage of the Three Jewels.
bo: དེ་ -འི་ ཕྱིར་ རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ ཇི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དང་ ། ཀུན་ གྱི་ རྗེས་སུ་ སོང་བ་ དང་ ། ཐམས་ཅད་ དུ་ ཁ་ན་མ་ཐོ་བ་ མེད་པ་ དང་ ། དུས་གསུམ་ གྱི་ རྗེས་སུ་ སོང་བ་ དང་ ། དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ རྣམ་ གྲངས་ འདི་ -ས་ ཀྱང་ འདི་ལྟར་ རིག་པ་ -ར་ བྱ་ སྟེ

source: The tathāgatas abide in inconceivable tathāgata activity.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དེ་ ལ་ ཡང་ གནས་ སོ་ ། །

source: They do not discard their space-like bodies.
bo: ནམ་མཁའ་ -འི་ རང་བཞིན་ གྱི་ ལུས་ ཀྱང་ མི་ འདོར་ རོ་ ། །

source: They teach in all buddhafields.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ དུའང་ སྟོན་ ཏོ་ ། །

source: They do not eschew words that communicate the inexpressible Dharma.
bo: བརྗོད་ དུ་ མེད་པ་ -འི་ ཆོས་སྟོན་པ་ -འི་ ཚིག་ ཀྱང་ མི་ འདོར་ རོ་ ། །

source: Rather, they teach the Dharma to sentient being by causing them to understand how things really are.
bo: སྒྲ་ ཇི་བཞིན་ གྱི་ རྣམ་པ་ -ར་ རིག་བྱེད་ ཀྱིས་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏོ་ ། །

source: They know the minds of all beings to be without objectification, and they know the thoughts in their minds.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ དམིགས་པ་ དང་ བྲལ་བ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ ཀྱི་ བསམ་པ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: The blessed buddhas appear in order to purify the bodhisattva intention.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསམ་པ་ རྣམ་པ་ -ར་ དག་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ འབྱུང་ ངོ་ ། །

source: “Son of noble family, this unceasing and uninterrupted continuity, this unbroken continuity, this unbroken continuity of discourses that prophesy bodhisattvas constitutes the tathāgata activity of the tathāgatas.”
bo: རིགས་ ཀྱི་ བུ་ གང་ རྒྱུན་ ཆད་པ་ མེད་པ་ རྒྱུན་ཆགས་པ་ ། རྒྱུན་ མི་ གཅོད་པ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ལུང་བསྟན་པ་ -འི་ གཏམ་རྒྱུན་ མི་ གཅོད་པ་ འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཡང་དག་པ་ -འོ་ ། །

source: When this exposition of tathāgata activity had been delivered, the unfathomable, innumerable, and uncountable buddhafields of the ten directions shook six times.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དཔག་ ཏུ་ མེད་པ་ ། གྲངས་མེད་པ་ ། བགྲང་བ་ ལས་ ཤིན་ཏུ་ འདས་པ་ དག་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: They shone brightly and were sprinkled with flower petals.
bo: སྣང་བ་ ཆེན་པོ་ -ས་ ཀྱང་ གསལ་བ་ -ར་ གྱུར་ ཏོ་ ། ། མེ་ཏོག་ གི་ སིལ་མ་ -ས་ ཀྱང་ གཏོར་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: When each and every one of the radiant and resplendent gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, monks and nuns, and male and female lay practitioners who had assembled in the pavilion Jeweled Array heard the present Dharma discourse explaining tathāgata activity, they all grew content, pleased, and delighted.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ གཟི་བརྗིད་ ཆེ་བ་ གཟི་བརྗིད་ ཆེ་བ་ -འི་ ལྷ་ དང་ ། ཀླུ་ དང་ ། གནོད་སྦྱིན་ དང་ ། དྲི་ཟ་ དང་ ། ལྷ་མ་ ཡིན་ དང་ ། ནམ་མཁའ་ ལྡིང་ དང་ ། མི་ འམ་ ཅི་ དང་ ། ལྟོ་འཕྱེ་ ཆེན་པོ་ དང་ ། མི་ དང་ ། མི་མ་ཡིན་པ་ དང་ ། དགེ་སློང་ དང་ ། དགེ་སློང་ མ་ དང་ ། དགེ་བསྙེན་ དང་ ། དགེ་བསྙེན་མ་ ཇི་སྙེད་ འདུས་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བསྟན་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཐོས་ ནས་ ཚིམ་ ཞིང་ མགུ་ སྟེ་ ཡི་ རངས་ ནས་

source: As an act of worship to the Tathāgata, they offered flowers, fragrance, incense, garlands, lotions, powders, religious robes, canopies, victory banners, and various types of draped banners.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ མེ་ཏོག་ དང་ ། བདུག་པ་ དང་ ། སྤོས་ དང་ ། ཕྲེང་བ་ དང་ ། བྱུག་པ་ དང་ ། ཕྱེ་མ་ དང་ ། ཆོས་གོས་ དང་ ། གདུགས་ དང་ ། རྒྱལ་མཚན་ དང་ ། བ་དན་ རྣམ་པ་ སྣ་ཚོགས་ རྣམས་

source: They played cymbals and other musical instruments and sang melodious songs in veneration of the blessed ones.
bo: སིལ་སྙན་ དང་ ། ཕེག་ རྡོབ་པ་ དང་ ། གླུ་དབྱངས་ བྱེད་པ་ -ས་ བཅོམ་ལྡན་འདས་ རྣམས་ མཆོད་ དོ་ ། །

source: They scattered flowers over the crown of his head.
bo: དབུ་ -འི་ གཙུག་ ཏུ་ མེ་ཏོག་ རྣམས་ ཀྱིས་ ཀྱང་ གཏོར་ ཏོ་ ། །

source: They sprinkled spherical ornaments, earrings, armlets, jewel necklaces, pearl necklaces, crescent-shaped adornments, muslin ornaments, mongoose decorations, rings, bangles, decorations shaped like the leaves of a tala tree, ornaments interwoven with flowers, shoulder ornaments, anklets, long necklaces, head ornaments, hand jewelry, and ornaments for the ears and feet.
bo: ཐིག་ལེ་ ལྟ་བུ་ -འི་ རྒྱན་ དང་ ། རྣ་ཆ་ དང་ ། དཔུང་རྒྱན་ དང་ ། ནོར་བུ་ -འི་ རྒྱན་ ཕྲེང་ དང་ ། མུ་ཏིག་ གི་ རྒྱན་ ཕྲེང་ དང་ ། རྒྱན་ ཟླ་གམ་ དང་ ། སྤེན་ཏོག་ རྒྱན་ དང་ ། རྒྱན་ ནེའུ་ལེ་ ཅན་ དང་ ། སོར་གདུབ་ རྒྱན་ དང་ ། གདུ་བུ་ རྒྱན་ ཏ་ལ་ འདབ་ དང་ ། རྒྱན་ ལྕམ་ ཁྲིས་ ཅན་ དང་ ། སེ་རལ་ ཕྲེང་ དང་ ། རྐང་གདུབ་ དང་ ། དོ་ཤལ་ དང་ ། མགོ་རྒྱན་ དང་ ། ལག་ རྒྱན་ དང་ ། རྣ་རྒྱན་ དང་ ། རྐང་རྒྱན་ རྣམས་ ཀྱིས་ ཀྱང་ གཏོར་ ཏོ་ ། །

source: The assembly also spread out precious stones of beryl, gold from the Jambu River, precious stones of emerald, red gems, sapphires, fire-colored gems, gems with brilliant light, and multicolored gems.
bo: རིན་པོ་ཆེ་ བཻ་ དཱུརྱ་ དག་ ཀྱང་ གཏོར་ ཏོ་ ། ། འཛམ་བུ་ ཆུ་བོ་ -འི་ གསེར་ རིན་པོ་ཆེ་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ རྡོ་ -འི་ སྙིང་པོ་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ དཔལ་ གྱི་ སྙིང་པོ་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ ཨན་ ད་ རྙིལ་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ མེ་ མདོག་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ སྐར་འོད་ རྣམས་ དང་ ། རིན་པོ་ཆེ་ ཁ་དོག་ མཐའ་ ཡས་ རྣམས་ ཀྱིས་ ཀྱང་ གཏོར་ ཏོ་ ། །

source: They scattered gold and silver dust as well as fragrant aloe powder, incense, sandalwood powder, benzoin powder, red sandalwood powder, and lotus powder.
bo: གསེར་ ཕྱེ་ དང་ ། དངུལ་ ཕྱེ་ དང་ ། ཨ་ ག་ རུའི་ ཕྱེ་མ་ དང་ ། རྒྱ་སྤོས་ ཀྱི་ ཕྱེ་མ་ དང་ ། ཙན་དན་ གྱི་ ཕྱེ་མ་ དང་ ། ཙན་དན་ དུས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འི་ ཕྱེ་མ་ དང་ ། ཙན་དན་ དམར་པོ་ -འི་ ཕྱེ་མ་ དང་ ། ཀེ་ས་ར་ -འི་ ཕྱེ་མ་ རྣམས་ ཀྱིས་ ཀྱང་ མངོན་པར་ གཏོར་ ཏོ་ ། །

source: They tossed celestial flowers, including different kinds of mandārava flowers, mahāmandārava flowers, coral-tree flowers, mañjūṣaka flowers, mahāmañjūṣaka flowers, roca flowers, mahāroca flowers, sthala flowers, mahāsthala flowers, cakra flowers, stainless cakra flowers, hundred-petaled lotus flowers, thousand-petaled lotus flowers, hundred-thousand-petaled lotus flowers, bright flowers, sweet-smelling flowers, exceedingly beautiful flowers, flowers resembling starlight, luminous flowers, multicolored flowers, and other similar flowers.
bo: ལྷ་ -འི་ མེ་ཏོག་ རྣམས་ ཀྱང་ མངོན་པར་ གཏོར་བ་ ལ་ འདི་ལྟ་སྟེ་ ། མེ་ཏོག་ མན་ དཱ་ ར་བ་ དང་ ། མན་ དཱ་ ར་བ་ ཆེན་པོ་ དང་ ། ཡོངས་འདུ་ དང་ ། མན་ ཛུ་ ཥ་ ཀ་ དང་ ། མན་ ཛུ་ ཥ་ ཀ་ ཆེན་པོ་ དང་ ། མདོག་ མཛེས་ དང་ ། མདོག་ མཛེས་ ཆེན་པོ་ དང་ ། སྠ་ ལ་ དང་ ། སྠ་ ལ་ཆེན་པོ་ དང་ ། མེ་ཏོག་ འཁོར་ལོ་ དང་ ། འཁོར་ལོ་ དྲི་མེད་ དང་ ། འདབ་བརྒྱ་ དང་ ། འདབ་སྟོང་ དང་ ། འདབ་ འབུམ་ དང་ ། ཀུན་ ནས་ འོད་ དང་ ། ཀུན་ དུ་ བསུང་ དང་ ། ཀུན་ དུ་ ཆེ་ -ར་ སྣང་ མིག་ ཏུ་ སྡུག་ དང་ ། སྐར་འོད་ དང་ ། འོད་བྱེད་ དང་ ། ཁ་དོག་ མཐའ་ ཡས་ དང་ ། མེ་ཏོག་ དེ་ལྟ་ བུ་ དག་ ཀྱང་ མངོན་པར་ གཏོར་ ཏོ་ ། །

source: They proceeded to scatter water-borne flowers, such as the blue lotus, lotus, water lily, and white lotus.
bo: ཆུ་ ནས་ སྐྱེས་པ་ -འི་ མེ་ཏོག་ ཨུད་པ་ ལ་ དང་ ། པད་མ་ དང་ ། ཀུ་མུ་ད་ དང་ ། པད་མ་ དཀར་པོ་ རྣམས་ ཀྱང་ གཏོར་ ཏོ་ ། །

source: They scattered soil-grown flowers, such as jasmine flowers, pariṣaka flowers, flowers from the harimantha tree, magnolia flowers, aśoka flowers, dhanuskari flowers, pāṭala flowers, and flowers from the mucilinda tree.
bo: ཐང་ལས་ སྐྱེས་པ་ སྣ་མ་ -འི་ མེ་ཏོག་ དང་ ། པ་ རི་ ཥ་ ཀ་ དང་ ། ཨ་ ཏི་ མུག་ ཏ་ ཀ་ དང་ ། ཙམ་པ་ཀ་ དང་ ། མྱ་ངན་ འཚང་ དང་ ། དྷ་ ནུ་ སྐ་ རི་ དང་ ། སྐྱ་ སྣ་ -ར་ དང་ ། མེ་ཏོག་ བཏང་བཟུང་ དག་ ཀྱང་ གཏོར་ ཏོ་ ། །

source: Finally, they played all kinds of musical instruments and drums, including small drums, flutes, bass drums, conches, kettle drums, gongs, and cymbals.
bo: སིལ་སྙན་ དང་ ཕེག་ རྡོབ་པ་ དག་ ཀྱང་ ཀུན་ དུ་ ཡང་དག་པ་ -ར་ སྦྱར་བ་ ལ་ འདི་ལྟ་སྟེ་ ། ཕེག་ རྡོབ་པ་ དང་ ། གླིང་བུ་ དང་ ། རྔ་བོ་ ཆེ་ དང་ ། དུང་ དང་ ། རྫ་རྔ་ དང་ ། འཁར་རྔ་ དང་ ། སིལ་སྙན་ དང་ །

source: They sang different kinds of melodious songs.
bo: གླུ་དབྱངས་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱང་ བྱས་ སོ་ ། །

source: They rained down showers of incense, powders, jewelry, ornaments, pearl necklaces, and fine garments, along with the sounds of cymbals large and small.
bo: སྤོས་ ཀྱི་ ཆ་ -ར་ དང་ ། ཕྱེ་མ་ -འི་ ཆ་ -ར་ དང་ ། རིན་པོ་ཆེ་ -འི་ ཆ་ -ར་ དང་ ། རྒྱན་ གྱི་ ཆ་ -ར་ དང་ ། མུ་ཏིག་ གི་ རྒྱན་ ཕྲེང་ གི་ ཆ་ -ར་ དང་ ། གོས་ ཀྱི་ ཆ་ -ར་ དང་ ། སིལ་སྙན་ དང་ ། རོལ་མོ་ -འི་ སྒྲ་ -འི་ ཆ་ -ར་ ཡང་ མངོན་པར་ ཕབ་བོ་ ། །

source: The bodhisattvas who had gathered from the various worlds of the ten directions rose into the sky above them and, as an act of worship to the Blessed One, sacrificed their own bodies.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་དག་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣ་ཚོགས་ ནས་ འདུས་པ་ དེ་དག་ སྟེང་ གི་ བར་སྣང་ ལ་ མངོན་པར་ འཕགས་ ཏེབཅོམ་ ལྡན་ འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ རང་རང་ གི་ ལུས་ བོར་ རོ་ ། །

source: As soon as they had done so, they bedecked the entire pavilion Jeweled Array from the sky.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ ལུས་ བོར་ མ་ ཐག་ ཏུ་ དེ་ནས་ སྟེང་ གི་ བར་སྣང་ ལ་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ ཁེབས་པ་ -ར་ བྱས་ ཏེ་ །

source: It became embellished with many pearl necklaces arrayed as latticework of dangling jewels, decorated with checkered designs, carefully arranged, adorned with a net of small and large bells, and embellished with lotus flowers made of jewels.
bo: རིན་པོ་ཆེ་ -འི་ དྲ་བ་ མུ་ཏིག་ གི་ རྒྱན་ ཕྲེང་ དུ་མ་ དཔྱངས་པ་ ། ཀུན་ ནས་ མིག་མངས་ རིས་ སུ་ བྲིས་པ་ ། ཤིན་ཏུ་ ཡོངས་སུ་ ལས་ སུ་ བྱས་པ་ ། དྲིལ་བུ་ གཡེར་ ཀ་ -འི་ དྲ་བ་ -ས་ མཛེས་པ་ -ར་ བྱས་པ་ ། རིན་པོ་ཆེ་ -འི་ པད་མ་ -ས་ སྤྲས་པ་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: From each individual pearl of those necklaces, unfathomably innumerable bodhisattva bodies emerged.
bo: མུ་ཏིག་ གི་ རྒྱན་ ཕྲེང་ དེ་དག་ གི་ མུ་ཏིག་ གི་ འབྲུ་ རེ་རེ་ ལས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལུས་ དཔག་ ཏུ་ མེད་ ཅིང་ གྲངས་མེད་པ་ དག་ བྱུང་བ་ -ར་ ཀུན་ དུ་ སྣང་ངོ་ ། ། དེ་དག་ བྱུང་ ནས་

source: They circumambulated the Blessed One seven times and sat down on lion thrones of lotus flowers with jeweled designs.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ བདུན་ བསྐོར་བ་ བྱས་ ཏེརིན་པོ་ ཆེ་ བཀོད་པ་ -འི་ པད་མ་ -འི་ སེང་གེ་ -འི་ ཁྲི་ དེ་དག་ ལ་ འཁོད་ དོ་ ། །

source: As an act of worship to this Dharma discourse, immeasurably many blessed buddhas from the immeasurably many buddhafields of the ten directions sent forth into the world realm Endurance arrays of offerings, accomplished by each tathāgata, known as free-flowing utterances lasting for eons.
bo: ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཚད་ མེད་པ་ ནས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ ཚད་ མེད་པ་ དག་ གིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རེ་རེ་ -ས་ ཀྱང་ བསྐལ་པ་ -ར་ བརྗོད་པ་ ཡོངས་སུ་ ཐུག་པ་ མེད་པ་ ཞེས་ བྱ་བ་ -འི་ མཆོད་པ་ བཀོད་པ་ བསྒྲུབས་ ཏེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ བཏང་བ་ དང་ །

source: Through the power of the Buddha these arrays arrived in this world realm Endurance and beautified the pavilion Jeweled Array with supreme embellishment.
bo: སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ བཀོད་པ་ དེ་དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེདེ་ དག་ གིས་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ ལ་ རྒྱན་ གྱི་ མཆོག་ གིས་ བརྒྱན་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: From among this retinue, immeasurably many beings generated the mind of unsurpassed, complete and perfect awakening, and immeasurably many bodhisattvas attained acceptance of the nonorigination of phenomena.
bo: འཁོར་ འདི་ ལས་ སེམས་ཅན་ ཚད་ མེད་པ་ དག་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་ སྐྱེད་ དོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ ཚད་ མེད་པ་ དག་ མི་ སྐྱེ་བ་ -འི་ ཆོས་ ལ་ བཟོད་པ་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: At that point, the Blessed One surveyed the entire bodhisattva assembly with his elephantine gaze and said the following:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ལ་ གླང་པོ་ཆེ་ -འི་ ལྟ་སྟངས་ ཀྱིས་ གཟིགས་ ནས་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “This inconceivable array of ornaments offered by you, noble beings, which is blessed by the bodhisattva’s meditative absorption and bestowed by the tathāgatas, is not constructed, is not disorderly, does not grow old, and does not deteriorate.
bo: སྐྱེས་བུ་ དམ་པ་ ཁྱོད་ རྣམས་ ལས་ རྒྱན་ བཀོད་པ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་ངེ་འཛིན་ གྱིས་ བྱིན་ གྱིས་ བརླབས་པ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བཏང་བ་ རྣམ་པ་ -ར་ བརྟགས་པ་ མ་ཡིན་པ་ ། མ་ འཁྲུགས་པ་ ། མ་ རྙིངས་པ་ ། མ་ ཉམས་པ་

source: Sixteen years after the Tathāgata Maitreya reaches perfect buddhahood, and while he resides in the pavilion Jeweled Array, when this Dharma discourse of the Great Assembly chapter from The Gateway to Unobstructed Deliverance through the Bodhisattva Way of Life is taught in detail, and a congregation of bodhisattvas endowed with teachings and all qualities assembles, who will delight in making these offerings to the Tathāgata Maitreya as well as to all the tathāgatas of this Good Eon?”
bo: འདི་ དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ནས་ ལོ་ བཅུ་དྲུག་ ལོན་ ཏེའཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ འདུག་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱོད་པ་ ལ་ འཇུག་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ ། སྒྲིབ་པ་ མེད་པ་ -འི་ སྒོ་ ། འདུས་པ་ ཆེན་པོ་ -འི་ ལེའུ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ རྒྱ་ ཆེ་ -ར་ ཡང་དག་པ་ -ར་ རབ་ཏུ་ སྟོན་པ་ ན་ བསྟན་པ་ དང་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ འདུན་པ་ -ར་ བྱ་བ་ དང་ ། མཆོད་པ་ འདི་ -ས་ དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ་ དང་ ། བསྐལ་པ་ བཟང་པོ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ ལ་ མཆོད་པ་ -ར་ སུ་ སྤྲོ་ །

source: Thereupon, a bodhisattva named Sovereign of the Magical Display of All Phenomena, seated amidst the assembled retinue, rose from his lotus seat, placed his right knee in the heart of the lotus, joined his palms together, and bowed toward the Blessed One.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུས་པ་ -ར་ གྱུར་ ནས་ འདུག་པ་ དེ་ པད་མ་ -འི་ སྟན་ ལས་ ལངས་ ཏེ་ པུས་མོ་ གཡས་པ་ -འི་ ལྷ་ང་ པད་མ་ -འི་ སྙིང་པོ་ ལ་ བཙུགས་ ནས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ དེ་ །
