Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་པ་ །

source: “Sugata, your knowledge is vast and boundless, so you know the wishes of beings.
bo: བདེ་གཤེགས་ ཁྱོད་ ཀྱི་ མཁྱེན་པ་ མཐའ་ ཡས་ ཡངས་པ་ -ས་ སེམས་ཅན་ བསམ་པ་ མཁྱེན་ ། །

source: Your omniscience, vast as space and without attachment to the threefold path teachings,
bo: མཁའ་ འདྲ་ -འི་ ལམ་ གྱི་ ཆོས་ གསུམ་ དག་ ལ་ ཆགས་ མེད་ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ། །

source: Fathoms the whole range of thoughts of sentient beings through a single mental event.
bo: སེམས་ ཀྱི་ འཇུག་པ་ གཅིག་ གིས་ འགྲོ་བ་ -འི་ སེམས་ ཀྱི་ སྤྱོད་པ་ ཐམས་ཅད་ མཁྱེན་ ། །

source: Therefore, you deserve praise from everyone in all three existences.”
bo: དེས་ན་ སྲིད་པ་ གསུམ་པོ་ དག་ ན་ ལུས་ཅན་ རྣམས་ ཀྱིས་ མཆོད་པ་ -ར་ འོས་ ། །

source: After the gods of Yāma had praised the Blessed One with this verse, they joined the procession to attend to him.
bo: དེ་ནས་ འཐབ་བྲལ་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་འབྲིང་ དུ་ འབྲང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: At this point, the gods of Tuṣita, such as Pramodita, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine jewels on him in worship.
bo: དེ་ནས་ ལྷ་ -འི་ རྒྱལ་པོ་ རབ་དགའ་ ལྡན་ ལ་སོགས་པ་ དགའ་ལྡན་ གྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ -ར་ རིག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ རིན་པོ་ཆེ་ -འི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ་

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་པ་ །

source: “Since phenomena are without sound or expression, without coming or going,
bo: གང་ གི་ སླད་ དུ་ སྒྲ་ དང་ ཡི་གེ་ མ་ མཆིས་ གང་ དུའང་ རྒྱུ་བ་ མ་ མཆིས་པ་ -ས་ ། །

source: You know them to be without motion and untrue, like a mirage or hallucination.
bo: ཁྱོད་ ཀྱིས་ ཆོས་ རྣམས་ མི་ གཡོ་ ཡ་མ་བརླ་ དང་ སྒྱུ་མ་ སྨིག་རྒྱུ་ འདྲ་ -ར་ མཁྱེན་ ནས

source: The Blessed One teaches the supreme Dharma out of compassion for the sake of beings.
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ ཐུགས་རྗེ་ -ས་ སེམས་ཅན་ རྣམས་ ལ་ ཆེད་ དུ་ ཆོས་མཆོག་ གསུངས་པ་ -ས་ ན་ ། །

source: We pay homage to the Victor who is skilled in the nature of phenomena and who teaches no self.”
bo: ཆོས་ ཀྱི་ དངོས་པོ་ -འི་ རང་བཞིན་ མཁས་པ་ བདག་མེད་ གསུང་བ་ -འི་ རྒྱལ་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: After the gods of Tuṣita had praised the Blessed One with this verse, they joined the procession to attend to him.
bo: དེ་ནས་ དགའ་ལྡན་ གྱི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་འབྲིང་ དུ་ འབྲང་ ངོ་ ། །

source: At this point, the gods of Nirmāṇarati, such as Sunirmāṇarati, the king of the gods, noticed that the Blessed One was ascending the staircase, and they showered clouds of divine ornaments on him in worship.
bo: དེ་ནས་ ལྷ་ -འི་ རྒྱལ་པོ་ རབ་འཕྲུལ་ དགའ་ ལ་སོགས་པ་ འཕྲུལ་དགའ་ -འི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ -ར་ རིག་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ རྒྱན་ གྱི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ་ །

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Through the boon of the Dharma, you possess ten space-like strengths and luminosity.
bo: ཆོས་ ཀྱི་ ཟོང་ གིས་ རང་ གི་ སྟོབས་ བཅུ་ མཁའ་ འདྲ་ འོད་ཟེར་ ལྡན་པ་ དང་ ། །

source: Because you possess compassion, you appear tangibly before sentient beings with loving regard.
bo: ཐུགས་རྗེ་ བརྙེས་ ནས་ བྱམས་པ་ -འི་ དགོངས་པ་ -ས་ སེམས་ཅན་ རྣམས་ ལ་ གཟུགས་ སྟོན་པ་ ། །

source: Although you have entered the nonduality of phenomena in the manner of a ship,
bo: གྲུ་ ཚུལ་ ཆོས་ ལ་ གཉིས་ སུ་ མེད་པ་ -ར་ ཞུགས་ ཀྱང་ རྒྱལ་བ་ མཚུངས་པ་ -ར་ མཁྱེན་ ། །

source: We pay homage to the Victor who has accomplished all aims with a special intention enhanced by Dharma.”
bo: ཆོས་ ཀྱི་ ཁྱད་པར་ སེམས་ ལྷག་ དོན་ ཀུན་གྲུབ་པ་ -འི་ རྒྱལ་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: After the gods of Nirmāṇarati had praised the Blessed One with this verse, they joined the procession to attend to him.
bo: དེ་ནས་ འཕྲུལ་དགའ་ -འི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་ -ས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་འབྲིང་ དུ་ འབྲང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: At this point, the gods of Para­nirmitavaśavartin, such as Vaśavartin, the king of the gods, noticed that the Blessed One had ascended the staircase and was now facing the pavilion, and they showered clouds of divine pearl garlands on him in worship.
bo: དེ་ནས་ ལྷ་ -འི་ རྒྱལ་པོ་ དབང་ སྒྱུར་ ལ་སོགས་པ་ གཞན་འཕྲུལ་ དབང་ བྱེད་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ཐེམ་སྐས་ སུ་ ཞུགས་པ་ དང་ ། འཁོར་ གྱི་ ཁྱམས་ སུ་ མངོན་པར་ ཕྱོགས་པ་ -ར་ རིག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ མུ་ཏིག་ གི་ དོ་ཤལ་ གྱི་ སྤྲིན་ གྱི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ

source: They joined their palms and praised him with the following words:
bo: ཐལ་མོ་ སྦྱར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “We pay homage at the feet of the master, whose moral conduct is stainless, pure, perfected, and excellent, and whose absorption is stable, The incomparably intelligent one who is like the ocean, who is liberated from existence.
bo: ཚུལ་ཁྲིམས་ དྲི་མ་ མི་ མངའ་ རྣམ་དག་ རྣམ་པ་ -ར་ ངེས་པ་ དམ་པ་ ཏིང་ངེ་འཛིན་ མཆོག་ མི་ གཡོས་པ་ ། ། མཉམ་མེད་ བློ་ལྡན་ རྒྱ་མཚོ་ འདྲ་བ་ -ར་ གནས་ ཤིང་ སྲིད་ ལས་ རྣམ་གྲོལ་ དབང་ སྒྱུར་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: We pay homage to you, the Lion Sugata who progressively delineates the various aspects of the true path out of compassion filled with loving kindness, And who dwells in the way stations of the three liberations.
bo: རིམ་གྱིས་ བྱམས་ དང་ ལྡན་པ་ -འི་ ཐུགས་རྗེ་ ཡིས་ ནི་ བདེན་པ་ -འི་ ལམ་ གྱི་ རྣམ་པ་ རབ་ཏུ་ གནས་ མཛད་པ་ ། ། རྣམ་ཐར་ གསུམ་ གྱི་ ལམ་ གྱི་ ཁྱམས་ ན་ གནས་པ་ -འི་ བདེ་གཤེགས་ སེང་གེ་ ཁྱོད་ ལ་ བདག་ཅག་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Who broadens the river of compassion through absorption,
bo: སྙིང་རྗེ་ -འི་ ཆུ་བོ་ ཏིང་ངེ་འཛིན་ གྱིས་ རྣམ་ འཕེལ་བ་ ། །

source: Who opens the petals of tranquil abiding on the flowers of liberation,
bo: ཞི་གནས་ འདབ་མ་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ མེ་ཏོག་ རྒྱས་ ། །

source: And who is attended by an assembly of disciples like swarming bees.
bo: སློབ་མ་ -འི་ ཚོགས་ ཀྱི་ བུང་བ་ -ས་ ངེས་པར་ བསྙེན་ གྱུར་པ་ ། །

source: “We pay homage respectfully to you, Lotus Sugata
bo: བདེ་གཤེགས་ པད་མ་ ལ་ ནི་ སྤྱི་བོ་ -ས་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Who is established on the ground of firm moral conduct,
bo: མངའ་བདག་ གཡོ་ བ་མ་ མཆིས་ ཚུལ་ཁྲིམས་ ས་ -ར་ གནས་པ་ -ས་ ། །

source: Who has risen up through the power of unrivaled energy,
bo: བརྩོན་འགྲུས་ མཚུངས་པ་ མ་ མཆིས་ སྟོབས་ ཀྱིས་ ཡང་དག་ འཕགས་ ། །

source: And who is not shaken by the great tempest of the winds of objects.
bo: ཡུལ་ གྱི་ རླུང་ རྣམས་ ལངས་པ་ ཆེན་པོ་ -ས་ མི་ གཡོས་པ་ ། །

source: “We pay homage to you, Sacred Mountain Buddha
bo: སངས་རྒྱས་ རི་བོ་ དམ་པ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Who is a pure maṇḍala of melodies,
bo: མངའ་བདག་ ཐུགས་རྗེ་ -ས་ དབྱངས་ ཀྱི་ དཀྱིལ་འཁོར་ རྣམ་དག་པ་ ། །

source: Whose mind treasury of supreme intelligence is overwhelming,
bo: བློ་ གཏེར་ བློ་ མཆོག་ གིས་ ནི་ རབ་ཏུ་ འཇོམས་ མཛད་པ་ ། །

source: And to whom hundreds of sentient beings attend with many offerings.
bo: སེམས་ཅན་ བརྒྱ་ དག་ གིས་ ནི་ མང་པོ་ -ས་ མཆོད་ གྱུར་པ་ ། །

source: “We pay homage to you, Moon Sugata
bo: བདེ་གཤེགས་ ཟླ་བ་ ཁྱོད་ ལ་ བདག་ཅག་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Who proceeds on the path of full emancipation of peace, which is like the sky,
bo: མཁའ་ ལྟར་ ཞི་བ་ -འི་ རྣམ་པ་ -ར་ ཐར་པ་ -འི་ ལམ་ གཤེགས་པ་ ། །

source: Who suffuses the expanse of the ten directions with the rays of insight,
bo: ཤེས་རབ་ འོད་ ཀྱིས་ ཕྱོགས་ བཅུ་ དག་ ནི་ རྒྱས་ འགེངས་ ཤིང་ ། །

source: And who opens the incomparable lotus flowers of many beings.
bo: སྐྱེ་བོ་ མང་པོ་ མཚུངས་མེད་ པད་མ་ ཁ་ འབྱེད་པ་ ། །

source: “We pay homage to you, Noble Sun Buddha
bo: སངས་རྒྱས་ ཉི་མ་ དམ་པ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: “Master, in the three worlds and ten directions
bo: མངའ་བདག་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གསུམ་པོ་ དག་ ན་ ཡང་ ། །

source: We find no guide equal to you.
bo: འདྲེན་པ་ ཁྱོད་ དང་ མཉམ་པ་ དམིགས་པ་ -ར་ མ་ གྱུར་ ཏེ་ ། །

source: You who have accomplished all the buddha qualities—
bo: ཁྱོད་ ནི་ ཡོན་ཏན་ ཀུན་ གྱིས་ ཡང་དག་ གྲུབ་པ་ ལགས་ ། །

source: We can never get enough of praising you.
bo: བདག་ཅག་ ཁྱོད་ ལ་ བསྟོད་པ་ -ས་ ངོམས་པ་ -ར་ འགྱུར་ མ་ ལགས་ ། །

source: The celestial rulers, nāgas, and asuras pay tribute to you,
bo: ལྷ་དབང་ ཀླུ་ དང་ ལྷ་མ་ ཡིན་ གྱིས་ ཕྱག་ བགྱིས་པ་ ། །

source: And many hundreds of supreme gods truly extoll you.
bo: ལྷ་ མཆོག་ བརྒྱ་ དག་ གིས་ ཀྱང་ ཡང་དག་ མངོན་བསྟོད་པ་ ། །

source: You are truly extolled by many hundreds of eulogies.”
bo: བསྔགས་པ་ བརྒྱ་ ཕྲག་ མང་པོ་ -ས་ ཡང་དག་ མངོན་བསྟོད་པ་ ། །

source: “We pay homage to you, Honorable Sugata.
bo: བདེ་བ་ -ར་ གཤེགས་པ་ བསྟོད་འོས་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: After the gods of Para­nirmitavaśavartin had praised the Blessed One with these verses, they joined the procession to attend to him.
bo: དེ་ནས་ གཞན་འཕྲུལ་ དབང་ བྱེད་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ མངོན་པར་ བསྟོད་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་འབྲིང་ དུ་ འབྲང་ ངོ་ ། །

source: After the many gods had thus praised the vast display of the buddha domain, the Buddha entered the pavilion called Jeweled Array.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ལྟར་ སངས་རྒྱས་ ཀྱི་ ཡུལ་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ ཚད་ མེད་པ་ ལྷ་ འབུམ་ གྱིས་ མངོན་པར་ བསྟོད་ ནས་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ གཤེགས་ ཏེ་ །

source: Just as they realized that the Blessed One had gone to the pavilion Jeweled Array via the staircase in this world system of Endurance, they realized that he had also done so in all the world systems of the trichiliocosm.
bo: ཇི་ལྟར་ བཅོམ་ལྡན་འདས་ གླིང་བཞི་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཐེམ་སྐས་ ནས་ འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ གཤེགས་པ་ ཤེས་པ་ དེ་བཞིན་ དུ་ ། སྟོང་གསུམ་ གྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ཀྱི་ གླིང་བཞི་པ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ ན་ ཡང་ གཤེགས་པ་ -ར་ ཤེས་ སོ་ ། །

source: At this point, the Blessed One sat down on the lion throne that had been prepared in the pavilion Jeweled Array, encompassed by the trichiliocosm.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ འཁོར་ གྱི་ ཁྱམས་ སྟོང་གསུམ་ གྱིས་ ཡོངས་སུ་ གཟུང་བ་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ གདན་ སེང་གེ་ -འི་ ཁྲི་ ཇི་ལྟར་ བཤམས་པ་ ལ་ བཞུགས་ སོ་ ། །

source: The bodhisattvas and the great śrāvakas also took their seats.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དང་ ཉན་ཐོས་ ཆེན་པོ་ དག་ ཀྱང་ སྟན་ ཅི་རིགས་པ་ ལ་ འཁོད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: At this time, the Blessed One attained a buddha absorption called buddha play in unveiled liberation.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ -འི་ ཚེ་ སངས་རྒྱས་ ཀྱི་ ཏིང་ངེ་འཛིན་ རྣམ་པ་ -ར་ ཐར་པ་ སྒྲིབ་པ་ མེད་པ་ ལ་ སངས་རྒྱས་ རྣམ་པ་ -ར་ རོལ་པ་ ཞེས་ བྱ་བ་ ལ་ སྙོམས་པར་ ཞུགས་ སོ་ ། །

source: No sooner had he attained that absorption than as many light rays as there are grains of sand in the river Ganges shone forth from each and every pore of his body.
bo: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཏིང་ངེ་འཛིན་ རྣམ་པ་ -ར་ ཐར་པ་ སྒྲིབ་པ་ མེད་པ་ ལ་ སངས་རྒྱས་ རྣམ་པ་ -ར་ རོལ་པ་ ཞེས་ བྱ་བ་ ལ་ སྙོམས་པར་ ཞུགས་ མ་ ཐག་ ཏུ་ ། དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྐུ་ -འི་ སྤུ་ -འི་ ཁུང་བུ་ ཐམས་ཅད་ ཀྱི་ སྤུ་ -འི་ ཁུང་བུ་ རེ་རེ་ ནས་ ཀྱང་ འོད་ཟེར་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ བྱུང་ སྟེབྱུང་ ནས་ ཀྱང་

source: They illuminated all the world systems in the eastern, southern, western, and northern directions. They illuminated the zenith and the nadir, and the intermediate directions as well.
bo: ཤར་ཕྱོགས་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ སྣང་བ་ -ར་ བྱས་ སོ་ ། ། དེ་བཞིན་ དུ་ ལྷོ་ དང་ ། ནུབ་ དང་ ། བྱང་ གི་ ཕྱོགས་ རྣམས་ དང་ ། འོག་ དང་ ། སྟེང་ དང་ ། ཕྱོགས་མཚམས་ རྣམས་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ སྣང་བ་ -ར་ བྱས་ སོ་ ། །

source: As soon as all the world systems had been illuminated in this way, the suffering experienced by sentient beings tormented in the hell realms ceased.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམས་ སྣང་བ་ -ར་ བྱས་ མ་ ཐག་ ཏུ་ ། དེ་ནས་ སེམས་ཅན་ དམྱལ་བ་པ་ -འི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ སེམས་ཅན་ དམྱལ་བ་ -འི་ སྡུག་བསྔལ་ གྱི་ ཚོར་བ་ རྒྱུན་ ཆད་ དོ་ ། །

source: The suffering experienced by beings in the world of Yama and the suffering experienced by beings in the animal realm also ceased.
bo: དུད་འགྲོ་ -འི་ སྐྱེ་གནས་པ་ -འི་ སེམས་ཅན་ རྣམས་ དང་ གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་པ་ -འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྡུག་བསྔལ་ གྱི་ ཚོར་བ་ ཡང་ རྒྱུན་ ཆད་ དོ་ ། །

source: In that instant, attachment, aversion, delusion, and all the other afflictive emotions ceased to afflict sentient beings, who all became kind and loving, and considered beings to be like their parents.
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱང་ སྐད་ཅིག་ དེ་ ལ་ འདོད་ཆགས་ ཀྱིས་ གནོད་པ་ -ར་ མ་ གྱུར་ ཅིང་ ། ཞེ་སྡང་ གིས་ མ་ ཡིན་ ། གཏི་མུག་ གིས་ མ་ ཡིན་ ཏེ་ ། ཉོན་མོངས་པ་ གཞན་ གྱིས་ ཀྱང་ གནོད་པ་ -ར་ མ་ གྱུར་ ཏོ་ ། ། དེ་ -འི་ ཚེ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱང་ བྱམས་པ་ -འི་ སེམས་ དང་ ། ཕ་མ་ ལྟ་བུ་ -འི་ འདུ་ཤེས་ སུ་ གྱུར་ ཏོ་ ། །

source: In order to invite the bodhisattvas through the Buddha’s might, the following verses emanated from the light rays streaming from the Tathāgata:
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཡང་དག་པ་ -ར་ བསྐུལ་བ་ -འི་ ཕྱིར་ སངས་རྒྱས་ ཀྱི་ མཐུ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འོད་ དེ་ལས་ ཚིགས་ སུ་ བཅད་པ་ འདི་ བྱུང་ ངོ་ ། །

source: “The Buddha sets out thanks to a vast, expansive, and enduring energy.
bo: གང་ གིས་ བརྩོན་འགྲུས་ སྟོབས་ ནི་ མཐའ་ ཡས་ ཡངས་པ་ བརྟན་པ་ བརྩམས་ གྱུར་ ཏེ་ ། །

source: Through this great energy, he has refrained from turning back throughout the ages.
bo: གང་ གིས་ བརྩོན་འགྲུས་ ཆེན་པོ་ -འི་ སྟོབས་ ཀྱིས་ བསྐལ་པ་ དག་ ལས་ ཕྱིར་ ཕྱོགས་ སྤངས་ ། །

source: His qualities are conveyed forcefully in the ten directions.
bo: གང་ གིས་ ཡོན་ཏན་ དག་ ནི་ ཕྱོགས་ བཅུ་ རྣམས་ ན་ མཐུ་ལྡན་ རབ་ བརྗོད་པ་ ། །

source: The radiance of Śākyamuni is beautiful in illuminating all destinies.
bo: ཤཱཀྱ་ ཐུབ་པ་ -འི་ འོད་ཡངས་ འགྲོ་བ་ ཐམས་ཅད་ སྣང་བ་ -ར་ བྱེད་པ་ མཛེས་ ། །

source: “Some pay homage at his feet in order to listen to the vast, unsurpassed teachings.
bo: གང་ ཆོས་ རྒྱ་ ཆེན་ བླ་མེད་ མཉན་ སླད་ དེ་ ཡི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ། །

source: Those firm in learning and intelligence listen continuously for countless eons.
bo: མཁས་པ་ བློ་གྲོས་ བརྟན་པ་ དག་ ནི་ བསྐལ་པ་ གྲངས་མེད་ རྟག་ ཏུ་ ཉན་ ། །

source: Those with open minds generate contentment through their aspiration for perfect awakening.
bo: བློ་རྒྱ་ -ས་ གང་ཞིག་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསམ་པ་ ཚིམ་ སྐྱེད་པ་ ། །

source: The Capable One radiates light with his wish for sentient beings to be happy.
bo: ཐུབ་པ་ དེ་ -ས་ ནི་ གང་ ཕྱིར་ སེམས་ཅན་ བདེ་བ་ -ར་ བཞེད་པ་ -ས་ འོད་ འདི་ ཕྱུང་ ། །

source: “Since the master has energetically conquered hosts of powerful demons and non-Buddhists,
bo: མངའ་བདག་ གང་ཞིག་ བརྩོན་འགྲུས་ ཀྱིས་ ནི་ བདུད་ སྟོབས་ མུ་སྟེགས་ ཚོགས་ བཅས་ ཕམ་ མཛད་ ནས་ ། །

source: He is eminent like a lotus in bloom, beautiful like the Merus in the ten directions.
bo: པདྨ་ བྱུང་བ་ བཞིན་ དུ་ འཕགས་ ཤིང་ ཕྱོགས་ བཅུ་ དག་ ཏུ་ ལྷུན་པོ་ ཇི་བཞིན་ མཛེས་ ། །

source: Like the sun, he illuminates all destinies with the radiance of his physical form.
bo: གང་ཞིག་ ཉི་མ་ བཞིན་ དུ་ སྐུ་ ཡི་ འོད་ ཀྱིས་ འགྲོ་བ་ མ་ ལུས་ སྣང་ མཛད་པ་ ། །

source: We pray that the Victor comes so that the great meaning in his Dharma wheel may be heard.
bo: དེ་ ཡི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ གཞག་པ་ དོན་ ཆེན་ གསན་ དུ་ རྒྱལ་བ་ གཤེགས་ སུ་ གསོལ་ ། །

source: “Out of heartfelt love for beings, he will today, with his ten strengths, turn the sacred wheel, Which he has not yet turned, which is unrivaled, and which is turned by all the victors.
bo: རབ་ཏུ་ བསྐོར་བ་ -ར་ མ་ གྱུར་ མཚུངས་པ་ མེད་ ཅིང་ རྒྱལ་བ་ ཀུན་ གྱིས་ བསྐོར་ གྱུར་པ་ ། ། འཁོར་ལོ་ དམ་པ་ སྟོབས་ བཅུ་ སེམས་ཅན་ ཐུགས་ བརྩེ་ ཕྱིར་ ནི་ དེ་རིང་ སྐོར་བ་ -ར་ མཛད་ ། །

source: Upheld by living beings, today this vast good fortune, so rare for beings to encounter, will arise.
bo: སྲོག་ཆགས་ རྣམས་ ཀྱིས་ བསྟེན་པ་ -ར་ རྙེད་ དཀའ་ ལེགས་པ་ རྒྱ་ ཆེན་ དེ་རིང་ འབྱུང་བ་ -ར་ འགྱུར་ ། །

source: Today may those with pure and vast faith behold what they seek.”
bo: གང་དག་ དད་པ་ དང་བ་ ཆེ་ ཡངས་ དོན་ དུ་ གཉེར་བ་ དེ་དག་ དེ་རིང་ ལྟོས་ ། །

source: The light rays transmitted these words to all buddhafields.
bo: དེ་ནས་ འོད་ཟེར་ དེ་དག་ གིས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ཅད་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ གོ་བ་ -ར་ བྱས་ །

source: They invited all bodhisattvas, made all world systems tremble, made all sentient beings happy, and purified all elements of the afflictive emotions.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ བསྐུལ་ ། འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ རབ་ཏུ་གཡོ་ བར་ བྱས་ ། སེམས་ཅན་ ཐམས་ཅད་ བདེ་བ་ -ར་ བྱས་ ། ཉོན་མོངས་པ་ -འི་ ཁམས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ སྦྱངས་ །

source: The light rays illuminated Tamondha­kāra and obscured the dwelling places of Māra.
bo: མུན་པ་ མུན་ནག་ ཐམས་ཅད་ བསལ་ ། བདུད་ ཀྱི་ ཁྱིམ་ ཐམས་ཅད་ མོག་མོག་པོ་ -ར་ བྱས་ ནས་

source: They then returned to the immense circle of bodhisattvas and the world system of Endurance, where they disappeared into the top of the Blessed One’s head.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ འཁོར་ དཔག་ ཏུ་ མེད་པ་ དག་ དང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དུ་ སླར་ འོངས་ ཏེ་ ། བཅོམ་ལྡན་འདས་ ཀྱི་ དབུ་ -འི་ གཙུག་ ཏུ་ མི་སྣང་བ་ -ར་ གྱུར་ ཏོ་ ། །

source: The light rays first invited the bodhisattva Puṣpaśrī­garbha­sarva­dharma­vaśavartin to come. He resided in a buddhafield situated in the east, called Endowed with the Vast Display of the Precious Merits of Endless Qualities, of the Tathāgata Immaculate Pure Precious Light, Sovereign of the Uninterrupted Luminous Display of Dharma Endowed with the Factors of Awakening.
bo: དེ་ནས་ ཤར་ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མེད་ རྣམ་དག་ རིན་ཆེན་ འོད་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ དང་ ལྡན་པ་ -འི་ ཆོས་ རྒྱུན་ མི་འཆད་པ་ -འི་ འོད་ཟེར་ བཀོད་པ་ -འི་ རྒྱལ་པོ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ མཐའ་ཡས་པ་ -འི་ རིན་པོ་ཆེ་ -འི་ བསོད་ནམས་ བཀོད་པ་ -ས་ རྒྱ་ཆེ་བ་ དང་ ལྡན་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ མེ་ཏོག་ དཔལ་ གྱི་ སྙིང་པོ་ ཆོས་ ཐམས་ཅད་ ལ་ དབང་ སྒྱུར་བ་ ཞེས་ བྱ་བ་

source: As soon as the light rays reached this bodhisattva, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor. They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེལྷན་ ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship showered a multitude of divine gems and beryl upon him.
bo: ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ ཀྱི་ ཕྱིར་ ལྷ་ -འི་ ནོར་བུ་ བཻ་ དཱུརྱའི་ དྲ་བ་ -འི་ ཆ་ -ར་ རབ་ཏུ་ ཕབ་ སྟེ་ །

source: Then they praised him with these words:
bo: བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Blessed One, incomparable and endowed with perfected qualities—
bo: བཅོམ་ལྡན་ རབ་ཏུ་ མཚུངས་མེད་ ཡོན་ཏན་ ཕ་རོལ་ ཕྱིན་ ། །

source: Garlands of praise in honor of your qualities reverberate in all ten directions!
bo: ཁྱོད་ ཀྱི་ ཡོན་ཏན་ བསྔགས་ ཕྲེང་ ཕྱོགས་ བཅུ་ ཀུན་ ན་ བརྗོད་ ། །

source: Your qualities are many—a treasury of good qualities.
bo: ཁྱོད་ ཀྱི་ ཡོན་ཏན་ ཚོགས་ མཆིས་ ཞིང་ གང་ ཡོན་ཏན་ གཏེར་ ། །

source: We come here in pursuit of the Dharma.
bo: དེ་ -ར་ ནི་ ཆོས་ དོན་གཉེར་བ་ བདག་ཅག་ རབ་ཏུ་ མཆི་ ། །

source: “Just as there is no conceptuality in the sameness of the realm of phenomena,
bo: ཆོས་དབྱིངས་ མཉམ་ཉིད་ རྣམ་རྟོག་ མ་ མཆིས་ ཇི་བཞིན་ དུ་ ། །

source: So the Blessed One knows sameness through his stainless light.
bo: བཅོམ་ལྡན་ དྲི་མེད་ འོད་ ཀྱིས་ མཉམ་པ་ཉིད་ མཁྱེན་ ཀྱང་ ། །

source: Like a well-trained magician, the Dharma king
bo: ཤིན་ཏུ་ བསླབ་པ་ -འི་ སྒྱུ་མ་ མཁན་ ལྟར་ ཆོས་ ཀྱི་ རྒྱལ་ ། །

source: Presents various Dharmas in order to liberate sentient beings.”
bo: སེམས་ཅན་ རྣམ་པ་ -ར་ དགྲོལ་ སླད་ ཐ་དད་ བསྟན་པ་ མཛད་ ། །

source: Once those bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the eastern corner of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ། ཤར་ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Ratnayaṣṭi to come. He resided in a buddhafield situated in the south, called Buddha Courage, of the Tathāgata Countless Qualities Precious Courage.
bo: དེ་ནས་ ལྷོ་ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡས་ རིན་ཆེན་ སྤོབས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ སངས་རྒྱས་ ཀྱི་ སྤོབས་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ སྲོག་ཤིང་ ཞེས་ བྱ་བ་

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ་ །

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of gold.
bo: ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ གསེར་ གྱི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Blessed One, you fill the whole world with clouds of compassion,
bo: བཅོམ་ལྡན་ ཐུགས་རྗེ་ -འི་ སྤྲིན་ གྱིས་ འཇིག་རྟེན་ རྒྱས་ བཀང་ ནས་ ། །

source: You wield the lightning bolts and roar the sounds of ‘empty’ and ‘no self,’
bo: འོད་ ཀྱི་ གློག་ ཕྱུང་ སྟོང་པ་ བདག་མེད་ སྒྲ་ བསྒྲགས་ ཏེ་ ། །

source: You pacify it with the waters of the eightfold path,
bo: ཡན་ལག་ བརྒྱད་པ་ -འི་ ལམ་ གྱི་ ཆུ་ ཡིས་ ཞི་ མཛད་ ཅིང་ ། །

source: And you bring to maturity a forest grove of virtuous strengths.
bo: དཀར་པོ་ -འི་ སྟོབས་ དབང་ ནགས་ཚལ་ གེལ་པ་ འཕེལ་བ་ -ར་ མཛད་ ། །

source: “You dispel the darkness of ignorance with the light of the sugata wisdom,
bo: བདེ་གཤེགས་ ཤེས་རབ་ འོད་ ཀྱིས་ གཏི་མུག་ མུན་བསལ་ ནས་ ། །

source: You awaken sentient beings from their long slumber in the ocean of existence,
bo: རིང་ ནས་ སྲིད་ མཚོ་ -ར་ གཉིད་ལོག་ སེམས་ཅན་ སད་ མཛད་ དེ་ ། །

source: You show the path and cause craving to dry up,
bo: ལམ་ ཡང་ བསྟན་ ཅིང་ སྲེད་པ་ དག་ ཀྱང་ སྐམས་པ་ -ར་ མཛད་ ། །

source: And you purify the vision of those dwelling in the city of liberation.”
bo: ཐར་པ་ -འི་ གྲོང་ གནས་ རྣམས་ ཀྱི་ མིག་ ཀྱང་ རྣམ་པ་ -ར་ སྦྱོང་ །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southern corner of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ལྷོ་ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །
