Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Son of noble family, even if all the sentient beings of world systems as numerous as grains of sand in the river Ganges were situated in the śrāvaka or pratyekabuddha vehicles, whatever the activity of all these beings, it would not come close to even a hundredth of the activity of bodhisattvas who have generated the first thought of awakening.
bo: རིགས་ ཀྱི་ བུ་ གལ་ཏེ་ གང་དག་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ དེ་དག་ ཐམས་ཅད་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -འམ་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ རབ་ཏུ་ གནས་པ་ -ར་ གྱུར་ ཀྱང་ སེམས་ཅན་ དེ་དག་ ཐམས་ཅད་ ཀྱི་ ལས་ གང་ཡིན་པ་ དེ་ སེམས་ དང་པོ་ བསྐྱེད་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ཀྱི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ །

source: It would not come close to even a thousandth, a hundred thousandth, a ten millionth, a billionth, or any number, fraction, enumeration, analogy, or comparison of it.
bo: སྟོང་ གི་ ཆ་ དང་ ། བརྒྱ་ སྟོང་ གི་ ཆ་ དང་ ། བྱེ་བ་ -འི་ ཆ་ དང་ ། བྱེ་བ་ བརྒྱ་ ཕྲག་ སྟོང་ གི་ ཆ་ དང་ ། གྲངས་ དང་ ། ཆ་ དང་ ། བགྲང་བ་ དང་ ། དཔེ་ དང་ ། རྒྱུ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Śrāvakas and pratyekabuddhas are committed to abandoning the afflictive emotions of their own mindstreams, but bodhisattvas are committed to abandoning the afflictive emotions of all sentient beings.
bo: ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ དག་ ནི་ རང་ གི་ རྒྱུད་ ཀྱི་ ཉོན་མོངས་པ་ སྤོང་བ་ -ར་ ཉེ་བར་ གནས་པ་ ཡིན་ གྱི་ ། བྱང་ཆུབ་ སེམས་དཔའ་ དག་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉོན་མོངས་པ་ སྤོང་བ་ -ར་ ཉེ་བར་ གནས་པ་ ཡིན་ ནོ་ ། །

source: In this way, son of noble family, compared to the activity of all beings and the activity of śrāvakas and pratyekabuddhas, the activity of bodhisattvas is said to be supreme.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ ན་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ལས་ གང་ཡིན་པ་ དང་ ། ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ ལས་ གང་ཡིན་པ་ བས་ འདི་ -ར་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ཉིད་ མཆོག་ ཅེས་ བརྗོད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The activity of immature ordinary beings is mistaken, and the activity of all śrāvakas and pratyekabuddhas is limited, but the activity of bodhisattvas yields qualities that are unmistaken and immeasurable.
bo: བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ རྣམས་ ཀྱི་ ལས་ ནི་ ཕྱིན་ ཅི་ ལོག་ དང་ ལྡན་པ་ ། ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ ལས་ ནི་ ཉི་ཚེ་བ་ དང་ ལྡན་པ་ ཡིན་ གྱི་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ནི་ ཕྱིན་ ཅི་ ལོག་ མེད་ ཅིང་ ཚད་ མེད་པ་ -འི་ རྣམ་པ་ -འི་ ཡོན་ཏན་ རྩོམ་པ་ སྟེ་ །

source: It is because of this that bodhisattvas surpass all beings and all śrāvakas and pratyekabuddhas.”
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་ འདི་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ དང་ ། ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཟིལ་ གྱིས་ ནོན་ ཏོ་ ། །

source: At this the bodhisattva Dhāraṇīśvara­rāja was content, pleased, delighted, and overjoyed.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཚིམ་ ཞིང་ མགུ་ ལ་ ཡི་ རངས་ ཤིང་ རབ་ཏུ་ དགའ་ སྟེ་ །

source: Feeling joyful and happy, he took delight in what was proclaimed by the Blessed One.
bo: དགའ་བ་ དང་ ཡིད་ བདེ་བ་ སྐྱེས་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ གསུངས་པ་ ལ་ མངོན་པར་ དགའ་ སྟེ་ རྗེས་སུ་ ཡི་ རངས་ ནས་ །

source: He rejoiced, saying to the Blessed One,
bo: ཡང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Blessed One, these excellent descriptions the Tathāgata has given of the bodhisattva ornaments, the bodhisattva illuminations, the great compassion of bodhisattvas, and the conduct of bodhisattvas are marvelous!
bo: བཅོམ་ལྡན་འདས་ ཇི་ཙམ་ དུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ རྒྱན་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྣང་བ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ལེགས་པ་ -ར་ གསུངས་པ་ དེ་དག་ ནི་ ངོ་མཚར་ ཏོ་ ། །

source: “May the Blessed tathāgata, arhat, completely perfect Buddha teach.
bo: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱིས་ ཡང་ བཤད་ དུ་ གསོལ་ །

source: Blessed One, how does the great compassion of the blessed buddhas enter sentient beings?
bo: བཅོམ་ལྡན་འདས་ ཇི་ལྟར་ སེམས་ཅན་ དག་ ལ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ །

source: What exactly are the aspects, characteristics, signs, foundation, and extent of great tathāgata compassion?
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ ཅི་ཙམ་ ། རྣམ་པ་ ནི་ གང་ ལགས་ ། རྟགས་ ནི་ གང་ ལགས་ ། མཚན་མ་ ནི་ གང་ ལགས་ ། གནས་ ནི་ གང་ ལགས་ །

source: How do blessed buddhas perform their activity?
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ འཕྲིན་ལས་ ནི་ ཇི་ལྟར་ མཛད་ །

source: What exactly are the aspects, characteristics, signs, foundation, and extent of their activity?
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ནི་ ཅི་ཙམ་ ། རྣམ་པ་ ནི་ གང་ ལགས་ ། རྟགས་ ནི་ གང་ ལགས་ ། མཚན་མ་ ནི་ གང་ ལགས་ ། གནས་ ནི་ གང་ ལགས་པ་ དེ་

source: Blessed One! Please explain directly to us how the activity of the omniscient, all-seeing tathāgatas manifests.”
bo: བཅོམ་ལྡན་འདས་ ཐམས་ཅད་ མཁྱེན་པ་ ། ཐམས་ཅད་ གཟིགས་པ་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ རྣམས་ མངོན་སུམ་ དུ་ གྱུར་པ་ -ས་ མངོན་སུམ་ དུ་ བདག་ཅག་ ལ་ ལེགས་པ་ -ར་ ཡང་དག་པ་ -ར་ བཤད་ དུ་ གསོལ་ །

source: Then the Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Son of noble family, listen well and remember, and I will explain to you briefly the engagement of great tathāgata compassion and tathāgata activity.
bo: རིགས་ ཀྱི་ བུ་ ཁྱོད་ དེ་ -འི་ ཕྱིར་ ཤིན་ཏུ་ ལེགས་པ་ -ར་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ལ་ འཇུག་པ་ ཙམ་ ཅུང་ཟད་ ཅིག་ ཁྱོད་ ལ་ བཤད་པ་ -ར་ བྱ་ -འོ་ ། །

source: “Son of noble family, I shall elucidate the statement that the great compassion of blessed buddhas for sentient beings ‘neither arises nor engages.’
bo: རིགས་ ཀྱི་ བུ་ སེམས་ཅན་ རྣམས་ ལ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ སྐྱེ་བ་ ཡང་ མེད་ ། འཇུག་པ་ ཡང་ མེད་ དོ་ ཞེས་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The great compassion of blessed buddhas is constantly engaged.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ རྟག་ ཏུ་ འཇུག་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Since it is properly generated through training over innumerable eons, it is neither engaged nor disengaged.
bo: དེ་ ནི་ བསྐལ་པ་ གྲངས་མེད་པ་ -ར་ ཡོངས་སུ་ སྦྱང་བ་ བྱས་པ་ -ས་ ཡང་དག་པ་ -ར་ བསྐྱེད་པ་ སྟེ་ ། འཇུག་པ་ ཡང་ མེད་ ། ལྡོག་པ་ ཡང་ མེད་ དོ་ ། །

source: The great compassion of blessed buddhas is present for all sentient beings without being activated.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ ཐུགས་རྗེ་ ཆེན་པོ་ ནི་ མ་ བཏང་བ་ ། སེམས་ཅན་ ཐམས་ཅད་ ལ་ གནས་པ་ -འོ་ ། །

source: As difficult as it was to obtain great tathāgata compassion, that is how immeasurable, inconceivable, inexhaustible, and far reaching it is.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ དེ་ ནི་ ཅི་ཙམ་ དུ་ ལས་ ཡོངས་སུ་ ཐོབ་པ་ -ར་ བྱ་བ་ -ར་ སླ་བ་ མ་ཡིན་པ་ དེ་ཙམ་ དུ་ ཚད་ མེད་ ། དེ་ཙམ་ དུ་ བསམ་ གྱིས་ མི་ ཁྱབ་ སྟེ་ ། དེ་ཙམ་ དུ་ མི་ཟད་ ཅིང་ ། དེ་ཙམ་ དུ་ རིང་ དུ་ སོང་བ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Son of noble family, as tathāgatas obtain awakening, their great compassion extends to sentient beings.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཇི་ལྟར་ བྱང་ཆུབ་ ཐོབ་པ་ དེ་ལྟར་ སེམས་ཅན་ རྣམས་ ལ་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: Awakening is great compassion!
bo: བྱང་ཆུབ་ ཅི་འདྲ་བ་ ཐུགས་རྗེ་ ཆེན་པོ་ ཡང་ དེ་ འདྲ་ -འོ་ ། །

source: “How do tathāgatas attain such awakening? Tathāgatas attain awakening where there is no root and no foundation.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ ཇི་ལྟར་ ཐོབ་ ཅེ་ན་ ། དེ་བཞིན་ གཤེགས་པ་ -ས་ རྩ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ -ར་ བྱང་ཆུབ་ ཐོབ་བོ་ ། །

source: In this regard, what is the root? What is the foundation?
bo: དེ་ ལ་རྩ་བ་ ནི་ གང་ ། གནས་ ནི་ གང་ཞེ་ན་ །

source: Personalism is the root and unreal imagining is the foundation.
bo: འཇིག་ཚོགས་ ནི་ རྩ་བ་ -འོ་ ། ། ཡང་དག་པ་ མ་ཡིན་པ་ ཀུན་རྟོག་པ་ ནི་ གནས་ སོ་ ། །

source: Tathāgatas understand these two to be the same because they are the same as awakening.
bo: དེ་ གཉིས་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ དང་ མཉམ་པ་ཉིད་ ཀྱིས་ མཉམ་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ཏེ་ །

source: Consequently, it is said that tathāgatas are perfect and complete buddhas whose awakening is without root and without foundation. Great tathāgata compassion extends to beings as they think, ‘These sentient beings do not comprehend these phenomena that are without root and without foundation. They should comprehend them.’
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རྩ་བ་ མེད་པ་ དང་ གནས་ མེད་པ་ -ར་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཞེས་ བྱ་ -འོ་ ། ། སེམས་ཅན་ འདི་དག་ གིས་ ནི་ རྩ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ -འི་ ཆོས་ འདི་དག་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is peaceful and tranquil.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ ཞི་བ་ དང་ ཉེ་བར་ ཞི་བ་ -འོ་ ། །

source: In this regard, what is peacefulness? What is tranquility?
bo: དེ་ ལ་ ཞི་བ་ ནི་ གང་ ། ཉེ་བར་ ཞི་བ་ ནི་ གང་ཞེ་ན་ །

source: The inner world is peaceful.
bo: ནང་ ནི་ ཞི་བ་ -འོ་ ། །

source: The outer world is tranquil.
bo: ཕྱི་ ནི་ ཉེ་བར་ ཞི་བ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The eye is empty of self and what belongs to a self.
bo: མིག་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ །

source: That is its nature.
bo: དེ་ ནི་ དེ་ -འི་ རང་བཞིན་ ནོ་ ། །

source: The ear, the nose, the tongue, the body, and the mind are empty of self and what belongs to a self.
bo: རྣ་བ་ དང་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ དང་ ཡིད་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ །

source: That is their nature.
bo: དེ་ ནི་ དེ་ -འི་ རང་བཞིན་ ནོ་ ། །

source: Because one understands the eye to be empty, one does not pursue form.
bo: མིག་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ གཟུགས་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because one understands the ear to be empty, one does not pursue sound.
bo: རྣ་བ་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ སྒྲ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because one understands the nose to be empty, one does not pursue smell.
bo: སྣ་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ དྲི་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because one understands the tongue to be empty, one does not pursue taste.
bo: ལྕེ་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ རོ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because one understands the body to be empty, one does not pursue the tangible.
bo: ལུས་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ རེག་བྱ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because one understands the mind to be empty, one does not pursue mental factors.
bo: ཡིད་ སྟོང་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ ཆོས་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Therefore it is said to be tranquil.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘These sentient beings do not comprehend peace and tranquility. They should comprehend them.’
bo: སེམས་ཅན་ འདི་དག་ གིས་ ནི་ ཞི་བ་ དང་ ། ཉེ་བར་ ཞི་བ་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གི་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, because mind is naturally luminous, awakening is naturally luminous.
bo: རིགས་ ཀྱི་ བུ་ སེམས་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ རང་བཞིན་ འོད་གསལ་བ་ -འོ་ ། །

source: Why is it said to be naturally luminous?
bo: ཅིའི་ཕྱིར་ རང་བཞིན་ འོད་གསལ་བ་ ཞེས་ བྱ་ ཞེ་ན་ །

source: Its nature is devoid of pollution.
bo: རང་བཞིན་ གང་ཡིན་པ་ དེ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ །

source: It is equal to space.
bo: ནམ་མཁའ་ དང་ མཚུངས་པ་ །

source: It is of the nature of space.
bo: ནམ་མཁའ་ -འི་ རང་བཞིན་ །

source: It is established as being the same as space.
bo: ནམ་མཁའ་ དང་ མཉམ་པ་ -ར་ གཞོལ་བ་ །

source: Because it is the same as space, it is sameness.
bo: ནམ་མཁའ་ དང་ མཉམ་པ་ -ས་ མཉམ་པ་ སྟེ་ །

source: Its nature is luminosity itself.
bo: རང་བཞིན་ དེ་ ནི་ ཤིན་ཏུ་ འོད་གསལ་བ་ ཉིད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Since these immature ordinary beings do not comprehend this natural luminosity, they remain polluted by adventitious afflictive emotions.
bo: བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ རྣམས་ ཀྱིས་ ནི་ རང་བཞིན་ འོད་གསལ་བ་ འདི་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ གློ་བུར་ གྱི་ ཉོན་མོངས་པ་ རྣམས་ ཀྱིས་ ཀུན་ ནས་ ཉོན་མོངས་ ཏེ་ །

source: They should comprehend this luminous nature.’
bo: རང་བཞིན་ འོད་གསལ་བ་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is without acceptance or rejection.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ བླང་བ་ མེད་པ་ དང་ ། དོར་བ་ མེད་པ་ -འོ་ ། །

source: In this regard, what is the absence of acceptance?
bo: དེ་ ལ་ བླང་བ་ མེད་པ་ ནི་ གང་ ། དོར་བ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: What is the absence of rejection?
bo: བླང་བ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ མི་ འཛིན་པ་ -འོ་ ། །

source: Absence of acceptance means not clinging to any phenomenon.
bo: དོར་བ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ མི་ འདོར་བ་ -འོ་ ། །

source: Absence of rejection means not rejecting any phenomenon.
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ བླང་བ་ མེད་པ་ དང་ ། དོར་བ་ མེད་པ་ -ར་ ཆུ་བོ་ -ར་ འཇུག་པ་ ན་ །

source: When tathāgatas enter the river of no acceptance and no rejection, they truly see that suchness is without an ‘other side’ yet not without an ‘other side,’ and thus they transcend these.
bo: ཇི་ལྟར་ དེ་བཞིན་ཉིད་ ལ་ ཕ་རོལ་ མེད་པ་ དང་ ། ཕ་རོལ་ མེད་པ་ མ་ཡིན་པ་ -ར་ ཡང་དག་པ་ -ར་ རྗེས་སུ་ མཐོང་བ་ དེ་ལྟར་ རྒལ་ ཏོ་ ། །

source: In that way, tathāgatas attain complete and perfect awakening for which all phenomena are beyond an ‘other side’ and the absence of an ‘other side.’
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཐམས་ཅད་ ཕ་རོལ་ མེད་པ་ དང་ ། ཕ་རོལ་ དང་ བྲལ་བ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: Therefore they are called tathāgatas.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘These immature ordinary beings do not comprehend the absence of acceptance and the absence of rejection. They should comprehend them.’
bo: བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ དག་ གིས་ ནི་ བླང་བ་ མེད་པ་ དང་ ། དོར་བ་ མེད་པ་ འདི་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is without signs and without objective reference.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ མཚན་མ་ མེད་པ་ དང་ ། དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: In this regard, what is meant by ‘without signs’?
bo: དེ་ ལ་ མཚན་མ་ མེད་པ་ ནི་ གང་ །

source: What is meant by ‘without objective reference’?
bo: དམིགས་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: A visual consciousness without an objective referent is without signs.
bo: མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Form that is unseen is without objective reference.
bo: གཟུགས་ ཡང་དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་བ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: An auditory consciousness without an objective reference is without signs.
bo: རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Sound that is unheard is without objective reference.
bo: སྒྲ་ མཉན་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: An olfactory consciousness without an objective reference is without signs.
bo: སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Odor that is not perceived is without objective reference.
bo: དྲི་ བསྣམ་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: A consciousness of taste without an objective reference is without signs.
bo: ལྕེ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Flavor that is not perceived is without objective reference.
bo: རོ་མྱང་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: A tactile consciousness without an objective reference is without signs.
bo: ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Touch that is not perceived is without objective reference.
bo: རེག་བྱ་ རེག་པ་ -ར་ བྱར་མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: A mental consciousness without an objective reference is without signs.
bo: ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ ནི་ མཚན་མ་ མེད་པ་ -འོ་ ། །

source: Mental factors that are not perceived are without objective reference.
bo: ཆོས་ ཡང་དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་བ་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: Thus, the lack of attributes and objective references is the domain of the noble ones.
bo: དེ་ལྟར་ ན་ མཚན་མ་ མེད་པ་ དང་ ། དམིགས་པ་ མེད་པ་ ནི་ འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ལོ་ ། །

source: What is the domain of the noble ones?
bo: འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ གང་ཞེ་ན་ །

source: That which is not the domain of the three realms is the domain of the noble ones.
bo: གང་ ཁམས་ གསུམ་པ་ -འི་ སྤྱོད་ཡུལ་ མ་ཡིན་པ་ དེ་ ནི་ འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ལོ་ ། །

source: Thus, that which is not a domain is the domain of the noble ones.
bo: དེ་ལྟར་ ན་ གང་ སྤྱོད་ཡུལ་ མ་ཡིན་པ་ དེ་ ནི་ འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ཏེ་ །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend the domain of the noble ones. They should comprehend it.’
bo: འཕགས་པ་ -འི་ སྤྱོད་ཡུལ་ འདི་ བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is not the past, is not the future, and is not the present.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ ཏེ་ །

source: It is the same throughout the three times, the termination of the triple sphere.
bo: དུས་གསུམ་ མཉམ་པ་ འཁོར་གསུམ་ ཡོངས་སུ་ ཆད་པ་ -འོ་ ། །

source: In this regard, what is the termination of the triple sphere?
bo: དེ་ ལ་ འཁོར་གསུམ་ ཡོངས་སུ་ ཆད་པ་ གང་ཞེ་ན་ །

source: Mind does not engage with the past, consciousness does not pursue the future, and mental activity does not engage with the present.
bo: གང་ འདས་པ་ ལ་ སེམས་ མི་ འཇུག་པ་ དང་ ། མ་འོངས་པ་ ལ་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ རྒྱུག་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ ལ་ ཡིད་ ལ་ བྱེད་པ་ མི་ འཇུག་པ་ -འོ་ ། །

source: Since mind, mental activity, and consciousness do not abide, one does not mull over the past, one does not give thought to the future, and one does not proliferate the present.
bo: དེ་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ མི་ གནས་པ་ -ས་ འདས་པ་ ལ་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། མ་འོངས་པ་ ལ་ མི་ སེམས་ ། ད་ལྟར་ བྱུང་བ་ སྤྲོས་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend the equality of the three times and the purification of the triple sphere. They should comprehend them.’
bo: དེ་ལྟར་ དུས་གསུམ་ མཉམ་པ་ཉིད་ དང་ ། འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ འདི་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, awakening is incorporeal and unconditioned.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ནི་ ལུས་མེད་ ཅིང་ འདུས་མ་བྱས་པ་ -འོ་ ། །

source: In this regard, that which is incorporeal is not perceptible to visual consciousness.
bo: དེ་ ལ་ ལུས་མེད་པ་ ནི་ གང་ མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ །

source: It is not perceptible to auditory, olfactory, taste, tactile, or mental consciousness.
bo: རྣ་བ་ དང་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ དང་ ། ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འོ་ ། །

source: The unconditioned is that which is without origination, cessation, and endurance.
bo: འདུས་མ་བྱས་ ཞེས་ བྱ་བ་ ནི་ གང་ ལ་ སྐྱེ་བ་ མེད་པ་ དང་ ། འཇིག་པ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ སྟེ་ །

source: That is the unconditioned, free of these three characteristics.
bo: དེ་ ནི་ མཚན་ཉིད་གསུམ་ དང་ བྲལ་བ་ -འི་ འདུས་མ་བྱས་ ཞེས་ བྱ་ -འོ་ ། །

source: That which is conditioned should also be comprehended to be just like the unconditioned.
bo: འདུས་མ་བྱས་ ཇི་ལྟ་ བར་ འདུས་བྱས་ ཀྱང་ དེ་བཞིན་ དུ་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The nature of all phenomena is nonexistence.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ རང་བཞིན་ གང་ཡིན་པ་ དེ་ ནི་ མེད་པ་ -འོ་ ། །

source: That which is nonexistent is nondual.
bo: མེད་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ གཉིས་ མེད་ དོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Immature ordinary beings do not comprehend the incorporeal and unconditioned. They should comprehend it.’
bo: ལུས་མེད་པ་ དང་ འདུས་མ་བྱས་ འདི་ བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ དག་ གིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །

source: “Son of noble family, what is called awakening is inseparable and abiding.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ དེ་ ནི་ དབྱེ་ -ར་ མེད་པ་ དང་ གནས་ སོ་ ། །

source: In this regard, what abides?
bo: དེ་ ལ་ གནས་ ནི་ གང་ །

source: What is inseparable?
bo: དབྱེ་ -ར་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Suchness abides.
bo: དེ་བཞིན་ཉིད་ ནི་ གནས་ སོ་ ། །

source: Nonabiding is inseparable.
bo: གནས་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The realm of phenomena abides.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ནི་ གནས་ སོ་ ། །

source: Nondifferentiation is inseparable.
bo: ཐ་དད་པ་ མ་ཡིན་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The limit of reality abides.
bo: ཡང་དག་པ་ -འི་ མཐའ་ ནི་ གནས་ སོ་ ། །

source: Immovability is inseparable.
bo: གཡོ་བ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Emptiness abides.
bo: སྟོང་པ་ཉིད་ ནི་ གནས་ སོ་ ། །

source: Lack of objective reference is inseparable.
bo: དམིགས་ སུ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Signlessness abides.
bo: མཚན་མ་ མེད་པ་ ནི་ གནས་ སོ་ ། །

source: Nonconceptuality is inseparable.
bo: རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Wishlessness abides.
bo: སྨོན་པ་ མེད་པ་ ནི་ གནས་ སོ་ ། །

source: Lack of making wishes is inseparable.
bo: སྨོན་ལམ་ འདེབས་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The nonexistence of sentient beings abides.
bo: སེམས་ཅན་ མེད་པ་ ཉིད་ ནི་ གནས་ སོ་ ། །

source: The essencelessness of sentient beings is inseparable.
bo: སེམས་ཅན་ ངོ་བོ་ ཉིད་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Space abides.
bo: ནམ་མཁའ་ ནི་ གནས་ སོ་ ། །

source: Lack of objective reference is inseparable.
bo: དམིགས་ སུ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Nonorigination abides.
bo: སྐྱེ་བ་ མེད་པ་ ནི་ གནས་ སོ་ ། །

source: Noncessation is inseparable.
bo: འགོག་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The unconditioned abides.
bo: འདུས་མ་བྱས་ ནི་ གནས་ སོ་ ། །

source: The absence of movement is inseparable.
bo: རྒྱུ་བ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Awakening abides.
bo: བྱང་ཆུབ་ ནི་ གནས་ སོ་ ། །

source: Tranquility is inseparable.
bo: ཉེ་བར་ ཞི་བ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Nirvāṇa abides.
bo: མྱ་ངན་ ལས་ འདས་པ་ ནི་ གནས་ སོ་ ། །

source: The absence of coming into being is inseparable.
bo: མངོན་པར་ གྲུབ་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Great tathāgata compassion extends to beings with the thought, ‘Sentient beings do not comprehend this inseparability and abiding. They should comprehend it.’
bo: དེ་ལྟར་ དབྱེ་ -ར་ མེད་པ་ དང་ ། གནས་ འདི་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཁོང་ དུ་མ་ ཆུད་པ་ -ས་ དེ་དག་ གིས་ ཁོང་ དུ་ ཆུད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ འཇུག་ གོ་ ། །
