Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: There is no way that any of that Will turn out to be otherwise.
bo: དེ་ ཀུན་ དེ་བཞིན་ བཤད་པ་ སྟེ་ ། ། གཞན་ དུ་ འགྱུར་བ་ ཡོད་ མ་ ཡིན་ ། །

source: To a lesser, middling, or supreme degree—
bo: ཐ་མ་ དང་ ནི་ འབྲིང་ དང་ མཆོག་ །

source: “ ‘All that he has explained not to be the case
bo: གང་དག་ གནས་མིན་ བཤད་པ་ ཡང་ ། །

source: There is no way that any of that Will turn out to be otherwise.
bo: དེ་ ཀུན་ དེ་བཞིན་ བཤད་པ་ སྟེ་ ། ། གཞན་ དུ་ འགྱུར་བ་ ཡོད་ མ་ ཡིན་ ། །

source: “ ‘He who knows what is and what is not the case Continuously explains the truth And the Dharma to creatures In accordance with their thoughts.
bo: གནས་ དང་ གནས་མིན་ རབ་ ཤེས་པ་ ། ། སེམས་ཅན་ བསམ་པ་ ཇི་བཞིན་ དུ་ ། ། དེ་ -ས་ ནི་ ཕྱད་པ་ -ར་ ཡང་དག་ དང་ ། ། ཆོས་ ཀྱང་ སྲོག་ཆགས་ རྣམས་ ལ་ བཤད་ ། །

source: “ ‘Other mendicants and brahmins Who rush around everywhere Do not know what is and what is not the case. That is not so for the Buddha.
bo: དགེ་སྦྱོང་ དང་ ནི་ བྲམ་ཟེ་ གཞན་ ། ། གང་ དུ་ ཐམས་ཅད་ རྒྱུག་བྱེད་ ཅིང་ ། ། གནས་ དང་ གནས་མིན་ མི་ ཤེས་པ་ ། ། སངས་རྒྱས་ ལ་ ནི་ དེ་ མེད་ དོ་ ། །

source: “ ‘When endowed with what is possible,
bo: གནས་ གང་ དང་ ནི་ ལྡན་པ་ -ས་ ན་ ། །

source: The liberation of beings will multiply.
bo: སེམས་ཅན་ ཐར་ བྱེད་ དཔུང་ འགྱུར་བ་ ། །

source: The fully qualified Buddha Explains that precisely.
bo: ཡོན་ཏན་ ཀུན་ལྡན་ སངས་རྒྱས་ ཀྱིས་ ། ། དེ་ ནི་ ཡང་དག་ རབ་ཏུ་ བཤད་ ། །

source: “ ‘Toward beings who are not receptive, The Buddha remains in equanimity.
bo: སེམས་ཅན་ གང་དག་ སྣོད་ མིན་ གང་ ། ། དེ་ ལ་ སངས་རྒྱས་ བཏང་སྙོམས་ མཛད་ ། །

source: He waits for the right occasion, The time at which to liberate them.
bo: གང་ གི་ དུས་ ན་ འགྲོལ་ འགྱུར་བ་ ། ། དེ་ ཡི་ དུས་ ལ་ རབ་ཏུ་ གཞེས་ ། །

source: “ ‘What liberates beings Is conduct beyond reproach.
bo: གང་ གིས་ སེམས་ཅན་ ཐར་ བྱེད་པ་ ། ། ཁ་ན་མ་ཐོ་ མེད་པ་ -འི་ ལས་ ། །

source: That is the first liberating activity Of the supremely intelligent Buddha.
bo: སངས་རྒྱས་ བློ་ མཆོག་ལྡན་པ་ ཡི་ ། ། འཕྲིན་ལས་ དང་པོ་ འདི་ ཡིན་ ནོ་ ། །

source: “ ‘His explanations of what is and what is not the case Are unfathomable and innumerable.
bo: གནས་ དང་ གནས་མིན་ བཤད་པ་ ནི་ ། ། དཔག་ ཏུ་ མེད་ ཅིང་ གྲངས་མེད་ དེ་ ། །

source: This power of the great sage Is hard for adversaries to match.’
bo: དྲང་སྲོང་ ཆེན་པོ་ -འི་ སྟོབས་ འདི་ ནི་ ། ། ཕ་རོལ་ རྒོལ་བ་ -ས་ ཐུབ་པ་ -ར་ དཀའ་ ། །

source: “Son of noble family, tathāgatas know skillfully and in accordance with reality about past, present, and future actions as well as the basis, causes, substance, and maturation of the actions undertaken.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ འདས་པ་ དང་ ། མ་འོངས་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ -འི་ ལས་ རྣམས་ དང་ ། ལས་ ལེན་པ་ རྣམས་ གནས་ དང་ ། རྒྱུ་ དང་ ། དངོས་པོ་ དང་ ། རྣམ་པ་ -ར་ སྨིན་པ་ ལ་ མཁས་བ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, how do they understand them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: Son of noble family, the tathāgatas know the actions undertaken in the past that spring from virtuous causes, are free of anything nonvirtuous, and will, in the future, engender what springs from virtuous causes.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ འདས་པ་ -འི་ ལས་ ལེན་པ་ གང་ དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ ། མི་དགེ་བ་ དང་ བྲལ་བ་ ། གང་ མ་འོངས་པ་ -འི་ དུས་ ན་ དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ འབྱིན་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that spring from nonvirtuous causes, are free of anything virtuous, and will, in the future, engender what springs from nonvirtuous causes.
bo: ལས་ ལེན་པ་ གང་ མི་དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ ། ། དགེ་བ་ དང་ བྲལ་བ་ གང་ མ་འོངས་པ་ -འི་ དུས་ ན་ ། མི་དགེ་བ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ འབྱིན་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་ བས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know in accordance with reality the actions undertaken that will become the basis for something minor in the future, the actions undertaken that will become the basis for something major in the future, the actions undertaken that are the basis for something minor in the present that will become the basis for something major in the future, and
bo: ལས་ ལེན་པ་ གང་ མ་འོངས་པ་ -འི་ དུས་ ན་ དམན་པ་ ལ་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ ས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལས་ ལེན་པ་ གང་ མ་འོངས་པ་ -འི་ དུས་ ན་ ཁྱད་པར་ ལ་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ -འི་ དུས་ ན་ དམན་པ་ ལ་ རྟེན་ ལ་མ་ འོངས་པ་ -འི་ དུས་ ན་ ཁྱད་པར་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: the actions undertaken that are the basis for something major in the present that will become the basis for something minor in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ -འི་ དུས་ ན་ ཁྱད་པར་ ལ་ རྟེན་ ལ་མ་ འོངས་པ་ -འི་ དུས་ ན་ དམན་པ་ ལ་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that are the basis for something minor in the present that will also become the basis for something minor in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ -འི་ དུས་ ན་ ཡང་ དམན་པ་ ལ་ རྟེན་ ལ་མ་ འོངས་པ་ -འི་ དུས་ ན་ ཡང་ དམན་པ་ ལ་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that are the basis for something major in the present that will also become the basis for something major in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ -འི་ དུས་ ན་ ཡང་ ཁྱད་པར་ ལ་ རྟེན་ ལ་མ་ འོངས་པ་ -འི་ དུས་ ན་ ཡང་ ཁྱད་པར་ ལ་ བརྟེན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that were a minor task in the past that will become something major and turn into a great success in the future.
bo: ལས་ ལེན་པ་ གང་ འདས་པ་ ན་ སྦྱོར་བ་ -ར་ དམན་ ལ་ དེ་ མ་འོངས་པ་ -འི་ དུས་ ན་ རྒྱ་ ཆེ་ ཞིང་ སྦྱོར་བ་ རྒྱ་ཆེ་བ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that require little exertion that may nonetheless become of great significance.
bo: ལས་ ལེན་པ་ གང་ རྩོམ་པ་ ཆུང་ ལ་ ཁྱད་པར་ ཆེན་པོ་ -ར་ འགྱུར་བ་ དང་ །

source: They also know the actions undertaken that require great exertion that may nonetheless become of little significance.
bo: ལས་ ལེན་པ་ གང་ རྩོམ་པ་ ཆེན་པོ་ -ར་ འགྱུར་ ལ་ ཁྱད་པར་ ཆུང་ངུ་ -ར་ འགྱུར་བ་ དང་ །

source: “They know the actions undertaken that will engender the cause of śrāvakahood, the actions undertaken that will engender the cause of pratyekabuddhahood, and the actions undertaken that will engender the cause of buddhahood.
bo: ལས་ ལེན་པ་ གང་ ཉན་ཐོས་ ཉིད་ ཀྱི་ རྒྱུ་ འབྱིན་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལས་ ལེན་པ་ གང་ རང་ སངས་རྒྱས་ ཉིད་ ཀྱི་ རྒྱུ་ འབྱིན་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལས་ ལེན་པ་ གང་ སངས་རྒྱས་ ཉིད་ ཀྱི་ རྒྱུ་ འབྱིན་པ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the actions undertaken that are painful at present but will lead to a blissful maturation in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ ན་ སྡུག་བསྔལ་ ལ་མ་ འོངས་པ་ ན་ རྣམ་པ་ -ར་ སྨིན་པ་ བདེ་བ་ -ར་ འགྱུར་བ་ དང་ །

source: They know the actions undertaken that are blissful at present but will lead to a painful maturation in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ ན་ བདེ་བ་ ལ་མ་ འོངས་པ་ ན་ རྣམ་པ་ -ར་ སྨིན་པ་ སྡུག་བསྔལ་ བར་ འགྱུར་བ་ དང་ །

source: The tathāgatas know the actions undertaken that are painful at present and will also lead to a painful maturation in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ ན་ སྡུག་བསྔལ་ ལ་མ་ འོངས་པ་ ན་ ཡང་ རྣམ་པ་ -ར་ སྨིན་པ་ སྡུག་བསྔལ་ བར་ འགྱུར་བ་ དང་ །

source: They know the actions undertaken that are blissful at present and will also lead to a blissful maturation in the future.
bo: ལས་ ལེན་པ་ གང་ ད་ལྟར་ བྱུང་བ་ ན་ ཡང་ བདེ་ ལ་མ་ འོངས་པ་ ན་ ཡང་ རྣམ་པ་ -ར་ སྨིན་པ་ བདེ་བ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “In these ways, son of noble family, the tathāgatas uniquely and independently understand in accordance with reality all about beings’ actions in the past, present, and future, their circumstances, and their maturation.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ ན་ འདས་པ་ དང་ ། མ་འོངས་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ ལས་ གང་ཡིན་པ་ དང་ ། རྐྱེན་ གང་ཡིན་པ་ དང་ ། རྣམ་པ་ -ར་ སྨིན་པ་ གང་ཡིན་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ་ -ས་ དེ་ ཁོ་ན་ དང་ ། གཞན་མ་ ཡིན་པ་ ལ་ རྟེན་པ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: With this understanding they teach the Dharma accordingly.
bo: མཁྱེན་ ནས་ ཀྱང་ དེ་བཞིན་ དུ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the second tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ གཉིས་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The tathāgatas are skilled in causes.
bo: དེ་བཞིན་ གཤེགས་པ་ རྒྱུ་ལ་ མཁས་པ་ སྟེ་ ། །

source: They are endowed with the eye of knowing how actions mature.
bo: ལས་ ཀྱི་ རྣམ་སྨིན་ ཚུལ་ མཁྱེན་སྤྱན་ དང་ ལྡན་ ། །

source: Not fettered by the three times,
bo: དུས་གསུམ་ དག་ ལ་ ཆགས་པ་ མི་ མངའ་ སྟེ་ ། །

source: They know the conduct of all sentient beings.
bo: སེམས་ཅན་ ཀུན་ གྱི་ སྤྱོད་པ་ རབ་ཏུ་ མཁྱེན་ ། །

source: Which causes engender bliss,
bo: རྒྱུ་ ནི་ གང་ཞིག་ བདེ་བ་ -ར་ འགྱུར་བ་ སྟེ་ ། །

source: Comprising maturation as gods and humans,
bo: ལྷ་ དང་ མི་ ཡི་ རྣམ་པ་ -ར་ སྨིན་ལྡན་ དང་ ། །

source: And which ones engender suffering.
bo: གང་ཡང་ སྡུག་བསྔལ་ དག་ ཏུ་ འགྱུར་བྱེད་པ་ ། །

source: “ ‘The sugatas know
bo: དེ་ ནི་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: Of virtuous and nonvirtuous actions,
bo: དགེ་བ་ དང་ ནི་ མི་དགེ་ -འི་ ལས་ རྣམས་ ཀྱི་ ། །

source: The causes and the maturation
bo: རྒྱུ་ དང་ རྣམ་པ་ -ར་ སྨིན་པ་ ཅིར་ འགྱུར་བ་ ། །

source: “ ‘The sugatas know
bo: དེ་ ནི་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ རབ་ མཁྱེན་ ཏེ་ ། །

source: Like holding a precious jewel in their hands.
bo: ནོར་བུ་ རིན་ཆེན་ ཕྱག་ ཏུ་ བཞག་པ་ བཞིན་ ། །

source: “ ‘Which actions arise from tiny causes
bo: ལས་ གང་ ཆུང་ངུ་ -འི་ རྒྱུ་ལས་ བྱུང་ གྱུར་ ལ་ ། །

source: And engender immeasurable consequences,
bo: ཚད་ མེད་ རྒྱུད་ ཀྱང་ འབྱིན་པ་ -ར་ འགྱུར་བ་ དང་ ། །

source: However vast or tiny they may be—
bo: གང་ཡང་ རྒྱ་ཆེ་བ་ དང་ ཆུང་ངུ་ ཡང་ ། །

source: The buddhas know them all exactly.
bo: དེ་ ནི་ ཇི་ལྟ་ བཞིན་ དུ་ སངས་རྒྱས་ མཁྱེན་ ། །

source: What leads to the Śrāvaka Vehicle,
bo: གང་ཡང་ ཉན་ཐོས་ ཀྱི་ ནི་ རྒྱུ་ འབྱིན་ དང་ ། །

source: What leads to the Pratyekabuddha Vehicle,
bo: རྐྱེན་ གྱི་ ཐེག་པ་ དེ་བཞིན་ འབྱིན་པ་ དང་ ། །

source: And the causes of a victor.
bo: གང་ཡང་ རྒྱལ་བ་ -འི་ རྒྱུ་ ནི་ འབྱིན་ འགྱུར་བ་ ། །

source: “ ‘The sugatas know all about
bo: དེ་ ཀུན་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘They know which causes are painful now But will later engender bliss;
bo: རྒྱུ་ ནི་ གང་ཞིག་ སྡུག་བསྔལ་ འགྱུར་བྱེད་ ལ་ ། ། དེ་ཡང་ བདེ་བ་ དག་ ཏུ་ འགྱུར་བ་ དང་ ། །

source: Which causes are blissful now But will later engender pain;
bo: རྒྱུ་ ནི་ གང་ཞིག་ བདེ་བ་ -ར་ འགྱུར་བྱེད་ ལ་ ། ། དེ་ཡང་ སྡུག་བསྔལ་ དག་ ཏུ་ འགྱུར་བ་ དང་ ། །

source: “ ‘Which causes are painful now and will be painful later;
bo: རྒྱུ་ ནི་ བདེ་ ལ་ སྡུག་བསྔལ་ གནས་པ་ དང་ ། །

source: And which causes are blissful now and will be blissful later.
bo: རྒྱུ་ ཡང་ བདེ་ ལ་ བདེ་བ་ -ར་ གནས་པ་ དང་ ། །

source: The sugatas thus know the true nature of actions
bo: ལས་ ཀྱི་ ངོ་བོ་ ཉིད་ ཀྱི་ ཆོས་ཉིད་ ནི་ ། ། རྒྱུ་ དང་ འཐུན་པ་ -ར་ བདེ་གཤེགས་ རབ་ཏུ་ མཁྱེན་ ། །

source: By all beings of the three times,
bo: དུས་གསུམ་ དག་ ཏུ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ། །

source: In accordance with their causes. “ ‘With their unique buddha wisdom Of actions and the causes for their engagement
bo: རྒྱུ་ གང་ ལས་ འཇུག་བྱེད་ དང་ལས་ ཀྱང་ ནི་ ། ། གཞན་མ་ ཡིན་པ་ -ར་ སངས་རྒྱས་ ཡེ་ཤེས་ ཀྱིས་ ། །

source: The victors always know this just as it is.’
bo: དེ་བཞིན་ རྒྱལ་བ་ -ས་ ཕྱད་པ་ -ར་ རབ་ཏུ་ མཁྱེན་ ། །

source: “Son of noble family, the tathāgatas know in accordance with reality the many and various inclinations of other beings and individuals.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སེམས་ཅན་ གཞན་ རྣམས་ དང་ ། གང་ཟག་ གཞན་དག་ གི་ མོས་པ་ དུ་མ་ དང་ ། མོས་པ་ སྣ་ཚོགས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, how do they know in accordance with reality the many and various inclinations of other beings and individuals?
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སེམས་ཅན་ གཞན་དག་ དང་ ། གང་ཟག་ གཞན་ རྣམས་ ཀྱི་ མོས་པ་ དུ་མ་ དང་ ། མོས་པ་ སྣ་ཚོགས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན

source: They know which individuals are established in attachment and inclined toward aversion, which individuals are established in aversion and inclined toward attachment, and which individuals are established in delusion and inclined toward attachment, aversion, and delusion.
bo: གང་ཟག་ གང་ འདོད་ཆགས་ ལ་ གནས་ ཤིང་ ཞེ་སྡང་ ལ་མོ་ -ས་པ་ དང་ ། གང་ཟག་ གང་ ཞེ་སྡང་ ལ་ གནས་ ཤིང་ འདོད་ཆགས་ ལ་མོ་ -ས་པ་ དང་ ། གང་ཟག་ གང་ གཏི་མུག་ ལ་ གནས་ ཤིང་ འདོད་ཆགས་ དང་ ། ཞེ་སྡང་ དང་ ། གཏི་མུག་ ལ་མོ་ -ས་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: The tathāgatas know which individuals are established in virtue and inclined toward virtue, which individuals whose engagement is minor are inclined with a vast intention, and which individuals whose engagement is vast are inclined with a minor intention.
bo: གང་ཟག་ གང་ དགེ་བ་ ལ་ གནས་ ཤིང་ དགེ་བ་ ལ་མོ་ -ས་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། གང་ཟག་ གང་དག་ སྦྱོར་བ་ དམན་ ཞིང་ བསམ་པ་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། གང་ཟག་ གང་དག་ སྦྱོར་བ་ རྒྱ་ ཆེ་ ཞིང་ བསམ་པ་ དམན་པ་ ལ་མོ་ -ས་པ་ དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know which inclinations will transform minor engagements into major ones and which inclinations will transform superior engagements into minor ones.
bo: མོས་པ་ གང་ གིས་ སྦྱོར་བ་ དམན་ ཞིང་ ཁྱད་པར་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ སྦྱོར་བ་ ཁྱད་པར་ དུ་ འཕགས་ ཤིང་ དམན་པ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དང་ །

source: They know in accordance with reality which inclinations lead to acquiring a determined disposition that is destined for error, which inclinations remain undetermined, which inclinations lead to acquiring a disposition that is destined for truth, and which inclinations lead to attaining liberation in the case of one destined for truth.
bo: མོས་པ་ གང་ གིས་ ལོག་པ་ ཉིད་ དུ་ ངེས་ ལ་ ངེས་པ་ -འི་ ཁམས་ ཐོབ་པ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ མ་ ངེས་ ལ་ ཡང་དག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ ཁམས་ ཐོབ་པ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ ཡང་དག་པ་ ཉིད་ དུ་ ངེས་ ལ་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know which inclinations will lead beyond the desire realm, which will lead beyond the form realm, and which will lead beyond the third realm.
bo: མོས་པ་ གང་ གིས་ འདོད་པ་ -འི་ ཁམས་ ལས་ ཡང་དག་པ་ -ར་ འདའ་བ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ གཟུགས་ ཀྱི་ ཁམས་ ལས་ ཡང་དག་པ་ -ར་ འདའ་བ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ ཁམས་ གསུམ་པ་ ལས་ ཡང་དག་པ་ -ར་ འདའ་བ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know which inclinations will suppress something major through relying on something minor and which inclinations will transform something major into something minor.
bo: མོས་པ་ གང་ གིས་ དམན་པ་ ལ་ སྟེན་ ཅིང་ ཁྱད་པར་ གནོན་པ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ ཁྱད་པར་ དུ་ གྱུར་ ནས་ ཀྱང་ དམན་པ་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know which inclinations will bring about the attainment of varying kinds of corresponding birth, appearance, and means of livelihood.
bo: མོས་པ་ གང་ གིས་ སྐྱེ་བ་ ཐ་དད་པ་ དང་ ། ཁ་དོག་ ཐ་དད་པ་ དང་ ། ཡོངས་སུ་ ལོངས་སྤྱོད་པ་ ཐ་དད་པ་ ཡོངས་སུ་ འཛིན་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: The tathāgatas know which inclinations will lead to downfall from the peak of existence and which inclinations will lead to the attainment of liberation.
bo: མོས་པ་ གང་ གིས་ རྩེ་མོ་ ལས་ ཉམས་པ་ -ར་ འགྱུར་བ་ དང་ ། མོས་པ་ གང་ གིས་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཐོབ་པ་ -ར་ འགྱུར་བ་ དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: With this understanding they teach the Dharma accordingly.
bo: མཁྱེན་ ནས་ ཀྱང་ དེ་བཞིན་ དུ་ ཆོས་སྟོན་ ཏོ་ ། །

source: This is the third tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ གསུམ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘With their limitless intelligence, the tathāgatas know the entire range
bo: འཇིག་རྟེན་ མོས་པ་ སྣ་ཚོགས་ མོས་པ་ དུ་མ་ -ར་ བློ་གྲོས་ ཚད་ མེད་པ་ ། །

source: Of the world’s various and manifold inclinations.
bo: དེ་ ཡི་ མོས་པ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ལྷག་མ་ མ་ ལུས་ མཁྱེན་པ་ -ར་ གྱུར་ ། །

source: The buddhas know well which inclinations are caused by aversion and instill attachment
bo: འདི་ ན་ གང་ གི་ མོས་པ་ ཞེ་སྡང་ རྒྱུས་ བྱུང་ འདོད་ཆགས་ གནས་པ་ དང་ ། །

source: And which ones instill aversion and incline toward delusion.
bo: ཞེ་སྡང་ གནས་ ཤིང་ གཏི་མུག་ མོས་པ་ སངས་རྒྱས་ ཀྱིས་ ནི་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘With minds established in delusion, beings may engage in virtue or attachment.
bo: གཏི་མུག་ གནས་པ་ -འི་ སེམས་ ནི་ དགེ་ དང་ འདོད་ཆགས་ ལ་ ཡང་འཇུག་པ་ དང་ ། །

source: Whichever is the case, it may be with minor engagement but a vast inclination.
bo: དེ་ -འི་ འོག་ གང་ འཇུག་པ་ དང་སེམས་ ཅན་ སྦྱོར་བ་ དམན་ ལ་ རྒྱ་ ཆེན་ མོས་ ། །

source: Even when there is vast intent and vast engagement, Inclination may transform it into something minor.
bo: བསམ་པ་ རྒྱ་ཆེ་བ་ དང་ གང་དག་ སྦྱོར་བ་ རྒྱ་ ཆེན་ ཡོད་ ཀྱང་ ནི་ ། ། མོས་པ་ དམན་པ་ -ར་ གྱུར་པ་

source: This the sugatas know.
bo: དེ་ཡང་ བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘The buddhas know which inclinations will transform a being’s minor engagement into something vast
bo: མོས་པ་ གང་ གིས་ སེམས་ཅན་ སྦྱོར་བ་ དམན་ ལ་ རྒྱ་ ཆེ་ -ར་ འགྱུར་བ་ དང་ ། །

source: And a being’s vast intelligence into something minor.
bo: སེམས་ཅན་ བློ་གྲོས་ རྒྱ་ ཆེན་ འགྱུར་ ལ་ དམན་པ་ -ར་ འགྱུར་བ་ དེ་ཡང་ མཁྱེན་ ། །

source: They know which inclinations are destined for error,
bo: ལོག་པ་ ཉིད་ དུ་ གང་ ངེས་པ་ ཡང་ཡང་ དག་ ཉིད་ དུ་ ངེས་ འགྱུར་ དང་ ། །

source: Which for the truth, and which for liberation from the three realms.
bo: ཁམས་ གསུམ་པ་ ལས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ མོས་པ་ -འང་ སངས་རྒྱས་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘The victors know well which inclinations bring about which births, appearances, And means of livelihood of all sentient beings of all the three times,
bo: དུས་གསུམ་ ཐམས་ཅད་ དག་ གི་ སེམས་ཅན་ ཀུན་ གྱི་ སྐྱེ་ དང་ཁ་ དོག་ དང་ ། ། དེ་བཞིན་ ལོངས་སྤྱོད་ ཐ་དད་པ་ དང་

source: Which bring downfall from the peak of existence, and which bring liberation.
bo: རྩེ་མོ་ ལས་ ནི་ ཉམས་འགྱུར་ དང་ ། ། གང་ཡང་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ འགྱུར་བ་ -འི་ མོས་པ་ རྒྱལ་བ་ -ས་ ཐམས་ཅད་ མཁྱེན་ ། །

source: With this knowledge they teach the Dharma—such is said to be the activity of the sugatas.’
bo: མཁྱེན་ ནས་ ཆོས་སྟོན་ མཛད་པ་ འདི་ ཡང་ བདེ་གཤེགས་ འཕྲིན་ལས་ ཡིན་ ཞེས་ གསུངས་ ། །

source: “Son of noble family, the tathāgatas know, in accordance with reality, the worlds that are comprised of many and various elements.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཁམས་ དུ་མ་ དང་ ། ཁམས་ སྣ་ཚོགས་ ཅན་ གྱི་ འཇིག་རྟེན་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, how do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know, in accordance with reality, which elements accumulate mundane virtuous conditioning, which elements accumulate nonvirtuous conditioning, which elements accumulate neutral conditioning, and which elements establish one in the element of deliverance.
bo: ཁམས་ གང་ གིས་ འཇིག་རྟེན་ བསོད་ནམས་ ཀྱི་ འདུ་བྱེད་ སོགས་པ་ -འི་ ཁམས་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཁམས་ གང་ གིས་ བསོད་ནམས་ མ་ཡིན་པ་ -འི་ འདུ་བྱེད་ སོགས་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཁམས་ གང་ གིས་ མི་གཡོ་བ་ -འི་ འདུ་བྱེད་ སོགས་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ཁམས་ གང་ གིས་ འབྱུང་བ་ -འི་ ཁམས་ སུ་ -འང་ འཇོག་པ་ -ར་ འགྱུར་བ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “They know the element of the eye, the element of form, and the element of visual consciousness.
bo: གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མིག་ གི་ ཁམས་ དང་ ། གཟུགས་ ཀྱི་ ཁམས་ དང་ ། མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the element of the ear, the element of sound, and the element of auditory consciousness.
bo: རྣ་བ་ -འི་ ཁམས་ དང་ ། སྒྲ་ -འི་ ཁམས་ དང་ ། རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the element of the nose, the element of smell, and the element of olfactory consciousness.
bo: སྣ་ -འི་ ཁམས་ དང་ ། དྲི་ -འི་ ཁམས་ དང་ ། སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the element of the tongue, the element of taste, and the element of the consciousness of taste.
bo: ལྕེ་ -འི་ ཁམས་ དང་ ། རོ་ -འི་ ཁམས་ དང་ ། ལྕེ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the element of the body, the element of the tactile, and the element of tactile consciousness.
bo: ལུས་ ཀྱི་ ཁམས་ དང་ ། རེག་བྱ་ -འི་ ཁམས་ དང་ ། ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the element of the mind, the element of phenomena, and the element of mental consciousness.
bo: ཡིད་ ཀྱི་ ཁམས་ དང་ ། ཆོས་ ཀྱི་ ཁམས་ དང་ ། ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be an inner emptiness, an outer emptiness, and an inner and outer emptiness, respectively.
bo: ནང་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ སྟོང་པ་ཉིད་ དང་ ། ཕྱི་ ནང་ སྟོང་པ་ཉིད་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the elements of earth, water, fire, and wind.
bo: ས་ -འི་ ཁམས་ དང་ ། ཆུ་ -འི་ ཁམས་ དང་ ། མེ་ -འི་ ཁམས་ དང་ ། རླུང་ གི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to be just like the element of space.
bo: ནམ་མཁའ་ -འི་ ཁམས་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “They know the desire realm, the form realm, and the formless realm.
bo: འདོད་པ་ -འི་ ཁམས་ དང་ ། གཟུགས་ ཀྱི་ ཁམས་ དང་ ། གཟུགས་ མེད་པ་ -འི་ ཁམས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: How do they know them?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: They know them to originate in false imagining.
bo: ཀུན་ ཏུ་ རྟོག་པ་ ལས་ བྱུང་བ་ -ར་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །
