Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “All phenomena lack elements because they are like the space element, without guidance because they completely transcend the path of objects, without objects because they are unmoving, without desire because they are not falsely imagined, without form because they are without engagement, not formless because they are not determined, not disordered because they are devoid of disorder, inconceivable because they cannot be apprehended, without mental activity because they are indivisible into duality, unapprehendable because they completely transcend the path of objects, without a substratum because they are impermanent, noneternal because they are not in disharmony with a support, nameless because they lack conceptual signs, unmixed because there is no relative continuity, without foundation because they are foundationless, inexpressible because they have nothing to regret, lacking regret because they are free of sin, without karmic traces because they are stainless, stainless because they are primordially pure, and primordially pure because of the absence of afflictive emotions.
bo: ཁམས་ ནམ་མཁའ་ དང་ མཚུངས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཁམས་ མེད་པ་ -འོ་ ། ། ཡུལ་ གྱི་ ལམ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདྲེན་པ་ མེད་པ་ -འོ་ ། ། རྒྱུ་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཡུལ་མེད་པ་ -འོ་ ། ། ཀུན་བརྟགས་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདོད་པ་ མེད་པ་ -འོ་ ། ། འཇུག་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟུགས་ མེད་པ་ -འོ་ ། ། ངེས་པར་ སེམས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟུགས་ མེད་པ་ མ་ཡིན་པ་ -འོ་ ། ། འཁྲུགས་པ་ སྤངས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འཁྲུགས་པ་ མེད་པ་ -འོ་ ། ། གཟུང་བ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ། ། གཉིས་ སུ་ དབྱེ་ -ར་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཡིད་ མེད་པ་ -འོ་ ། ། ཡུལ་ གྱི་ ལམ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟུང་བ་ མ་ཡིན་པ་ -འོ་ ། ། རྟག་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཀུན་གཞི་ མེད་པ་ -འོ་ ། ། རྟེན་པ་ དང་ མི་ འཐུན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཐེར་ཟུག་ མ་ཡིན་པ་ -འོ་ ། ། མཚན་མ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མིང་མེད་པ་ -འོ་ ། ། ཕན་ཚུན་ གཅིག་ ནས་ གཅིག་ ཏུ་ བརྒྱུད་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འདྲེས་པ་ མེད་པ་ -འོ་ ། ། གནས་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གནས་པ་ མེད་པ་ -འོ་ ། ། འགྱོད་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྗོད་པ་ མེད་པ་ -འོ་ ། ། སྡིག་པ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ འགྱོད་པ་ མེད་པ་ -འོ་ ། ། དྲི་མ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བག་ཆགས་ མེད་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། ། ཉོན་མོངས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -འོ་ ། །

source: “All phenomena are without afflictive emotions because they lack support, without support because they lack deception, without deception because they enter nonattachment, entering into nonattachment because they are unobscured, unobscured because they are like space, like space because they are without conceptuality, immaterial because they are motionless, indemonstrable because they do not appear, nonappearing because they are free of appearance, without similarity on account of lacking dissimilarity, without dissimilarity because they are like space, without darkness because they lack luminosity, without appearance because they are beyond remedies, beyond contemptibility because they are beyond wrongdoing, and beyond contemptibility because they do not perform actions.
bo: རྟེན་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། ། གཡོས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྟེན་པ་ མེད་པ་ -འོ་ ། ། ཆགས་པ་ མེད་པ་ -ར་ འཇུག་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཡོ་བ་ མེད་པ་ -འོ་ ། ། སྒྲིབ་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཆགས་པ་ མེད་པ་ -ར་ འཇུག་པ་ -འོ་ ། ། ནམ་མཁའ་ དང་ མཚུངས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྒྲིབ་པ་ མེད་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ནམ་མཁའ་ དང་ མཚུངས་པ་ -འོ་ ། ། རྒྱུ་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟུགས་ཅན་ མ་ཡིན་པ་ -འོ་ ། ། སྣང་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བསྟན་ དུ་ མེད་པ་ -འོ་ ། ། སྣང་བ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྣང་བ་ མེད་པ་ -འོ་ ། ། མི་མཉམ་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མཉམ་པ་ མེད་པ་ -འོ་ ། ། ནམ་མཁའ་ དང་ མཚུངས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མི་མཉམ་པ་ མེད་པ་ -འོ་ ། ། གསལ་བ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མུན་པ་ མེད་པ་ -འོ་ ། ། གཉེན་པོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྣང་བ་ མེད་པ་ -འོ་ ། ། ལྟུང་བ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཁ་ན་མ་ཐོ་བ་ མེད་པ་ -འོ་ ། ། ལས་ བྱས་པ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཁ་ན་མ་ཐོ་བ་ མེད་པ་ -འོ་ ། །

source: All phenomena are not in accordance with reality because they are deceptive fictions.
bo: བརྫུན་པ་ སླུ་བ་ -འི་ ཆོས་ ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཇི་ལྟ་བ་ བཞིན་ དུ་མ་ ཡིན་པ་ -འོ་ ། །

source: They lack differentiation because they are primordially present.
bo: གཟོད་མ་ ནས་ གནས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཕྱེ་བ་ མེད་པ་ -འོ་ ། །

source: “All phenomena lack spectators because they are formless, are without an audience because they are soundless;
bo: གཟུགས་ཅན་ མ་ཡིན་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ལྟ་བ་པོ་ མེད་པ་ -འོ་ ། ། སྒྲ་མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ ཉན་པ་པོ་ མེད་པ་ -འོ་ ། །

source: they are without a perceiver of smell because they are odorless, without a perceiver of taste because they are without taste, without a perceiver of touch because they are intangible, without a perceiving consciousness because they are not phenomena, and without objectification because they are beyond mind, mental activity, and consciousness;
bo: དྲི་མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ སྣོམ་པ་པོ་ མེད་པ་ -འོ་ ། ། རོ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མྱང་བ་པོ་ མེད་པ་ -འོ་ ། ། རེག་བྱ་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རེག་པ་པོ་ མེད་པ་ -འོ་ ། ། ཆོས་ མེད་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ ཤེས་པ་པོ་ མེད་པ་ -འོ་ ། ། སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ དམིགས་པ་ མེད་པ་ -འོ་ ། །

source: and they are inconceivable because they are like awakening, and they have primordially transcended sorrow because they are primordially unborn.
bo: བྱང་ཆུབ་ དང་ མཚུངས་ ཤིང་ འདྲ་བ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ། ། གཟོད་མ་ ནས་ མ་ སྐྱེས་པ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -འོ་ ། །

source: “In this way, son of noble family, as the bodhisattvas utter the primary letter a, because they have attained the pure melody dhāraṇī their teaching of the Dharma goes on for an eon or more without the sound of the letter a ever being lost.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ གཟུངས་ རབ་ཏུ་ ཐོབ་པ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཡི་གེ་ -འི་ དང་པོ་ ཨ་ཞེ་ -ས་ བྱ་བ་ ཡོངས་སུ་ རྗོད་པ་ ན་ བསྐལ་པ་ -འམ་ ། བསྐལ་པ་ ལས་ ལྷག་པར་ ཆོས་སྟོན་ ཀྱང་ ཡི་གེ་ ཨ་ཞེ་ -ས་ བྱ་བ་ -འི་ སྒྲ་ མི་ འདོར་བ་ -ར་ སྟོན་ ཏོ་ ། །

source: In the same way, any letter among all the letters used to teach the Dharma will not dissipate.
bo: དེ་བཞིན་ དུ་ སྦྱར་ ཏེ་ ། ཡི་གེ་ ཐམས་ཅད་ ཀྱི་ ནང་ ནས་ ཡི་གེ་ གང་དང་གང་ གིས་ ཆོས་སྟོན་པ་ -ར་ རྩོམ་པ་ -འི་ ཡི་གེ་ དེ་ དང་ དེ་ ཟད་པར་ མི་ འགྱུར་ རོ་ ། །

source: They teach the Dharma, in word and meaning, unceasingly.
bo: རྒྱུན་ ཆད་པ་ མེད་པ་ -ར་ ཆོས་ ཀྱི་ ཚུལ་ དོན་ དང་ ཚིག་འབྲུ་ དང་ ལྡན་པ་ སྟོན་ ཏོ་ ། །

source: “With regard to bodhisattvas established in this dhāraṇī, their bodies are pure due to their behavior, their speech is pure due to their eloquence, and their minds are pure due to their cultivation of love.
bo: གཟུངས་ འདི་ ལ་ རབ་ཏུ་ གནས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ སྤྱོད་ལམ་ གྱིས་ ལུས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། ། སྤོབས་པ་ -ས་ ངག་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། ། བྱམས་པ་ སྒོམ་པ་ -ས་ སེམས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their generosity is pure due to the absence of miserliness in making gifts of the Dharma and material wealth. Their morality is pure because there is no degeneration in their discipline.
bo: ཆོས་ དང་ ཟང་ཟིང་ སྦྱིན་པ་ ལ་ སེར་སྣ་ མེད་པ་ -ས་ སྦྱིན་པ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། ། ཚུལ་ཁྲིམས་ ཉམས་པ་ མེད་པ་ -ས་ ཚུལ་ཁྲིམས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their patience is pure due to the absence of animosity.
bo: ཞེ་ འགྲས་པ་ -འི་ སེམས་ མེད་པ་ -ས་ བཟོད་པ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their vigor is pure due to their performance of virtuous actions.
bo: ལེགས་པ་ -ར་ བྱེད་པ་ -འི་ ལས་ བྱེད་པ་ -ས་ བརྩོན་འགྲུས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their concentration is pure because they are unattached.
bo: དེ་ ལ་མ་ ཆགས་པ་ -ས་ བསམ་གཏན་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their insight is pure because the light of their wisdom is without darkness.
bo: ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ རབ་རིབ་ མེད་པ་ -ས་ ཤེས་རབ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their behavior is pure due to an absence of contemptible acts.
bo: ཁ་ན་མ་ཐོ་བ་ མེད་པ་ -ས་ ལས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: “Their eyes are pure due to the purity of their divine vision.
bo: ལྷ་ -འི་ མིག་ ཡོངས་སུ་ དག་པ་ -ས་ མིག་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their ears are pure due to attaining the divine ear and listening to the Dharma discourses of all the tathāgatas.
bo: ལྷ་ -འི་ རྣ་བ་ ཐོབ་པ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ ཀྱིས་ ཆོས་ བསྟན་པ་ ཉན་པ་ -ས་ རྣ་བ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their noses are pure because they perceive the fragrance of the tathāgatas’ discipline.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱི་ དྲི་ ལ་ སྣོམ་པ་ -འི་ ཕྱིར་ སྣ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their tongues are pure due to an absence of thirst for delicious taste.
bo: རོ་ ཞིམ་པོ་ ལ་ བརྐམ་པ་ མེད་པ་ -འི་ ཕྱིར་ ལྕེ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their bodies are pure because they are born miraculously and unstained by the impurities of a womb.
bo: རྫུས་ ཏེ་ སྐྱེ་བ་ -ས་ མངལ་ གྱི་ དྲི་མ་ -ས་ མི་ གོས་པ་ -འི་ ཕྱིར་ ལུས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Their minds are pure because they are skilled in distinguishing phenomena.
bo: ཆོས་ རབ་ཏུ་ འབྱེད་པ་ ལ་ མཁས་པ་ -ས་ སེམས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: “For them, form is pure because they are well adorned by signs.
bo: མཚན་ གྱིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ -ས་ གཟུགས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Sound is pure because they articulate pleasing speech.
bo: ཡིད་ དུ་ འོང་བ་ -འི་ སྒྲ་ རྗོད་པ་ -ས་ ། སྒྲ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Scent is pure because they are draped in the fragrance of discipline, learning, and generosity.
bo: ཚུལ་ཁྲིམས་ དང་ ། ཐོས་པ་ དང་ ། གཏོང་བ་ -འི་ དྲིས་ ཡོངས་སུ་ བསྒོས་པ་ -ས་ ། དྲི་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Taste is pure because they have attained the supreme taste, the sign of a great being.
bo: སྐྱེས་བུ་ ཆེན་པོ་ -འི་ མཚན་ རོ་ བྲོ་བ་ -འི་ མཆོག་ཐོབ་པ་ -ས་ ། རོ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Touch is pure because they have attained smooth and pliant limbs.
bo: འཇམ་ ཞིང་ མཉེན་པ་ -འི་ རྐང་ལག་ ཐོབ་པ་ -ས་ ། རེག་པ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Phenomena are pure because they have attained the illumination of the Dharma.
bo: ཆོས་ ལ་ སྣང་བ་ ཐོབ་པ་ -ས་ ཆོས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: Likewise, their mindfulness is pure because they have not forgotten the dharmas they have heard, their intelligence is pure because they have completely transcended the works of Māra, and their realization is pure because they have internalized the realization of the profound Dharma.
bo: ཇི་ལྟར་ ཐོས་པ་ -འི་ ཆོས་ རྣམས་ མ་ བརྗེད་པ་ -ས་ དྲན་པ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། ། བདུད་ ཀྱི་ ལམ་ ལས་ ཤིན་ཏུ་ འདས་པ་ -ས་ བློ་གྲོས་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། ། ཆོས་ ཟབ་མོ་ རྟོགས་པ་ -ར་ ཁོང་ དུ་ ཆུད་པ་ -ས་ རྟོགས་པ་ རྣམ་པ་ -ར་ དག་པ་ ཡིན་ ནོ་ ། །

source: “Bodhisattvas established in this dhāraṇī pervade with light as many buddhafields as have understood its sound.
bo: གཟུངས་ འདི་ ལ་ རབ་ཏུ་ གནས་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཇི་སྙེད་ སྒྲ་ -ས་ གོ་བ་ -ར་ བྱེད་པ་ དེ་སྙེད་ འོད་ ཀྱིས་ རྒྱས་པ་ -ར་ འགེངས་ སོ་ ། །

source: That is to say, due to the attainment of the exceptional uniqueness of this very dhāraṇī, this light causes the Dharma taught by all the buddhas of the ten directions to manifest.
bo: འདི་ལྟ་སྟེ་ ། གཟུངས་ འདི་ཉིད་ ཀྱི་ མ་ འདྲེས་པ་ -འི་ ཁྱད་པར་ རབ་ཏུ་ ཐོབ་པ་ -ས་ འོད་ དེ་ -ས་ ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱིས་ གསུངས་པ་ -འི་ ཆོས་ ཀྱི་ ཚུལ་ འབྱུང་བ་ -ར་ བྱེད་ དོ་ ། །

source: “Son of noble family, this pure melody dhāraṇī is introduced only concisely here.
bo: རིགས་ ཀྱི་ བུ་ སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ གཟུངས་ འདི་ ནི་ གང་ ཆུང་ ཟད་ གཞོལ་བ་ -ར་ འཇུག་པ་ སྟེ་ །

source: The teaching on this dhāraṇī of pure melody is immeasurable.
bo: སྒྲ་དབྱངས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ གཟུངས་ འདི་ བསྟན་པ་ ནི་ ཚད་ མེད་ དེ་ །

source: It is inconceivable in terms of the categories of language.
bo: ཡི་གེ་ རྣམ་པ་ -ར་ ཕྱེ་བ་ -ས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ། །

source: It is limitless in terms of instructions.
bo: ངེས་པར་ བསྟན་པ་ -ས་ མཐའ་ཡས་པ་ -འོ་ ། །

source: It is immeasurable in terms of lacking all doubt.
bo: རྣམ་པ་ -ར་ གདོན་ མི་ ཟ་བ་ -ས་ ཚད་ མེད་པ་ -འོ་ ། །

source: It is infinite in terms of explanation.
bo: བཤད་པ་ -ས་ ཐུག་པ་ མེད་པ་ -འོ་ ། །

source: It is without attachment in terms of engagement.
bo: གཞོལ་བ་ -ར་ འཇུག་པ་ -ས་ ཆགས་པ་ མེད་པ་ -འོ་ ། །

source: “Son of noble family, you may then ask, ‘What is the inexhaustible basket dhāraṇī?’
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ མི་ཟད་པ་ -འི་ ཟ་མ་ཏོག་ གི་ གཟུངས་ གང་ཞེ་ན་ །

source: It is the inexhaustible teaching of the dhāraṇī. The following teachings are inexhaustible:
bo: འདི་ལྟ་སྟེ་ ། གཟུངས་ ཀྱི་ བསྟན་པ་ མི་ཟད་པ་ སྟེ་ །

source: The teaching on impermanence says, ‘Form is impermanent.’
bo: གཟུགས་ མི་རྟག་ གོ་ ཞེས་ མི་རྟག་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on suffering says, ‘Form is suffering.’
bo: གཟུགས་ སྡུག་བསྔལ་ ལོ་ ཞེས་ སྡུག་བསྔལ་ བར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of self says, ‘Form is without self.’
bo: གཟུགས་ བདག་མེད་པ་ -འོ་ ཞེས་ བདག་མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on peace says, ‘Form is peace.’
bo: གཟུགས་ ཞི་བ་ -འོ་ ཞེས་ ཞི་བ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on voidness says, ‘Form is void.’
bo: གཟུགས་ དབེན་པ་ -འོ་ ཞེས་ དབེན་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to a water bubble says, ‘Form is like a water bubble.’
bo: གཟུགས་ དབུ་བ་ རྡོས་པ་ ལྟ་བུ་ -འོ་ ཞེས་ དབུ་ བརྔོས་པ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to an illusion says, ‘Form is like an illusion.’
bo: གཟུགས་ སྒྱུ་མ་ ལྟ་བུ་ -འོ་ ཞེས་ སྒྱུ་མ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to a hallucination says, ‘Form is like a hallucination.’
bo: གཟུགས་ སྨིག་རྒྱུ་ ལྟ་བུ་ -འོ་ ཞེས་ སྨིག་རྒྱུ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to the moon’s reflection in water says, ‘Form is like the moon’s reflection in water.’
bo: གཟུགས་ ཆུ་ -འི་ ཟླ་བ་ ལྟ་བུ་ -འོ་ ཞེས་ ཆུ་ -འི་ ཟླ་བ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to a dream says, ‘Form is like a dream.’
bo: གཟུགས་ རྨི་ལམ་ ལྟ་བུ་ -འོ་ ཞེས་ རྨི་ལམ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to an echo says, ‘Form is like an echo.’
bo: གཟུགས་ བྲག་ཅ་ ལྟ་བུ་ -འོ་ ཞེས་ བྲག་ཅ་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to an optical illusion says, ‘Form is like an optical illusion.’
bo: གཟུགས་ མིག་ཡོར་ ལྟ་བུ་ -འོ་ ཞེས་ མིག་ཡོར་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on likeness to a reflection says, ‘Form is like a reflection.’
bo: གཟུགས་ གཟུགས་བརྙན་ ལྟ་བུ་ -འོ་ ཞེས་ གཟུགས་བརྙན་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of a nature says, ‘Form is natureless.’
bo: གཟུགས་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ཞེས་ ངོ་བོ་ ཉིད་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of substantiality says, ‘Form is insubstantial.’
bo: གཟུགས་ དངོས་པོ་ མེད་པ་ -འོ་ ཞེས་ དངོས་པོ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of a ground says, ‘Form is groundless.’
bo: གཟུགས་ གནས་ མེད་པ་ -འོ་ ཞེས་ གནས་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on emptiness says, ‘Form is empty.’
bo: གཟུགས་ སྟོང་པ་ -འོ་ ཞེས་ སྟོང་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on signlessness says, ‘Form lacks conceptual signs.’
bo: གཟུགས་ མཚན་མ་ མེད་པ་ -འོ་ ཞེས་ མཚན་མ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on wishlessness says, ‘Form lacks wishfulness.’
bo: གཟུགས་ སྨོན་པ་ མེད་པ་ -འོ་ ཞེས་ སྨོན་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of conditioning says, ‘Form lack conditioning.’
bo: གཟུགས་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ -འོ་ ཞེས་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on nonarising says, ‘Form is unarisen.’
bo: གཟུགས་ མ་ སྐྱེས་པ་ -འོ་ ཞེས་ མ་ སྐྱེས་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of birth says, ‘Form is without arising.’
bo: གཟུགས་ སྐྱེས་བ་ མེད་པ་ -འོ་ ཞེས་ སྐྱེ་བ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on the lack of a nature in the beginning says, ‘Form is natureless in the beginning.’
bo: གཟུགས་ སྔོན་ གྱི་ མཐའ་ -ར་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ཞེས་ སྔོན་ གྱི་ མཐའ་ -ར་ ངོ་བོ་ ཉིད་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of a nature in the end says, ‘Form is natureless in the end.’
bo: གཟུགས་ ཕྱི་མ་ -འི་ མཐའ་ -ར་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ཞེས་ ཕྱི་མ་ -འི་ མཐའ་ -ར་ ངོ་བོ་ ཉིད་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of a nature in the meantime says, ‘Form is natureless in the meantime.’
bo: གཟུགས་ བར་ དུ་ ངོ་བོ་ ཉིད་ མེད་པ་ -འོ་ ཞེས་ བར་ དུ་ ངོ་བོ་ ཉིད་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on peace says, ‘Form is peace.’
bo: གཟུགས་ བར་ དུ་ ཞི་བ་ -འོ་ ཞེས་ བར་ དུ་ ཞི་བ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on pacification says, ‘Form is pacified.’
bo: གཟུགས་ ཉེ་བར་ ཞི་བ་ -ར་ ཞི་བ་ -འོ་ ཞེས་ ཉེ་བར་ ཞི་བ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of movement says, ‘Form is unmoving.’
bo: གཟུགས་ རྒྱུ་བ་ མེད་པ་ -འོ་ ཞེས་ རྒྱུ་བ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of elaboration says, ‘Form is without elaboration.’
bo: གཟུགས་ སྤྲོས་པ་ མེད་པ་ -འོ་ ཞེས་ སྤྲོས་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on inconceivability says, ‘Form is inconceivable.’
bo: གཟུགས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ཞེས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being incomparable says, ‘Form is incomparable.’
bo: གཟུགས་ མཚུངས་པ་ མེད་པ་ -འོ་ ཞེས་ མཚུངས་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on the lack of a self says, ‘Form is devoid of a self.’
bo: གཟུགས་ བདག་མེད་པ་ -འོ་ ཞེས་ བདག་མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of sentient beings says, ‘Form is devoid of sentient beings.’
bo: གཟུགས་ སེམས་ཅན་ མེད་པ་ -འོ་ ཞེས་ སེམས་ཅན་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on life says, ‘Form is devoid of life.’
bo: གཟུགས་ སྲོག་མེད་པ་ -འོ་ ཞེས་ སྲོག་མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on vitality says, ‘Form is devoid of vitality.’
bo: གཟུགས་ གསོ་བ་ མེད་པ་ -འོ་ ཞེས་ གསོ་བ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on individuals says, ‘Form is devoid of individuals.’
bo: གཟུགས་ གང་ཟག་ མེད་པ་ -འོ་ ཞེས་ གང་ཟག་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the inanimate says, ‘Form is inanimate.’
bo: གཟུགས་ བེམས་པོ་ -འོ་ ཞེས་ བེམས་པོ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of mobility says, ‘Form is devoid of mobility.’
bo: གཟུགས་ གཡོ་བ་ མེད་པ་ -འོ་ ཞེས་ གཡོ་བ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the lack of agency says, ‘Form is devoid of agency.’
bo: གཟུགས་ བྱེད་པ་ མེད་པ་ -འོ་ ཞེས་ བྱེད་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on likeness to grass, walls, trees, dirt, and optical illusions says, ‘Forms are like grass, walls, trees, dirt, and optical illusions.’
bo: གཟུགས་ རྩྭ་ དང་ ། རྩིག་པ་ དང་ ། ཤིང་ དང་ ། བོང་བ་ དང་ ། མིག་ཡོར་ ལྟ་བུ་ -འོ་ ཞེས་ རྩྭ་ དང་ ། རྩིག་པ་ དང་ ། ཤིང་ དང་ ། བོང་བ་ དང་ ། མིག་ཡོར་ ལྟ་བུ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on having the character of being established says, ‘Form has the character of being established.’
bo: གཟུགས་ རྣམ་པ་ -ར་ བསྒྲུབས་པ་ -འི་ མཚན་ཉིད་ དོ་ ཞེས་ རྣམ་པ་ -ར་ བསྒྲུབས་པ་ -འི་ མཚན་ཉིད་ དུ་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on coming about from the four great elements says, ‘Form comes about from the four great elements.’
bo: གཟུགས་ འབྱུང་བ་ ཆེན་པོ་ བཞི་ ལས་ གྱུར་པ་ -འོ་ ཞེས་ འབྱུང་བ་ ཆེན་པོ་ བཞི་ ལས་ གྱུར་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of sound says, ‘Form is soundless.’
bo: གཟུགས་ སྒྲ་མེད་པ་ -འོ་ ཞེས་ སྒྲ་མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on noncognition says, ‘Form is not cognition.’
bo: གཟུགས་ རྣམ་པ་ -ར་ རིག་པ་ མ་ཡིན་པ་ -འོ་ ཞེས་ རྣམ་པ་ -ར་ རིག་པ་ མ་ཡིན་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being inexpressible says, ‘Form is inexpressible.’
bo: གཟུགས་ བརྗོད་ དུ་ མེད་པ་ -འོ་ ཞེས་ བརྗོད་ དུ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on inherent purity says, ‘Form is inherently pure.’
bo: གཟུགས་ རང་ གི་ ངང་ གིས་ ཡོངས་སུ་ དག་པ་ -འོ་ ཞེས་ རང་ གི་ ངང་ གིས་ ཡོངས་སུ་ དག་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on dependent arising says, ‘Form is dependently arisen.’
bo: གཟུགས་ རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ -འོ་ ཞེས་ རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on the absence of annihilation says, ‘Form is without annihilation.’
bo: གཟུགས་ ཆད་པ་ མེད་པ་ -འོ་ ཞེས་ ཆད་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of permanence says, ‘Form has no permanence.’
bo: གཟུགས་ རྟག་པ་ མེད་པ་ -འོ་ ཞེས་ རྟག་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of a creator says, ‘Form has no creator.’
bo: གཟུགས་ བྱེད་པ་པོ་ མེད་པ་ -འོ་ ཞེས་ བྱེད་པ་པོ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of an experiencer says, ‘Form has no experiencer.’
bo: གཟུགས་ ཚོར་བ་པོ་ མེད་པ་ -འོ་ ཞེས་ ཚོར་བ་པོ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being produced by the maturation of actions says, ‘Form has been produced by the maturation of actions.’
bo: གཟུགས་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ གྲུབ་པ་ -འོ་ ཞེས་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ གྲུབ་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being equal to the realm of phenomena says, ‘Form is equal to the realm of phenomena.’
bo: གཟུགས་ ཆོས་ ཀྱི་ དབྱིངས་ དང་ མཉམ་པ་ -འོ་ ཞེས་ ཆོས་ ཀྱི་ དབྱིངས་ དང་ མཉམ་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on abiding in suchness says, ‘Form abides in suchness.’
bo: གཟུགས་ དེ་བཞིན་ཉིད་ ལ་ རབ་ཏུ་ གནས་པ་ -འོ་ ཞེས་ དེ་བཞིན་ཉིད་ ལ་ རབ་ཏུ་ གནས་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on abiding at the limit of reality says, ‘Form abides at the limit of reality.’
bo: གཟུགས་ ཡང་དག་པ་ -འི་ མཐའ་ ལ་ རབ་ཏུ་ གནས་པ་ -འོ་ ཞེས་ ཡང་དག་པ་ -འི་ མཐའ་ ལ་ རབ་ཏུ་ གནས་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of mineness says, ‘Form has nothing that is mine.’
bo: གཟུགས་ ང་ -འི་བ་ མེད་པ་ -འོ་ ཞེས་ ང་ -འི་བ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the absence of apprehending says, ‘Form is without apprehending.’
bo: གཟུགས་ ཡོངས་སུ་ འཛིན་པ་ མེད་པ་ -འོ་ ཞེས་ ཡོངས་སུ་ འཛིན་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being endless says, ‘Form is endless.’
bo: གཟུགས་ ཟིན་པ་ མེད་པ་ -འོ་ ཞེས་ ཟིན་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: “The teaching on being inconceivable says, ‘Form is inconceivable.’
bo: གཟུགས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འོ་ ཞེས་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on being incomparable says, ‘Form is incomparable.’
bo: གཟུགས་ མཚུངས་པ་ མེད་པ་ -འོ་ ཞེས་ མཚུངས་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on immeasurability says, ‘Form is immeasurable.’
bo: གཟུགས་ ཚད་ མེད་པ་ -འོ་ ཞེས་ ཚད་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on infinity says, ‘Form is infinite.’
bo: གཟུགས་ ཐུག་པ་ མེད་པ་ -འོ་ ཞེས་ ཐུག་པ་ མེད་པ་ -ར་ བསྟན་པ་ མི་ཟད་པ་ དང་ །

source: The teaching on the nature of awakening says, ‘Form is of the nature of awakening.’
bo: གཟུགས་ བྱང་ཆུབ་ ཀྱི་ རང་བཞིན་ ནོ་ ཞེས་ བྱང་ཆུབ་ ཀྱི་ རང་བཞིན་ དུ་ བསྟན་པ་ མི་ཟད་པ་ དང་ །
