Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “Then the Blessed Tathāgata Sandalwood Dwelling manifested great compassion through his skill in means and said to the monks,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ ཐབས་མཁས་པ་ -ས་ ཐུགས་རྗེ་ ཆེན་པོ་ མངོན་དུ་ མཛད་ ནས་ དགེ་སློང་ རྣམས་ ལ་ བཀའ་ སྩལ་པ་ །

source: ‘Monks! Since the time has come for me to pass into nirvāṇa, I will now pass into nirvāṇa.’
bo: དགེ་སློང་ དག་ ང་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -འི་ དུས་ ལ་ བབ་ ཀྱིས་ དེང་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ བྱ་ -འོ་ ། །

source: Thereupon the Blessed Tathāgata Sandalwood Dwelling entered the absorption called indefatigable by seeing with great compassion and displayed passing into nirvāṇa.
bo: !་ -དེ་ནས་ བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཐུགས་རྗེ་ ཆེན་པོ་ ལ་ ལྟ་བ་ -ས་ ཡོངས་སུ་ སྐྱོ་བ་ ཞེས་ བྱ་བ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ ཞུགས་ ནས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ བསྟན་ ཏོ་ ། །

source: “After passing into nirvāṇa, his relics were distributed.
bo: དེ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་ ནས་ སྐུ་གདུང་ ནི་ རྒྱས་པ་ -ར་ གྱུར་ ཏེ་ །

source: His sacred Dharma remained for eight times eighty-four thousand years.
bo: དེ་ -འི་ དམ་པ་ -འི་ ཆོས་ ནི་ ལོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ཕྲག་ བརྒྱད་ དུ་ གནས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: While his sacred Dharma was present, moreover, many beings received it, and no counterfeit Dharma appeared.
bo: དེ་ -འི་ དམ་པ་ -འི་ ཆོས་ གནས་པ་ ཡང་ སྐྱེ་བོ་ མང་པོ་ -ས་ ཐོབ་པ་ -ར་ གྱུར་ ཏེ་ ། དེ་ -འི་ དམ་པ་ -འི་ ཆོས་ ལྟར་ བཅོས་པ་ གང་ཡང་ མེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: Through the cultivation of the power of meditative absorption and miraculous blessing, that blessed one remained unmanifest for eighty-four thousand eons.
bo: བཅོམ་ལྡན་འདས་ དེ་ ཏིང་ངེ་འཛིན་ གྱི་ སྟོབས་ བསྐྱེད་པ་ དང་ ། རྫུ་འཕྲུལ་ གྱི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ བསྐལ་པ་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ རྩ་ བཞི་ -ར་ སྐུ་ མི་སྣང་བ་ -ར་ གནས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “Thus, when eighty-four thousand eons had passed, that being among the gods in the Sphere of neither Perception nor Nonperception died and was reborn in the human realm in the family of a merchant.
bo: དེ་ལྟར་ བསྐལ་པ་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ རྩ་ བཞི་པོ་ དེ་དག་ འདས་ ནས་ སེམས་ཅན་ དེ་ འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ མིན་ སྐྱེ་མཆེད་ ཀྱི་ ལྷ་ རྣམས་ ཀྱི་ ནང་ ནས་ ཤི་འཕོས་ ཏེ་ ། མི་ -འི་ འཇིག་རྟེན་ དུ་ ཚོང་དཔོན་ ཞིག་ གི་ རིགས་ སུ་ སྐྱེས་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: When he reached the age of eight, the Blessed Tathāgata Sandalwood Dwelling rose from his absorption that had lasted eighty-four thousand eons.
bo: ཁྱེའུ་ དེ་ གང་ གི་ ཚེ་ལོ་ བརྒྱད་ ལོན་པ་ -ར་ གྱུར་པ་ དེ་ -འི་ ཚེ་ བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ བསྐལ་པ་ སྟོང་ཕྲག་ བརྒྱད་ཅུ་ རྩ་ བཞི་ འདས་ ནས་ ཏིང་ངེ་འཛིན་ དེ་ལས་ བཞེངས་ ཏེ་ །

source: He came before the youth in the form of a buddha, invisible to everyone else except the youth.
bo: ཁྱེའུ་ དེ་ -འི་ མདུན་ དུ་ སངས་རྒྱས་ ཀྱི་ ཁ་དོག་ དང་ ། གཟུགས་ ཀྱིས་ བཞུགས་ ནས་ ཁྱེའུ་ དེ་ མ་གཏོགས་པ་ -ར་ གཞན་ གང་ གིས་ ཀྱང་ དེ་ མ་ མཐོང་ སྟེ་ །

source: “This caused the youth to firmly make up his mind to generate the thought of unsurpassed perfect awakening and not be turned back from unsurpassed perfect awakening. The Buddha proceeded to teach the Dharma to the youth, beginning with the Great Vehicle.
bo: དེ་ -ས་ ཅི་ ནས་ ཀྱང་ ཁྱེའུ་ དེ་ སེམས་ཐག་པ་ ནས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དེ་ ། བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ལས་ ཕྱིར་ མི་ ལྡོག་པ་ -ར་ འགྱུར་བ་ དེ་ལྟར་ ཐེག་པ་ ཆེན་པོ་ འདི་ ལས་ བརྩམས་ ཏེ་ ཁྱེའུ་ དེ་ ལ་ ཆོས་ བསྟན་ ཏོ་ ། །

source: He also delivered teachings about the faults of desire.
bo: འདོད་པ་ -འི་ ཉེས་པ་ -འི་ གཏམ་ ཡང་ཡང་ དག་པ་ -ར་ བཤད་ དོ་ ། །

source: The Blessed One understood the perfect special intention of the youth and predicted that the youth would completely awaken to unsurpassed perfect awakening after seventy-two times one hundred thousand countless eons.
bo: བཅོམ་ལྡན་འདས་ དེ་ -ས་ དེ་ ལྷག་པ་ -འི་ བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ -ར་ རིག་ ནས་ ལྷ་ -འི་ བུ་ དག་ ཁྱེའུ་ འདི་ བསྐལ་པ་ གྲངས་མེད་པ་ བརྒྱ་ སྟོང་ཕྲག་ བདུན་ཅུ་ རྩ་ གཉིས་ ན་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་ རྒྱ་ སྟེ

source: He would emerge in the world as the Tathāgata Supreme Precious One.
bo: དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཆོག་ ཅེས་བྱ་བ་ -ར་ འཇིག་རྟེན་ དུ་ འབྱུང་ ངོ་ ཞེས་ ལུང་བསྟན་ ཏོ་ ། །

source: No human being but the youth himself heard this prophecy.
bo: དེ་ -འི་ ལུང་བསྟན་པ་ དེ་ ནི་ ཁྱེའུ་ དེ་ མ་གཏོགས་པ་ -ར་ མི་ -ར་ གྱུར་པ་ གང་ གིས་ ཀྱང་ མ་ ཐོས་ སོ་ ། །

source: Twelve thousand gods who were worthy heard it and generated the thought of unsurpassed perfect awakening.
bo: ལྷ་ -འི་ བུ་སྣོད་ དུ་ གྱུར་པ་ སྟོང་ཕྲག་ བཅུ་གཉིས་ ཀྱིས་ དེ་ -འི་ ལུང་བསྟན་པ་ དེ་ ཐོས་ ནས་ ། བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་ སྐྱེད་པ་ -ར་ གྱུར་ ཏེ་ །

source: They also made an aspiration prayer saying, ‘When the Blessed Tathāgata called Supreme Precious One finds awakening, may we be born in his buddhafield at that time!’
bo: འདི་སྐད་ དུ་ ། གང་ གི་ ཚེ་ བཅོམ་ལྡན་འདས་ རིན་ཆེན་ མཆོག་ དེ་བཞིན་ གཤེགས་པ་ དེ་ -ས་ བྱང་ཆུབ་ བརྙེས་པ་ -ར་ གྱུར་པ་ དེ་ -འི་ ཚེ་ བདག་ཅག་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ -ར་ སྐྱེ་བ་ -ར་ ཤོག་ ཤིག་ ཅེས་ སྨོན་ལམ་ ཡང་ བཏབ་བོ་ ། །

source: “In order for them all to be born into that buddhafield, the Blessed One predicted, ‘The Tathāgata Supreme Precious One will predict your unsurpassed perfect awakening!’
bo: བཅོམ་ལྡན་འདས་ དེ་ -ས་ དེ་དག་ ཐམས་ཅད་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ -ར་ སྐྱེ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཆོག་ དེ་ ཁྱོད་ ལ་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ ལུང་སྟོན་པ་ -ར་ འགྱུར་ རོ་ ཞེས་ ལུང་བསྟན་ ཏོ་ ། །

source: Thereupon, the Blessed Tathāgata Sandalwood Dwelling, having prophesied those bodhisattvas, completely passed into nirvāṇa, and the gods honored his relics.
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཙན་དན་ ཁྱིམ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ -ས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ལུང་བསྟན་ ནས་ དེ་ -འི་ འོག་ ཏུ་ ཤིན་ཏུ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -ས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -ར་ གྱུར་ ཏོ་ ། ། དེ་ -འི་ སྐུ་གདུང་ ནི་ ལྷ་ རྣམས་ ཀྱིས་ མཆོད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: “Son of noble family, the blessed buddhas are endowed with such compassion, which does not exist on the level of the śrāvakas or pratyekabuddhas.
bo: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ནི་ གང་ ན་ ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ ས་ མེད་པ་ དེ་ལྟ་ བུ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ དང་ ལྡན་ ནོ་ ། །

source: Son of noble family, just as the blessed buddhas do not interrupt the continuity of the lineage of the buddhas, likewise, the roots of virtue of those who offer to the buddhas will also be uninterrupted until they pass into nirvāṇa, because causes do not perish.”
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཇི་ལྟར་ སངས་རྒྱས་ ཀྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ དེ་ལྟར་ གང་དག་ སངས་རྒྱས་ རྣམས་ ལ་ ཡོན་ འབུལ་བ་ དེ་དག་ གིས་ དགེ་བ་ -འི་ རྩ་བ་ དེ་ཡང་ ཡོངས་སུ་ མྱ་ངན་ ལས་མ་ འདས་ ཀྱི་ བར་ དུ་ རྒྱུན་ མི་ འཆད་ དེརྒྱུ་ ཆུད་ མི་ ཟ་བ་ -འི་ ཕྱིར་ རོ་ ། །

source: When he had delivered this discourse on great tathāgata compassion, among the assembly, as many beings as a third of the number of grains of sand in the river Ganges generated the thought of unsurpassed perfect awakening.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ འཁོར་ དེ་ལས་ སེམས་ཅན་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ -འི་ སུམ་ཆ་ སྙེད་ ཀྱིས་ ནི་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: As many bodhisattvas as half the number of grains of sand in the river Ganges attained willing acceptance.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ -འི་ ཕྱེད་ སྙེད་ ཀྱིས་ ནི་ རྗེས་སུ་ འཐུན་པ་ -འི་ བཟོད་པ་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: And as many bodhisattvas as the number of grains of sand in the river Ganges attained the sixteen kinds of great compassion.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ -འི་ སྙེད་ ཀྱིས་ ནི་ སྙིང་རྗེ་ ཆེན་པོ་ རྣམ་པ་ བཅུ་དྲུག་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: They also attained acceptance of reality, which was endowed with the empowerment of all the Buddha’s teachings.
bo: སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ དབང་ བསྐུར་བ་ དང་ ལྡན་པ་ -འི་ ཆོས་ ཀྱི་ བཟོད་པ་ ཡང་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: At that time, all in the assembly who had heard this teaching became content, pleased, delighted, and overjoyed.
bo: དེ་ནས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ འཁོར་ དེ་ -ས་ བསྟན་པ་ འདི་ ཐོས་ ནས་ ཚིམ་ ཞིང་ མགུ་ ལ་ ཡི་ རངས་ ཤིང་ རབ་ཏུ་ དགའ་ སྟེ་ །

source: Feeling joyful and happy, everyone hailed the Blessed One with the words “Very good!” and honored him with offerings both human and divine.
bo: དགའ་བ་ དང་ ཡིད་ བདེ་བ་ སྐྱེས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ ལེགས་ སོ་ ཞེས་ བྱ་བ་ གསོལ་ ཏེ་ ། ལྷ་ དང་ མི་ -འི་ མཆོད་པ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་ དོ་ །། །།

source: At that point, the Blessed One said to Dhāraṇīśvara­rāja, “Son of noble family, you may ask, ‘What are the actions of the tathāgatas?’
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ བཀའ་ སྩལ་པ་ ། རིགས་ ཀྱི་ བུ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལས་ གང་ཞེ་ན་ །

source: There are thirty-two tathāgata actions. What are these actions?
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལས་ ནི་ སུམ་ཅུ་རྩ་གཉིས་པོ་ འདི་དག་ གོ་ ། ། སུམ་ཅུ་རྩ་གཉིས་ གང་ཞེ་ན་ །

source: “Son of noble family, the tathāgatas know with their unsurpassed wisdom and in accordance with reality what is possible and what is impossible.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡེ་ཤེས་ བླ་ ན་ མེད་པ་ -ས་ གནས་ ལ་ ཡང་ གནས་ སུ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། གནས་མ་ ཡིན་པ་ ལ་ ཡང་ གནས་མ་ ཡིན་པ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, son of noble family, what is possible and what is impossible?
bo: རིགས་ ཀྱི་ བུ་ དེ་ ལ་ གནས་ ནི་ གང་ ། གནས་མ་ ཡིན་པ་ ནི་ གང་ཞེ་ན་ །

source: That the maturation of wrongful conduct of body, speech, and mind will be desirable, pleasant, delightful, or attractive is impossible.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ནི་ གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ ལུས་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ དང་ ། ངག་ གིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ དང་ ། ཡིད་ ཀྱིས་ ཉེས་པ་ -ར་ སྤྱད་པ་ -འི་ རྣམ་པ་ -ར་ སྨིན་པ་ འདོད་པ་ དང་ ། སྡུག་པ་ དང་ ། དགའ་བ་ དང་ ། ཡིད་ དུ་ འོང་བ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That the maturation of good conduct of body, speech, and mind will be desirable, pleasant, delightful, and attractive is possible.
bo: འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་པ་ སྟེ་ ། གང་ ལུས་ ཀྱིས་ ལེགས་པ་ -ར་ སྤྱད་པ་ དང་ ། ངག་ གིས་ ལེགས་པ་ -ར་ སྤྱད་པ་ དང་ ། ཡིད་ ཀྱིས་ ལེགས་པ་ -ར་ སྤྱད་པ་ -འི་ རྣམ་པ་ -ར་ སྨིན་པ་ འདོད་པ་ དང་ ། སྡུག་པ་ དང་ ། དགའ་བ་ དང་ ། ཡིད་ དུ་ འོང་བ་ -ར་ འགྱུར་བ་

source: This will happen.
bo: འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: Son of noble family, that one will attain great wealth through greediness, be born as a god or human through flawed moral conduct, become beautiful through ill will, attain realization through laziness, reach certainty through mental distraction, or destroy the karmic traces through flawed insight is impossible.
bo: རིགས་ ཀྱི་ བུ་ གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ སེར་སྣ་ -ས་ ལོངས་སྤྱོད་ ཆེན་པོ་ མངོན་པར་ འགྲུབ་པ་ དང་ ། འཆལ་པ་ -འི་ ཚུལ་ཁྲིམས་ ཀྱིས་ ལྷ་ དང་ མི་ -ར་ སྐྱེ་བ་ དང་ ། གནོད་སེམས་ ཀྱིས་ མཛེས་པ་ -ར་ འགྱུར་བ་ དང་ ། ལེ་ལོ་ -ས་ མངོན་པར་ རྟོགས་པ་ འཐོབ་པ་ དང་ ། ། སེམས་ རྣམ་པ་ -ར་ གཡེངས་པ་ -ས་ ངེས་པར་ གྱུར་པ་ ལ་ འཇུག་པ་ དང་ ། གང་ འཆལ་པ་ -འི་ ཤེས་རབ་ ཀྱིས་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ལེགས་པ་ -ར་ འཇོམས་པ་ -ར་ འགྱུར་བ་ ནི་ གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་དེ་

source: This will not happen.
bo: ནི་ གནས་མ་ ཡིན་ ནོ་ ། །

source: That one will attain great wealth through generosity, be born as a god or human through moral conduct, become beautiful through patience, attain realization through perseverance, reach certainty through concentration, and destroy all the karmic traces through insight is possible. This will happen.
bo: འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་པ་ སྟེ་ ། གང་ སྦྱིན་པ་ -ས་ ལོངས་སྤྱོད་ ཆེན་པོ་ མངོན་པར་ འགྲུབ་པ་ དང་ ། ཚུལ་ཁྲིམས་ ཀྱིས་ ལྷ་ དང་ མི་ -ར་ སྐྱེ་བ་ དང་ ། བཟོད་པ་ -ས་ མཛེས་པ་ -ར་ འགྱུར་བ་ དང་ ། བརྩོན་འགྲུས་ ཀྱིས་ མངོན་པར་ རྟོགས་པ་ འཐོབ་པ་ དང་ ། བསམ་གཏན་ གྱིས་ ངེས་པར་ གྱུར་པ་ ལ་ འཇུག་པ་ དང་ ། གང་ ཤེས་རབ་ ཀྱིས་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ཐམས་ཅད་ ལེགས་པ་ -ར་ འཇོམས་པ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: “That the mind of someone who performs the acts of immediate retribution will be at ease is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ མཚམས་མེད་པ་ བྱེད་པ་ སེམས་ གནས་པ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That the mind of someone with pure moral conduct will be at ease is possible. This will happen.
bo: གང་ ཚུལ་ཁྲིམས་ རྣམ་པ་ -ར་ དག་པ་ -འི་ སེམས་ གནས་པ་ -ར་ འགྱུར་བ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That one will attain willing acceptance while being involved with objective references is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ དམིགས་པ་ ཅན་ གྱིས་ རྗེས་སུ་ འཐུན་པ་ -འི་ བཟོད་པ་ འཐོབ་པ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: དེ་ ནི་ གནས་ མེད་ དོ་ ། །

source: That one will attain acceptance through devotion to emptiness is possible. This will happen.
bo: གང་སྟོང་པ་ ཉིད་ ལ་མོ་ -ས་པ་ -ས་ བཟོད་པ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That the mind will become pliant while in a state of regret is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ འགྱོད་པ་ ལ་ རབ་ཏུ་ གནས་པ་ -ས་ སེམས་ ཤིན་ཏུ་ སྦྱངས་པ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That a mind free of agitation will become pliant is possible. This will happen.
bo: གང་ ཀུན་ ནས་ ལྡང་བ་ མེད་པ་ -འི་ སེམས་ ཤིན་ཏུ་ སྦྱངས་པ་ -ར་ འགྱུར་བ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That a universal monarch, Śakra, Brahmā, or a buddha will appear in the world in a female body is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ བུད་མེད་ ཀྱི་ ལུས་ དེ་ཉིད་ ཀྱིས་ འཁོར་ལོ་ -ས་ སྒྱུར་བ་ -འི་ རྒྱལ་པོ་ -འམ་ ། བརྒྱ་བྱིན་ ནམ་ ། ཚངས་པ་ -འམ་ ། སངས་རྒྱས་ སུ་ འཇིག་རྟེན་ དུ་ འབྱུང་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That someone will appear in the world as a universal monarch, Śakra, Brahmā, or a buddha after she has exchanged her female body is possible.
bo: འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དེ་ ། གང་ བུད་མེད་ ཀྱི་ ལུས་ བརྗེས་ ནས་ འཁོར་ལོ་ -ས་ སྒྱུར་བ་ -འི་ རྒྱལ་པོ་ -འམ་ ། བརྒྱ་བྱིན་ ནམ་ ། ཚངས་པ་ -འམ་ ། སངས་རྒྱས་ སུ་ འཇིག་རྟེན་ དུ་ འབྱུང་བ་

source: This will happen.
bo: འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That someone who is not equal to the universal monarch will govern a kingdom is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ འཁོར་ལོ་ -ས་ སྒྱུར་བ་ -འི་ རྒྱལ་པོ་ མི་མཉམ་པ་ -ས་ རྒྱལ་སྲིད་ བྱེད་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That he who is equal to the universal monarch will govern a kingdom is possible. This will happen.
bo: གང་ མཉམ་པ་ -ས་ བྱེད་པ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: “That a human being from the northern continent of Uttarakuru will descend to lower destinies is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ གྱི་ མི་ ལོག་པ་ -ར་ ལྟུང་བ་ -ར་ འགྲོ་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That such a human will proceed to happy destinies is possible. This will happen.
bo: བདེ་འགྲོ་ -ར་ འགྲོ་བ་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That individuals who kill will enjoy long lives on account of their killing and that they will attain the noble path on account of their wrong views and the wrongful deeds based on them is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ སྲོག་གཅོད་པ་ -འི་ སྐྱེ་དགུ་ གང་ཟག་ སྲོག་གཅོད་པ་ -འི་ རྒྱུས་ ཚེ་རིང་བ་ -ར་ འགྱུར་བ་ ནས་ ། ལོག་པ་ -ར་ ལྟ་བ་ དག་ ལོག་པ་ -ར་ ལྟ་བ་ ཅན་ ལོག་པ་ -འི་ ལས་ ཡང་དག་པ་ -ར་ བླངས་པ་ -འི་ རྒྱུས་ འཕགས་པ་ -འི་ ལམ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ -འི་ བར་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That someone with a long life on account of abandoning killing will attain the noble path through correct views is possible.
bo: འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དེ་ ། གང་ སྲོག་གཅོད་པ་ སྤངས་པ་ -འི་ རྒྱུས་ ཚེ་རིང་བ་ -ར་ འགྱུར་བ་ ནས་ ། ཡང་དག་པ་ -ར་ ལྟ་བ་ འཕགས་པ་ -འི་ ལམ་ འཐོབ་པ་ -ར་ འགྱུར་བ་ -འི་ བར་

source: This will happen.
bo: འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: “That one will find deliverance without attaining the fruition of the eight paths is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ བརྒྱད་པ་ འབྲས་བུ་ མ་ ཐོབ་པ་ -ར་ ལྡང་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That one will find deliverance once one has attained their fruition is possible. This will happen.
bo: གང་ འབྲས་བུ་ ཐོབ་ ནས་ ལྡང་བ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That a stream enterer will actualize an eighth existence is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ རྒྱུན་ དུ་ ཞུགས་པ་ སྲིད་པ་ བརྒྱད་པ་ མངོན་པར་ འགྲུབ་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That a stream enterer will enter a seventh existence even though there are obstacles is possible.
bo: གང་ རེ་ལྟར་ ཐོགས་ ཀྱང་ སྲིད་པ་ བདུན་ དུ་ འགྱུར་བ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That a once-returner will actualize a second existence is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ ལན་ཅིག་ ཕྱིར་ འོང་བ་ སྲིད་པ་ གཉིས་པ་ མངོན་པར་ འགྲུབ་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That a once-returner will reach the end of suffering after having returned to this world is possible. This will happen.
bo: གང་ ལན་ཅིག་ ཕྱིར་ འོང་བ་ འཇིག་རྟེན་ འདི་ -ར་ འོངས་ ནས་ སྡུག་བསྔལ་ མཐའ་ -ར་ འབྱིན་པ་ -ར་ བྱེད་པ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That a non-returner will return to this world is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ ཕྱིར་ མི་ འོང་བ་ འཇིག་རྟེན་ འདི་ -ར་ འོང་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That a non-returner will transcend suffering completely is possible. This will happen.
bo: གང་དེ་ ཉིད་ དུ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That an arhat will enter a new existence is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ དགྲ་བཅོམ་པ་ ཉིང་མཚམས་ སྦྱོར་བ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That an arhat will not enter a new existence is possible. This will happen.
bo: གང་ དགྲ་བཅོམ་པ་ ཉིང་མཚམས་ སྦྱོར་བ་ མེད་པ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: “That a noble being will accept the instructions of another teacher is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ འཕགས་པ་ -འི་ གང་ཟག་ སྟོན་པ་ གཞན་ གྱི་ ལུང་ ནོད་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That such a being will have no other deity is possible.
bo: གང་ ལྷ་ གཞན་ མེད་པ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། ། གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ །

source: That a bodhisattva who accepts the unborn nature of phenomena will regress is impossible.
bo: གང་ མི་ སྐྱེ་བ་ -འི་ ཆོས་ ལ་ བཟོད་པ་ རབ་ཏུ་ ཐོབ་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕྱིར་ ལྡོག་པ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That such a bodhisattva will awaken to complete and perfect awakening is possible.
bo: གང་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That a bodhisattva who dwells on the seat of awakening will arise without completely and perfectly awakening is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ ལ་ འདུག་ ནས་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་ མ་ རྒྱས་པ་ -ར་ ལྡང་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That such a bodhisattva will arise as one awakened to complete and perfect awakening is possible.
bo: གང་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ནས་ ལྡང་བ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: “That karmic traces will appear for tathāgatas is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ ལ་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ སྣང་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That tathāgatas will have destroyed all karmic traces is possible. This will happen.
bo: གང་དེ་ བཞིན་ གཤེགས་པ་ བག་ཆགས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་པ་ འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དོ་ ། །

source: That the wisdom of tathāgatas will be obstructed is impossible.
bo: གནས་མ་ ཡིན་ ཏེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ ཐོགས་པ་ -ར་ འགྱུར་བ་ འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That the wisdom of tathāgatas will be unobstructed is possible.
bo: གང་དེ་ བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ ཐོགས་པ་ མེད་པ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That the crown protuberances of tathāgatas will be visible is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ -འི་ སྤྱི་གཙུག་ མཐོང་བ་ -ར་ འགྱུར་བ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That the crown protuberances of tathāgatas will be invisible is possible.
bo: གང་དེ་ བཞིན་ གཤེགས་པ་ -འི་ སྤྱི་གཙུག་ བལྟ་ -ར་ མི་ མཐོང་བ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That one will know the activity of tathāgatas’ minds through means other than the power of buddhas is impossible.
bo: གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། གང་ སངས་རྒྱས་ ཀྱི་ མཐུ་ མ་གཏོགས་པ་ -ར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ ཀྱི་ རྒྱུ་བ་ ཤེས་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That one will not know it is possible.
bo: གང་ མི་ ཤེས་པ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That the minds of tathāgatas will not be in equipoise and will have reference points is impossible.
bo: གནས་མ་ ཡིན་ ཏེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ ལ་ སེམས་ མཉམ་པ་ -ར་ མ་ བཞག་པ་ དམིགས་པ་ འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That tathāgatas will be in constant equipoise is possible.
bo: གང་དེ་ བཞིན་ གཤེགས་པ་ རྟག་ ཏུ་ མཉམ་པ་ -ར་ གཞག་པ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: That untrue words will issue from tathāgatas is impossible.
bo: འདི་ ནི་ གནས་མ་ ཡིན་ ཏེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ ལ་ ལོག་པ་ -འི་ ཚིག་ འབྱུང་བ་ འདི་ ནི་ གནས་མ་ ཡིན་ ནོ་ ། །

source: That true words will issue is possible.
bo: གང་ བདེན་པ་ -འི་ ཚིག་ འབྱུང་བ་ འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: “Son of noble family, that deluded objective reference will exist for tathāgatas is impossible.
bo: རིགས་ ཀྱི་ བུ་ གནས་མ་ ཡིན་ ཞིང་ གོ་སྐབས་ མེད་ དེ་ ། དེ་བཞིན་ གཤེགས་པ་ ལ་ འཁྲུལ་པ་ དམིགས་པ་

source: This will not happen.
bo: འདི་ ནི་ གནས་ མེད་ དོ་ ། །

source: That delusion will not exist for tathāgatas is possible.
bo: འདི་ ནི་ གནས་ ཡིན་ ཞིང་ གོ་སྐབས་ ཡོད་ དེ་ ། གང་དེ་ བཞིན་ གཤེགས་པ་ ལ་ འཁྲུལ་པ་ མེད་པ་

source: This will happen.
bo: འདི་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: Son of noble family, words cannot illustrate the scope of the Tathāgata’s power of knowing what is possible and what is impossible.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ གང་དེ་ བཞིན་ གཤེགས་པ་ -འི་ གནས་ དང་ གནས་མ་ ཡིན་པ་ -ར་ མཁྱེན་པ་ -འི་ སྟོབས་ དེ་ ཡི་གེ་ རྣམས་ ཀྱིས་ ཚད་ བསྟན་ དུ་ མེད་ དེ་ཡང་ དག་པ་ -འོ་ ། །

source: It is perfect.
bo: དེ་ ཁོ་ན་ -འོ་ ། །

source: It is unique and like no other.
bo: གཞན་མ་ ཡིན་པ་ ཉིད་ དོ་ ། །

source: About this the following is proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘All earth may crumble,
bo: ས་ ཀུན་ འགྲུམ་པ་ -ར་ འགྱུར་ ཡང་སྲིད་ ། །

source: The sky may tremble,
bo: ནམ་མཁའ་ གཡོ་ བར་ འགྱུར་ སྲིད་ ཀྱི་ ། །

source: But for what the Buddha has explained not to be the case—
bo: སངས་རྒྱས་ གནས་མིན་ བཤད་པ་ ནི་ ། །

source: That will never occur.
bo: གནས་ སུ་ འགྱུར་བ་ མི་ སྲིད་ དོ་ ། །

source: “ ‘Beings may mold space Into five-colored form,
bo: སྐྱེས་བུ་ -ས་ ཁ་དོག་ ལྔ་ ཅན་ དུ་ ། ། ནམ་མཁའ་ གཟུགས་ སུ་ བྱེད་ ཀྱང་ སྲིད་ ། །

source: But for what the Buddha has explained not to be the case—
bo: སངས་རྒྱས་ གནས་མིན་ བཤད་པ་ ནི་ ། །

source: That will never occur.
bo: གནས་ སུ་ འགྱུར་བ་ མི་ སྲིད་ དོ་ ། །

source: To a lesser, middling, or supreme degree—
bo: ཐ་མ་ དང་ ནི་ འབྲིང་ དང་ མཆོག་ །

source: “ ‘All that the Buddha has explained to be the case
bo: གང་དག་ སངས་རྒྱས་ གནས་བཤད་པ་ ། །
