Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: At this point, Dhāraṇīśvara­rāja said to the Blessed One,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ -ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “O Blessed One! How wonderful is this definitive Dharma discourse, which is of excellent meaning, well composed, and well adorned, which delights all bodhisattvas, which overcomes all the hostility of evil ones and adversaries, skillfully embrace all teachings, and satisfies the thoughts of all beings, which emerges as the perfection of all vehicles, and which is vividly taught to those who emulate the qualities of all tathāgatas and to all who apply themselves to it!”
bo: ཀྱེ་མ་ བཅོམ་ལྡན་འདས་ ཇི་ཙམ་ དུ་ རྣམ་པ་ -ར་ ངེས་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ དོན་ བཟང་བ་ དང་ ། ཚིག་འབྲུ་ བཟང་བ་ དང་ ། ལེགས་པ་ -ར་ བརྒྱན་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ མཆོག་ ཏུ་ དགའ་བ་ སྐྱེད་པ་ དང་ ། བདུད་ དང་ ཕ་རོལ་ རྒོལ་བ་ ཐམས་ཅད་ འཇོམས་པ་ དང་ ། ཆོས་ ཐམས་ཅད་ ལ་ མཁས་པ་ -ར་ འཛིན་པ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཚིམ་པ་ -ར་ བགྱིད་པ་ དང་ ། ཐེག་པ་ ཐམས་ཅད་ ཀྱི་ ངེས་པར་ འབྱུང་བ་ -འི་ ཕྱིར་ འབྱུང་བ་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ ཀྱི་ ཡོན་ཏན་ ལ་ འཇུག་པ་ -འི་ རྗེས་སུ་ སོང་བ་ དང་ ། ཐམས་ཅད་ ཀྱིས་ བརྩོན་པ་ -ར་ བགྱི་བ་ ལས་ གཏི་མུག་ མ་ མཆིས་པ་ -ར་ སྟོན་པ་ ངོ་མཚར་ ཏོ་ ། །

source: Then he asked, “Blessed One! What is this Dharma discourse called? How will it be transmitted?”
bo: བཅོམ་ལྡན་འདས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ -འི་ མིང་ ཅི་ ལགས་ ། འདི་ ཇི་ལྟར་ གཟུང་བ་ -ར་ བགྱི་ ། དེ་སྐད་ ཅེས་ གསོལ་པ་ དང་ །

source: The Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Dhāraṇīśvara­rāja, because of your request, you shall transmit this Dharma discourse known as The Explanation of the Great Compassion of the Tathāgata!
bo: དེ་ -འི་ ཕྱིར་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཁྱོད་ ཀྱིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ བསྟན་པ་ ཞེས་ བྱ་བ་ -ར་ ཟུང་ ཤིག་ །

source: You shall transmit it as The Prophecy of Listening to the Meaningful Activity of the Tathāgata!”
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ལས་དོན་ ཡོད་པ་ ཉན་པ་ ལུང་བསྟན་པ་ ཞེས་ བྱ་བ་ -ར་ ཡང་ ཟུང་ ཤིག་ །

source: After the Blessed One had spoken, Dhāraṇīśvara­rāja, together with everyone in the bodhisattva and śrāvaka assemblies, as well as the world with its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནསབྱང་ ཆུབ་ སེམས་དཔའ་ གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ དང་ ། ཉན་ཐོས་ ཀྱི་ ཚོགས་ དེ་དག་ ཐམས་ཅད་ དང་ ། ལྷ་ དང་ ། མི་ དང་ ། ལྷ་མ་ ཡིན་ དང་ ། དྲི་ཟ་ -ར་ བཅས་པ་ -འི་ འཇིག་རྟེན་ ཡི་ རངས་ ཏེ་ ། བཅོམ་ལྡན་འདས་ ཀྱིས་ གསུངས་པ་ ལ་ མངོན་པར་ བསྟོད་ དོ་ །། །།

source: This completes the noble Great Vehicle sūtra “The Teaching on the Great Compassion of the Tathāgata.”
bo: འཕགས་པ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ བསྟན་པ་ ཞེས་ བྱ་བ་ ཐེག་པ་ ཆེན་པོ་ -འི་ མདོ་ རྫོགས་ སོ་ །། །།

source: This text was translated and edited by the Indian scholar Śīlendrabodhi and the principal editor-translator, Bandé Yeshé Dé. It was reviewed and finalized in accordance with the new language reforms.
bo: རྒྱ་གར་ གྱི་ མཁན་པོ་ ཤཱི་ ལེན་ དྲ་བོ་ དྷི་ དང་ ། ཞུ་ཆེན་ གྱི་ ལོཙྪ་བ་ བན་དེ་ ཡེ་ཤེས་ སྡེ་ -ས་ བསྒྱུར་ ཅིང་ ཞུས་ ཏེ་ སྐད་ གསའ་ -ར་ ཆད་ ཀྱིས་ ཀྱང་ བཅོ་ -ས་ ནས་ གཏན་ ལ་ ཕབ་པ་ །། །།
