Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: They know the beings who are destined for truth.
bo: ཡང་དག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the beings who are undetermined and the beings who are destined for error.
bo: མ་ངེས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལོག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the beings who are determined.
bo: ངེས་པ་ དང་ བཅས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ དེ་བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: Whether the tathāgatas teach the Dharma to them or not, those beings who have causal capacity and excellent prior engagement, who understand through mere outlines and whose intelligence is sharp, are destined to become liberated.
bo: སེམས་ཅན་ གང་དག་ རྒྱུ་ -འི་ སྟོབས་ ཅན་ ། སྔོན་ གྱི་ སྦྱོར་བ་ ཕུན་སུམ་ ཚོགས་པ་ ། ཟུར་ཙམ་ གྱིས་ གོ་བ་ ། དབང་པོ་ རྣོ་བ་ -འི་ སེམས་ཅན་ དེ་དག་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ བསྟན་ ཀྱང་ རུང་ ། མ་ བསྟན་ ཀྱང་ རུང་ སྟེ་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འི་ སྐལ་བ་ ཡོད་པ་

source: The tathāgatas understand their causal capacity, and, in order to accelerate their liberation, they teach them the Dharma accordingly.
bo: དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སྔོན་ གྱི་ རྒྱུ་ -འི་ སྟོབས་ མཁྱེན་ ནས་ ཅི་ ནས་ དེ་དག་ མྱུར་ དུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ འགྱུར་བ་ དེ་ལྟ་ དེ་ལྟར་ ཆོས་སྟོན་ ཏོ་ ། །

source: “They know the beings who are undetermined.
bo: མ་ངེས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: If they meet an agreeable teaching and instruction, beings who are swayed by conditions and characterized by having to mature will become liberated. But if they do not, then they will not become liberated.
bo: གང་དག་ རྐྱེན་ གྱི་ སྟོབས་ ཅན་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱ་བ་ -འི་ མཚན་ཉིད་ ཀྱི་ སེམས་ཅན་ དེ་དག་ གལ་ཏེ་ འཐུན་པ་ -ར་ འདོམས་ ཤིང་ རྗེས་སུ་ སྟོན་པ་ དང་ ཕྲད་ ན་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ འགྱུར་ གྱི་ མ་ ཕྲད་ ན་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ མི་འགྱུར་བ་

source: To them the tathāgatas deliver discourses on causes and conditions.
bo: དེ་དག་ ལ་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ དེ་ལྟ་ དེ་ལྟར་ རྒྱུ་ དང་ རྐྱེན་ དང་ ལྡན་པ་ -འི་ གཏམ་ ཡང་དག་པ་ -ར་ གསུང་ སྟེ

source: In this way, once they have heard the Dharma from the tathāgatas, they apply themselves accordingly and attain the result.
bo: འདི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ ལས་ དེ་ལྟ་ བུ་ -འི་ ཆོས་ ཐོས་ ནས་ ཚུལ་བཞིན་ རབ་ཏུ་ སྦྱོར་བ་ -ས་ འབྲས་བུ་ ཐོབ་པ་ -ར་ འགྱུར་བ་

source: It is for their sake that the blessed buddhas appear.
bo: དེ་དག་ གི་ དོན་ དུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ འབྱུང་ ངོ་ ། །

source: “They know the beings who are destined for error.
bo: ལོག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ སེམས་ཅན་ གྱི་ ཁམས་ ཀྱང་ དེ་བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: Whether they teach the Dharma to them or not, those beings who have not purified themselves, who are narrow minded, foolish, and unreceptive, are not destined for liberation.
bo: ཡོངས་སུ་ སྦྱོང་བ་ མ་ བྱས་པ་ ། ཁོ་རེ་ ཆུང་བ་ བླུན་པ་ ། སྣོད་ དུ་མ་ གྱུར་པ་ -འི་ སེམས་ཅན་ དེ་དག་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ བསྟན་ ཀྱང་ རུང་ ། ། མ་ བསྟན་ ཀྱང་ རུང་ སྟེ་ སེམས་ཅན་ དེ་དག་ རྣམ་པ་ -ར་ དགྲོལ་བ་ -འི་ སྐལ་བ་ མེད་པ་ -ས་ །

source: The tathāgatas are aware that they are not receptive and thus remain equanimous toward them.
bo: དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ -ས་ སྣོད་ མ་ཡིན་པ་ -ར་ རིག་ ནས་ བཏང་སྙོམས་ སུ་ འཇོག་ སྟེ་ །

source: It is for their sake that the bodhisattvas don their armor.
bo: དེ་དག་ གི་ ཆེད་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ གོ་ཆ་ གྱོན་ ཏོ་ ། །

source: “Son of noble family, the tathāgatas know the three paths of attachment.
bo: རིགས་ ཀྱི་ བུ་ ། གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ འདོད་ཆགས་ ཀྱི་ ལམ་ རྣམ་པ་ གསུམ་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: What are the three?
bo: རྣམ་པ་ གསུམ་ གང་ཞེ་ན་ །

source: They are the path of attachment arising from attraction, the path of attachment arising from clinging, and the path of attachment arising from previous causes.
bo: འདོད་ཆགས་ ཀྱི་ ལམ་ སྡུག་པ་ -འི་ རྣམ་པ་ ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། ། འདོད་ཆགས་ ཀྱི་ ལམ་ རྗེས་སུ་ ཆགས་པ་ -འི་ རྣམ་པ་ ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། འདོད་ཆགས་ ཀྱི་ ལམ་ སྔོན་ གྱི་ རྒྱུ་ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ དོ་ ། །

source: They know the three paths of aversion:
bo: ཞེ་སྡང་ གི་ ལམ་ རྣམ་པ་ -ར་ གསུམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: the path of aversion arising from the cause of anger, the path of aversion arising from unfulfilled wishes, and the path of aversion arising from preexisting latent tendencies.
bo: ཞེ་སྡང་ གི་ ལམ་ ཁོང་ཁྲོ་བ་ -འི་ རྒྱུ་ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། ཞེ་སྡང་ གི་ ལམ་ བསམ་པ་ ཡོངས་སུ་ མ་ རྫོགས་པ་ ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། ཞེ་སྡང་ གི་ ལམ་ སྔོན་ གྱི་ བག་ ལ་ ཉལ་ ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ དོ་ ། །

source: They know the three paths of delusion:
bo: གཏི་མུག་ གི་ ལམ་ རྣམ་པ་ གསུམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏེ་ །

source: the path of delusion arising from the cause of ignorance, the path of delusion arising from the cause of personalistic false views, and the path of delusion arising from the cause of doubt.
bo: གཏི་མུག་ གི་ ལམ་ མ་རིག་པ་ -འི་ རྒྱུ་ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། གཏི་མུག་ གི་ ལམ་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ -འི་ རྒྱུ་ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ ། གཏི་མུག་ གི་ ལམ་ ཐེ་ཚོམ་ གྱི་ རྒྱུ་ལས་ སྐྱེ་བ་ ཡང་ ཡོད་ དེ་ །

source: All these the tathāgatas know.
bo: དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “Moreover, son of noble family, the tathāgatas know the difficult paths that swiftly lead to the superknowledges for those with sharp faculties and the difficult paths that slowly lead to the superknowledges for those with dull faculties.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དབང་པོ་ རྣོ་བ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ མྱུར་ ལ་ དཀའ་བ་ -འི་ ལམ་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དབང་པོ་ རྟུལ་བ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ བུལ་ ལ་ དཀའ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the easy paths that swiftly lead to the superknowledges for those with sharp faculties and the difficult paths that swiftly lead to the superknowledges for those with dull faculties.
bo: དབང་པོ་ རྣོ་བ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ མྱུར་ ལ་ སླ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དབང་པོ་ རྟུལ་བ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ མྱུར་ ལ་ དཀའ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the paths that very slowly lead to the superknowledges because of beings’ loss of focus and the slower paths that may nonetheless swiftly lead to the superknowledges because their continuities are uninterrupted.
bo: དམིགས་པ་ བོར་བ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ བུལ་ ལ་ བུལ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། ལམ་ གྱི་ རྒྱུན་ མ་ བཅད་པ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ མྱུར་ ལ་ བུལ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the swift paths that may nonetheless lead slowly to the superknowledges on account of falling short of final relief and the slow paths that nonetheless lead swiftly to the superknowledges on account of one not being attached to such paths.
bo: ཡོངས་སུ་ ཐུག་པ་ མེད་པ་ -ར་ དབུགས་ འབྱིན་པ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ བུལ་ ལ་ མྱུར་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། དེ་ ལ་མ་ ཆགས་པ་ -འི་ ཕྱིར་ མངོན་པར་ ཤེས་པ་ མྱུར་ ལ་ བུལ་བ་ -འི་ ལམ་ ཡང་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། ། སོ་སོ་ -ར་ རྟོག་པ་ -འི་ སྟོབས་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་ ཀྱི་ སྒོམ་པ་ -འི་ སྟོབས་ ལ་མ་ ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “The tathāgatas know that there are paths where it is not the power of meditation but the power of discrimination that is brought to perfection.
bo: སྒོམ་པ་ -འི་ སྟོབས་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་ ཀྱི་ ། སོ་སོ་ -ར་ རྟོག་པ་ -འི་ སྟོབས་ ལ་མ་ ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that there are paths where it is not the power of discrimination but the power of meditation that is brought to perfection.
bo: སོ་སོ་ -ར་ རྟོག་པ་ -འི་ སྟོབས་ ཀྱང་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ མི་ བྱེད་ ལ་ སྒོམ་པ་ -འི་ སྟོབས་ ལ་ ཡང་ མ་ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that there are paths where neither the power of meditation nor the power of discrimination is brought to perfection.
bo: སོ་སོ་ -ར་ རྟོག་པ་ -འི་ སྟོབས་ དང་ སྒོམ་པ་ -འི་ སྟོབས་ ཀྱང་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that there are paths where both the power of discrimination and the power of meditation are brought to perfection.
bo: བསམ་པ་ ཕུན་སུམ་ ཚོགས་ ལ་ སྦྱོར་བ་ ཕུན་སུམ་ ཚོགས་པ་ མ་ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “The tathāgatas know that there are paths with excellent intention but without excellent application.
bo: སྦྱོར་བ་ ཕུན་སུམ་ ཚོགས་ ལ་ བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ མ་ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know that there are paths without excellent intention but with excellent application.
bo: བསམ་པ་ ཡང་ ཕུན་སུམ་ ཚོགས་པ་ མ་ ཡིན་ ལ་ སྦྱོར་བ་ ཡང་ ཕུན་སུམ་ ཚོགས་པ་ མ་ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ །

source: They know that there are paths without excellent intention or application. They know that there are paths with both excellent intention and application.
bo: བསམ་པ་ ཡང་ ཕུན་སུམ་ ཚོགས་ ལ་ སྦྱོར་བ་ ཡང་ ཕུན་སུམ་ ཚོགས་པ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ ། དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “There are paths where it is neither the speech nor the mind but the body that is purified.
bo: ལུས་ སྦྱོང་ གི་ ། ངག་ ལ་མ་ ཡིན་ ། སེམས་ ལ་མ་ ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ །

source: There are paths where it is neither the body nor the mind but the speech that is purified.
bo: ངག་ སྦྱོང་ གི་ ། ལུས་ ལ་མ་ ཡིན་ ། སེམས་ ལ་མ་ ཡིན་པ་ -འི་ ལམ་ ཡང་ ཡོད་ །

source: There are paths where the body, speech, and mind are all purified.
bo: ལུས་ དང་ ། ངག་ དང་ ། སེམས་ ཀྱང་ སྦྱོང་བ་ -འི་ ལས་ ཡང་ ཡོད་ །

source: There are paths where neither the body nor the speech nor the mind are purified.
bo: ལུས་ ལ་མ་ ཡིན་ ། ངག་ ལ་མ་ ཡིན་ ལ་ ། སེམས་ ཀྱང་ མི་ སྦྱོང་བ་ -འི་ ལམ་ ཡང་ ཡོད་ དེ་ །

source: “In this way, the vision of a tathāgata’s wisdom enters, without obstruction, the full extent of the paths that arise from the causes of the engagements of all sentient beings and from the causes of error.
bo: དེ་ལྟར་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ འཇུག་པ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ དང་ ། ལོག་པ་ -འི་ རྒྱུ་ལས་ བྱུང་བ་ -འི་ ལམ་ གང་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ དུ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ མཐོང་བ་ ཐོགས་པ་ མེད་པ་ འཇུག་ སྟེ

source: This is the sixth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ དྲུག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The sugatas know all the paths and the beings who are destined and have the cause.
bo: བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ ལམ་ ཀུན་ རབ་ཏུ་ མཁྱེན་ ཅིང་ ངེས་ དང་ རྒྱུ་ དང་ བཅས་པ་ -འི་ སེམས་ཅན་ ཁམས་ ཀྱང་ མཁྱེན་ ། །

source: These teachers know the endless kinds of afflictive elements of those characterized as undetermined and as having to mature, Those who are unreceptive and harbor wrong views, and those beset by three kinds of attachment, three kinds of aversion, and the associated ignorance, As well as the causes and conditions for such paths.
bo: མ་ ངེས་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱ་བ་ -འི་ མཚན་ཉིད་ དང་ ནི་ དེ་བཞིན་ སྣོད་ མིན་ལོག་པ་ -ར་ ལྟ་ ལྡན་ དང་ ། ། འདོད་ཆགས་ རྣམ་ གསུམ་ ལམ་ ལྡན་ དག་ དང་ ཞེ་སྡང་ རྣམ་པ་ གསུམ་ དང་ དེ་བཞིན་ གཏི་མུག་ ལྡན་པ་ དང་ ། ། ཉོན་མོངས་ ཁམས་ ཀྱི་ རྣམ་པ་ མཐའ་ཡས་པ་ དང་ ལམ་ གྱི་ རྒྱུ་ དང་ རྐྱེན་ ཀྱང་ སྟོན་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: “ ‘The protectors of the world understand the paths that are difficult for the sharp ones and at the same time slow for those of feeble capacity, And the paths that are easy for the sharp ones and at the same time slow for the others.
bo: རྣོ་བ་ -ར་ གྱུར་ ལ་ དཀའ་བ་ -འི་ ལམ་ དང་ དེ་བཞིན་ དབང་པོ་ རྣམས་ ནི་ ཞན་ ཕྱིར་ བུལ་བ་ -ར་ གྱུར་པ་ དང་ ། ། རྣོ་བ་ -ར་ འགྱུར་ ལ་ སླ་བ་ -འི་ ལམ་ དང་ དེ་བཞིན་ བུལ་བ་ འཇིག་རྟེན་ གྱི་ ནི་ མགོན་པོ་ -ས་ རབ་ཏུ་ མཁྱེན་ ། །

source: there are paths that are slow for the slow witted and at the same time slow for the sharp and pure ones.
bo: བུལ་བ་ -འི་ ལམ་ ལ་ དེ་ ཡི་ བློ་ ཡང་ བུལ་ ཞིང་ དེ་བཞིན་ བུལ་བ་ -ར་ གྱུར་ ལ་ རྣོ་ ཞིང་ དག་པ་ -འང་ ཡོད་ ། །

source: There are paths that are swift for the slow ones and at the same time very swift for those not attached to them.
bo: བུལ་བ་ -ར་ གྱུར་ ལ་ མྱུར་བ་ -འི་ ལམ་ དང་ དེ་བཞིན་ དེ་ ལ་མ་ ཆགས་ ཕྱིར་ ནི་ ཤིན་ཏུ་ མྱུར་བ་ དང་ ། །

source: “ ‘There are paths of meditation that generate discrimination and those that do not.
bo: སོ་སོ་ -ར་ རྟོག་པ་ སྐྱེད་པ་ -ར་ བྱེད་ ཀྱི་ བསྒོམ་པ་ -འི་ ལམ་ ནི་ སྐྱེད་པ་ -ར་ མི་ བྱེད་པ་ ཡི་ ལམ་ ཡང་ ཡོད་ ། །

source: There are those that generate meditation and those that generate both due to having outstanding application.
bo: སྒོམ་པ་ སྐྱེད་པ་ -ར་ བྱེད་ དང་ ཁྱད་པར་ཅན་ གྱི་ སྦྱོར་ དང་ ལྡན་པ་ -ས་ གཉི་ག་ སྐྱེད་པ་ -ར་ བྱེད་པ་ -འང་ ཡོད་ ། །

source: There are paths that purify intention but not application, And there are the paths that engage in both.
bo: བསམ་པ་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ བྱེད་ ཀྱི་ སྦྱོར་བ་ དག་པ་ -ར་ བྱེད་པ་ མ་ཡིན་པ་ ཡི་ ལམ་ ཡང་ ཡོད་ ། ། གཉི་ག་ སྦྱོར་བ་ -ར་ བྱེད་པ་ -འང་ ཡོད་ དེ་དེ་ ཡང་

source: The buddhas, the all-seeing great beings, know that
bo: སངས་རྒྱས་ བདག་ཉིད་ ཆེན་པོ་ ཐམས་ཅད་ གཟིགས་པ་ -ས་ མཁྱེན་ ། །

source: “ ‘There are paths that purify the body but not the speech or the mind,
bo: ལུས་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ བྱེད་ ཀྱི་ ངག་ ལ་མ་ ཡིན་པ་ དང་སེམས་ ཀྱང་ སྦྱོང་བ་ -ར་ མི་ བྱེད་ ཡོད་ ། །

source: Some that purify speech and the body but never the mind,
bo: ཚིག་ དང་ དེ་བཞིན་ ལུས་ ཀྱང་ སྦྱོང་བ་ -ར་ བྱེད་ ཀྱི་ ནམ་ཡང་ སེམས་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ མི་ བྱེད་ དང་ ། །

source: And some that purify the mind but never speech.
bo: སེམས་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ བྱེད་ ཀྱི་ ནམ་ཡང་ ངག་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ མི་ བྱེད་པ་ ཡང་ ཡོད་ ། །

source: “ ‘There are some that purify speech and the mind but never the body, And some that purify both body and mind.
bo: ངག་ དང་ དེ་བཞིན་ སེམས་ ཀྱང་ སྦྱོང་བ་ -ར་ བྱེད་ ཀྱི་ ནམ་ཡང་ ལུས་ ནི་ རྣམ་པ་ -ར་ སྦྱོང་བ་ -ར་ མི་ བྱེད་ དང་ ། ། ལུས་ དང་ དེ་བཞིན་ སེམས་ ཀྱང་ སྦྱོང་བ་ -ར་ བྱེད་པ་ -འི་ ལམ་ དང་

source: As for how they engage or refrain,
bo: ཇི་ལྟར་ འཇུག་པ་ -ར་ འགྱུར་ དང་ ལྡོག་པ་ ཡང་ ། །

source: This knowledge born of seeing wisdom and the mind is the sixth outstanding sugata activity.’
bo: ཡེ་ཤེས་ དང་ ནི་ སེམས་ གཟིགས་པ་ -ས་ མཁྱེན་ འདི་ ཡང་ བདེ་གཤེགས་ འཕྲིན་ལས་ ཁྱད་པར་ འཕགས་པ་ དྲུག་ །

source: “Moreover, son of noble family, the tathāgatas know in accordance with reality the process of pollution, purification, and emergence through concentration, liberation, absorption, and meditation.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བསམ་གཏན་ དང་ ། རྣམ་པ་ -ར་ ཐར་པ་ དང་ ། ཏིང་ངེ་འཛིན་ དང་ ། སྙོམས་པར་ འཇུག་པ་ -འི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ དང་ ། རྣམ་པ་ -ར་ བྱང་བ་ དང་ ། ལྡང་བ་ ཐམས་ཅད་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: You may ask, how do they know it?
bo: ཇི་ལྟར་ རབ་ཏུ་ མཁྱེན་ ཅེ་ན་ །

source: The tathāgatas know the causes and conditions for the arising of sentient beings’ pollution.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ སྐྱེ་བ་ -འི་ རྒྱུ་ གང་ཡིན་པ་ དང་ ། རྐྱེན་ གང་ཡིན་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: They know the causes and conditions for sentient beings’ purification.
bo: སེམས་ཅན་ རྣམས་ རྣམ་པ་ -ར་ དག་པ་ -ར་ འགྱུར་བ་ -འི་ རྒྱུ་ གང་ཡིན་པ་ དང་ ། རྐྱེན་ གང་ཡིན་པ་ དེ་ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: What are causes? What are conditions?
bo: དེ་ ལ་ རྒྱུ་ ནི་ གང་ ། རྐྱེན་ ནི་ གང་ཞེ་ན་ །

source: The cause of sentient beings’ pollution is improper mental activity.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ནི་ ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ -འོ་ ། །

source: The condition for sentient beings’ pollution is ignorance.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྐྱེན་ ནི་ མ་རིག་པ་ -འོ་ ། །

source: Ignorance is a cause and formations are conditions.
bo: མ་རིག་པ་ ནི་ རྒྱུ་ -འོ་ ། ། འདུ་བྱེད་ རྣམས་ ནི་ རྐྱེན་ ཏོ་ ། །

source: The formations are causes and consciousness is a condition.
bo: འདུ་བྱེད་ ནི་ རྒྱུ་ -འོ་ ། ། རྣམ་པ་ -ར་ ཤེས་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Consciousness is a cause and name and form are conditions.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ ནི་ རྒྱུ་ -འོ་ ། ། མིང་ དང་ གཟུགས་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Name and form are causes and the six sense fields are conditions.
bo: མིང་ དང་ གཟུགས་ ནི་ རྒྱུ་ -འོ་ ། ། སྐྱེ་མཆེད་ དྲུག་ ནི་ རྐྱེན་ ཏོ་ ། །

source: The six sense fields are causes and contact is a condition.
bo: སྐྱེ་མཆེད་ དྲུག་ ནི་ རྒྱུ་ -འོ་ ། ། རེག་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Contact is a cause and sensation is a condition.
bo: རེག་པ་ ནི་ རྒྱུ་ -འོ་ ། ། ཚོར་བ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Sensation is a cause and craving is a condition.
bo: ཚོར་བ་ ནི་ རྒྱུ་ -འོ་ ། ། སྲེད་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Craving is a cause and appropriation is a condition.
bo: སྲེད་པ་ ནི་ རྒྱུ་ -འོ་ ། ། ཉེ་བར་ ལེན་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Appropriation is a cause and becoming is a condition.
bo: ཉེ་བར་ ལེན་པ་ ནི་ རྒྱུ་ -འོ་ ། ། སྲིད་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Becoming is a cause and birth is a condition.
bo: སྲིད་པ་ ནི་ རྒྱུ་ -འོ་ ། ། སྐྱེ་བ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Birth is a cause and old age and death are conditions.
bo: སྐྱེ་བ་ ནི་ རྒྱུ་ -འོ་ ། ། རྒ་ཤི་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Old age and death are causes and afflictive emotions are conditions.
bo: རྒ་ཤི་ ནི་ རྒྱུ་ -འོ་ ། ། ཉོན་མོངས་པ་ རྣམས་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Afflictive emotions are causes and actions are conditions.
bo: ཉོན་མོངས་པ་ རྣམས་ ནི་ རྒྱུ་ -འོ་ ། ། ལས་ རྣམས་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Views are causes and craving is a condition.
bo: ལྟ་བ་ ནི་ རྒྱུ་ -འོ་ ། ། སྲེད་པ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: Latent tendencies are causes and their activations are conditions.
bo: བག་ ལ་ ཉལ་ ནི་ རྒྱུ་ -འོ་ ། ། ཀུན་ ནས་ ལྡང་བ་ ནི་ རྐྱེན་ ཏོ་ ། །

source: These are the causes and conditions of beings’ pollution.
bo: འདི་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ -འོ་ ། ། འདི་ ནི་ རྐྱེན་ ཏོ་ ། །

source: “What are the causes and conditions for sentient beings’ purification?
bo: དེ་ ལ་ སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ དག་པ་ -ར་ འགྱུར་བ་ -འི་ རྒྱུ་ ནི་ གང་ ། རྐྱེན་ ནི་ གང་ཞེ་ན་ །

source: There are two causes or two conditions for sentient beings’ purification.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ དག་པ་ -འི་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ སོ་ ། །

source: What are these two?
bo: གཉིས་ གང་ཞེ་ན་ །

source: Another’s words to be followed and one’s own correct mental activity form a pair.
bo: གཞན་ ལས་ རྗེས་སུ་ འཐུན་པ་ -འི་ སྒྲ་ དང་ ། སོ་སོ་ བདག་ཉིད་ ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ སྟེ་ ། གཉིས་པོ་ འདི་དག་ གོ་ ། །

source: One-pointed tranquil abiding and skill in special insight also form a pair of causes or conditions.
bo: གཞན་ ཡང་ སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ དག་པ་ -འི་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ །

source: The same applies as well as to knowing that there is no coming and knowing that there is no going, realizing nonorigination and reaching certainty, actualizing liberation through virtuous conduct and knowledge, cultivating the gates to liberation and knowing what is naturally liberated, and knowing contamination and knowing nonorigination.
bo: ཞི་གནས་ ལ་རྩེ་ གཅིག་པ་ དང་ ། ལྷག་མཐོང་ ལ་ མཁས་པ་ -འོ་ ། ། གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། འོང་བ་ མེད་པ་ -ར་ ཤེས་པ་ དང་ ། འགྲོ་བ་ མེད་པ་ -ར་ ཤེས་པ་ -འོ་ ། ། གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། སྐྱེ་བ་ མེད་པ་ -ར་ རབ་ཏུ་ རྟོག་པ་ དང་ ། ངེས་པར་ གྱུར་པ་ ལ་ རེག་པ་ -ར་ བྱེད་པ་ -འོ་ ། ། གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། རྐང་པ་ -ར་ ལྡན་པ་ དང་ ། རིག་པ་ -ས་ རྣམ་པ་ -ར་ གྲོལ་བ་ མངོན་སུམ་ དུ་ བྱེད་པ་ -འོ་ ། ། གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་ ལ་ སྒོམ་པ་ དང་ ། རང་བཞིན་ གྱིས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ ཤེས་པ་ -འོ་ ། ། གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། ཟད་པ་ ཤེས་པ་ དང་ ། མི་ སྐྱེ་བ་ ཤེས་པ་ -འོ་ ། །

source: Finally, the pair consisting of realizing the truth and attaining the truth is a pair of causes or conditions for beings’ purification.
bo: གཞན་ ཡང་ རྒྱུ་གཉིས་ དང་ རྐྱེན་ གཉིས་ ཏེ་ ། བདེན་པ་ རྗེས་སུ་ རྟོགས་པ་ དང་ ། བདེན་པ་ རྗེས་སུ་ ཐོབ་པ་ སྟེ་ ། འདི་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ དག་པ་ -འི་ རྒྱུ་ -འོ་ ། །

source: All these the tathāgatas know.
bo: འདི་ ནི་ རྐྱེན་ ཏེ་ ། དེ་ -འང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རབ་ཏུ་ མཁྱེན་ ཏོ་ ། །

source: “Moreover, son of noble family, the perceptions of pollution are immeasurable, and the perceptions of their purification are equally immeasurable.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ ཀུན་ ནས་ ཉོན་མོངས་པ་ ལ་ དམིགས་པ་ ཚད་ མེད་ ། རྣམ་པ་ -ར་ དག་པ་ ལ་ དམིགས་པ་ ཡང་ ཚད་ མེད་ དེ་ །

source: By discriminating in accordance with reality, the perceptions of pollution are replaced by those of their purification.
bo: ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སོ་སོ་ -ར་ རྟོག་པ་ -ས་ ཀུན་ ནས་ ཉོན་མོངས་པ་ ལ་ དམིགས་པ་ རྣམ་པ་ -ར་ བྱང་བ་ ལ་ དམིགས་པ་ -ར་ འཇོག་པ་ ཡང་ ཡོད་ ། །

source: But by grasping with excessive pride, the perceptions of purification may be replaced by those of pollution.
bo: ལྷག་པ་ -འི་ ང་རྒྱལ་ གྱིས་ འཛིན་པ་ -ས་ རྣམ་པ་ -ར་ དག་པ་ ལ་ དམིགས་པ་ ཀུན་ ནས་ ཉོན་མོངས་པ་ ལ་ དམིགས་པ་ -ར་ འཇོག་པ་ ཡང་ ཡོད་ དེ་ །

source: Thus, through nonsequential enumerations, one enters the wisdom of the tathāgatas.
bo: དེ་ ལ་ སྣྲེལ་ ཞི་ -འི་ རྣམ་ གྲངས་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ འཇུག་ གོ་ ། །

source: “Son of noble family, endowed with such wisdom, the tathāgatas are detached from desires and sinful nonvirtuous factors, possess applied and sustained thought, and are joyful and blissful through detachment.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡེ་ཤེས་ འདི་ ལྟ་བུ་ དང་ ལྡན་པ་ -ས་ འདོད་པ་ དག་ ལས་ དབེན་པ་ ། སྡིག་པ་ མི་དགེ་བ་ -འི་ ཆོས་ རྣམས་ ལས་ དབེན་པ་ ། རྟོག་པ་ དང་ བཅས་པ་ ། དཔྱོད་པ་ དང་ བཅས་པ་ དབེན་པ་ ལས་ སྐྱེས་པ་ -འི་ དགའ་བ་ དང་ བདེ་བ་ ཅན་ །

source: Attaining the first concentration, the tathāgatas emerge from cessation.
bo: བསམ་གཏན་ དང་པོ་ ལ་ སྙོམས་པར་ ཞུགས་ ཏེ་ འགོག་པ་ ལས་ ལྡང་ ངོ་ ། །

source: Attaining cessation, they emerge from the first concentration.
bo: འགོག་པ་ ལས་ སྙོམས་པར་ ཞུགས་ ཏེ་ བསམ་གཏན་ དང་པོ་ ལས་ ལྡང་ ངོ་ ། །

source: They have attainments that follow the sequence of the eight liberations and attainments that do not.
bo: རྣམ་པ་ -ར་ ཐར་པ་ བརྒྱད་ ལ་ རྗེས་སུ་ འཐུན་པ་ -ར་ སྙོམས་པར་ འཇུག་ གོ་ ། ། མི་ འཐུན་པ་ -ར་ ཡང་ སྙོམས་པར་ འཇུག་ གོ་ ། །

source: They also have attainments in a nonsequential order.
bo: ཐོད་རྒལ་ དུ་ ཡང་ སྙོམས་པར་ འཇུག་ གོ་ ། །

source: Although absorption is revealed as attainment and attainment is revealed as absorption, there is no blending at all within the tathāgatas’ absorption.
bo: ཏིང་ངེ་འཛིན་ ནི་ སྙོམས་པར་ འཇུག་པ་ -ར་ སྟོན་ ། སྙོམས་པར་ འཇུག་པ་ ནི་ ཏིང་ངེ་འཛིན་ དུ་ སྟོན་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ལ་ འདྲེས་པ་ གང་ཡང་ མེད་ ཅིང་

source: For them there is no attainment in absorption in terms of objective reference points.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ ནི་ དམིགས་པ་ -ས་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པར་ འཇུག་པ་ -ར་ བྱ་བ་ མེད་ དོ་ ། །

source: A single tathāgata absorption accomplishes all absorptions.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ གཅིག་ གིས་ ཏིང་ངེ་འཛིན་ ཐམས་ཅད་ མངོན་པར་ འགྲུབ་ སྟེ་ །

source: Without emerging from a single absorption, the tathāgatas attain all absorptions, but for them there is no fluctuation from one mental moment to another.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཏིང་ངེ་འཛིན་ གཅིག་ ལས་མ་ བཞེངས་པ་ -ར་ ཏིང་ངེ་འཛིན་ ཐམས་ཅད་ ལ་ སྙོམས་པར་ འཇུག་ ཀྱང་ ། དེ་བཞིན་ གཤེགས་པ་ ལ་ སེམས་ གཅིག་ ནས་ གཅིག་ ཏུ་ འཇུག་པ་ མེད་ དོ་ ། །

source: For the tathāgatas, a mind outside of equipoise does not exist.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ སེམས་ མཉམ་པ་ -ར་ མ་ བཞག་པ་ མི་ དམིགས་ སོ་ ། །

source: No one is able to witness a tathāgata absorption.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ནི་ སུ་ -ས་ ཀྱང་ བལྟ་བ་ -ར་ མི་ ནུས་ ཏེ་ །

source: A śrāvaka absorption is surpassed by a pratyekabuddha absorption. This is in turn surpassed by the bodhisattva absorption, which is in turn surpassed by the tathāgata absorption, which is unsurpassed.
bo: ཉན་ཐོས་ ཀྱི་ ཏིང་ངེ་འཛིན་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཏིང་ངེ་འཛིན་ གྱི་ ཟིལ་ གྱིས་ ནོན་ ཏོ་ ། ། རང་ སངས་རྒྱས་ ཀྱི་ ཏིང་ངེ་འཛིན་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་ངེ་འཛིན་ གྱི་ ཟིལ་ གྱིས་ ནོན་ ཏོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཏིང་ངེ་འཛིན་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ གྱི་ ཟིལ་ གྱིས་ ནོན་ ཏོ་ ། །
