Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: With unequaled knowledge they understand the zealous actions of beings.’
bo: གང་ གིས་ འགྲོ་བ་ འདུན་པ་ -འི་ ལས་ ནི་ མཚུངས་པ་ མེད་པ་ -འི་ ཤེས་པ་ -ས་ རིག་ །

source: “Son of noble family, the vigor of tathāgatas does not deteriorate.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བརྩོན་འགྲུས་ ཉམས་པ་ མེད་ དོ་ ། །

source: The vigor of the tathāgatas is as follows:
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ བརྩོན་འགྲུས་ ནི་ འདི་ ཡིན་ ཏེ་ །

source: It is a vigor that does not forsake beings to be tamed or disdain those who listen to the Dharma.
bo: འདི་ལྟ་སྟེ་ ། འདུལ་བ་ -འི་ སེམས་ཅན་ རྣམས་ ཡལ་བ་ -ར་ མི་ འདོར་བ་ -འི་ བརྩོན་འགྲུས་ དང་ ། ཆོས་ ཉན་པ་ དག་ ལ་ བརྙས་པ་ མེད་པ་ -འི་ བརྩོན་འགྲུས་ སོ་ ། །

source: When the tathāgatas discover audiences receptive to the Dharma, who do not tire of listening to the Dharma even for an eon, the tathāgatas will teach the Dharma, uninterrupted by meals and without stirring, even for an eon.
bo: གལ་ཏེ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཀྱི་ སྣོད་ ཆོས་ ཉན་པ་ གང་ བསྐལ་པ་ -ར་ ཡང་ ཆོས་ ཉན་པ་ -ས་ སྐྱོ་བ་ -ར་ མི་འགྱུར་བ་ རྙེད་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡང་ ཆོས་སྟོན་ ། ཁ་ཟས་ དང་ བྲལ་བ་ -འི་ རྒྱུད་ དུ་ གྱུར་ ཀྱང་ བསྐལ་པ་ -ར་ ཡང་ མི་ ལྡང་ ངོ་ ། །

source: For the sake of just a single being to be tamed by the buddhas, the tathāgatas, in their concern for beings, will travel beyond as many buddhafields as the number of grains of sand of the river Ganges.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ཅན་ ལ་ ལྟ་བ་ -ས་ ཐ་ན་ གང་ ན་ སངས་རྒྱས་ ཀྱིས་ འདུལ་བ་ -འི་ སེམས་ཅན་ གཅིག་ གི་ ཕྱིར་ཡང་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ འདའ་ ཞིང་ བཞུད་ དེ་ །

source: They will not become physically, verbally, or mentally weary.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ སྐུ་མཉེལ་བ་ -འམ་ ། གསུང་ མཉེལ་བ་ -འམ་ ། ཐུགས་ མཉེལ་བ་ མེད་ དོ་ ། །

source: “The tathāgatas have made their minds pliant, roused vigor, and spoken in praise of vigor.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ ཤིན་ཏུ་ སྦྱངས་པ་ ། བརྩོན་འགྲུས་ བརྩམས་པ་ ། བརྩོན་འགྲུས་ ཀྱི་ བསྔགས་པ་ སྨྲ་བ་ སྟེ་ །

source: The vigor through which sentient beings, by correctly applying themselves to it, will attain noble liberation—that is the vigor commended to them.
bo: ཡང་དག་པ་ -ར་ སྦྱོར་བ་ -འི་ བརྩོན་འགྲུས་ གང་ གིས་ སེམས་ཅན་ རྣམས་ ཀྱིས་ འཕགས་པ་ -འི་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཐོབ་པ་ -ར་ འགྱུར་བ་ -འི་ བརྩོན་འགྲུས་ དེ་ སེམས་ཅན་ རྣམས་ ལ་ བསྔགས་པ་ -ར་ བྱེད་ དེ་ །

source: This is the twenty-second tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་རྩ་གཉིས་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: Through which the lions among humans became noble beings.
bo: བརྩོན་འགྲུས་ གང་ གིས་ མི་ ཡི་ སེང་གེ་ འཕགས་ འགྱུར་བ་ ། །

source: “ ‘They continually praise that powerful vigor
bo: བརྩོན་འགྲུས་ སྟོབས་ དེ་ -འི་ བསྔགས་པ་ རྟག་ ཏུ་ རྗོད་པ་ -ར་ བྱེད་ ། །

source: That powerful vigor does not deteriorate at all.
bo: བརྩོན་འགྲུས་ སྟོབས་ ནི་ གང་ དུའང་ ཉམས་པ་ ཡོད་ མིན་ ཏེ་ ། །

source: Once an audience is found, the Dharma is taught.
bo: སྣོད་ དུ་ གྱུར་པ་ རྙེད་ ནས་ ཆོས་ ཀྱང་ སྟོན་པ་ -ར་ བྱེད་ ། །

source: “ ‘The vigor of the sugatas never rests.
bo: བདེ་བ་ -ར་ གཤེགས་ ཀྱི་ བརྩོན་འགྲུས་ གནས་པ་ ཡོད་ མིན་ ཏེ་ ། །

source: It is without physical, verbal, or mental weariness.
bo: ལུས་ དང་ ངག་ དང་སེམས་ ནི་ གང་ དུའང་ སྐྱོ་བ་ མེད་ ། །

source: Just as this spontaneous vigor is completely free of sin,
bo: ཇི་ལྟར་ རང་བྱུང་ བརྩོན་འགྲུས་ ཀུན་ དུ་ སྡིག་ མེད་པ་ ། །

source: So are beings, having purified their minds, stablished in it.’
bo: དེ་ལྟར་ བློ་ སྦྱངས་ སེམས་ཅན་ ཡང་དག་ འཛིན་ དུ་ འཇུག་ །

source: “Son of noble family, the mindfulness of tathāgatas does not deteriorate in any respect or in any way whatsoever.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དྲན་པ་ ནི་ ཐམས་ཅད་ ཀྱི་ ཐམས་ཅད་ རྣམ་པ་ ཐམས་ཅད་ ཀྱི་ ཐམས་ཅད་ དུ་ ཉམས་པ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because the tathāgatas are not forgetful.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ བསྙེལ་བ་ མེད་ དོ་ ། །

source: Son of noble family, as soon as tathāgatas awaken into unsurpassed, perfect awakening, they behold the mindstreams of all sentient beings of the past, present, and future. Still, they are not forgetful at all.
bo: རིགས་ ཀྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ མ་ ཐག་ ཏུ་ འདས་པ་ དང་ ། མ་འོངས་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ རྒྱུད་ ལ་ རྣམ་པ་ -ར་ གཟིགས་ ཀྱང་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ བསྙེལ་བ་ ཤིན་ཏུ་ མེད་ དོ་ ། །

source: Although they know the conduct of beings in accordance with reality, the tathāgatas do not let go of their wisdom regarding it.
bo: སེམས་ཅན་ གྱི་ སྤྱོད་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མཁྱེན་ ཀྱང་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཡེ་ཤེས་ ཡང་ གཏོང་བ་ མེད་ དོ་ ། །

source: The mindfulness of tathāgatas does not deteriorate when they assign beings to three groups, engage with their faculties and mentalities, and behold their conduct.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཕུང་པོ་ གསུམ་ དུ་ རྣམ་པ་ -ར་ དགོད་པ་ དང་ ། སེམས་ཅན་ གྱི་ དབང་པོ་ ལ་ འཇུག་པ་ དང་ ། སེམས་ཅན་ གྱི་ བསམ་པ་ ལ་ འཇུག་པ་ དང་ ། སེམས་ཅན་ གྱི་ སྤྱོད་པ་ ལ་ རྣམ་པ་ -ར་ གཟིགས་པ་ -ས་ དྲན་པ་ ཉམས་པ་ མེད་པ་ ཉིད་ དེ་ །

source: The tathāgatas’ teaching of the Dharma to beings happens without activating their recollection, without intention or analysis.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ དྲན་པ་ -ར་ བྱས་ སམ་ ། བསམས་ སམ་ ། རྣམ་པ་ -ར་ བརྟགས་ ཏེ་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་པ་ མེད་ དོ་ ། །

source: Even while teaching, their mindfulness does not deteriorate.
bo: སྟོན་ ཀྱང་ ཉམས་པ་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because the mindfulness of tathāgatas does not deteriorate.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ དྲན་པ་ ནི་ ཇི་ལྟར་ ཉམས་པ་ མེད་ དོ་ ། །

source: Just as they are mindful and without forgetfulness, they teach the Dharma to beings accordingly.
bo: དེ་ ཇི་ལྟར་ བདག་ དྲན་ ཞིང་ བསྙེལ་བ་ མེད་པ་ དེ་ལྟར་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the twenty-third tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ གསུམ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The mindfulness of the teachers does not deteriorate in the slightest.
bo: སྟོན་པ་ -འི་ དྲན་པ་ གང་ཡང་ ཉམས་ མེད་ དེ་ ། །

source: The mindfulness of the victors is effortless.
bo: རྒྱལ་བ་ -འི་ དྲན་པ་ -ས་ དྲན་པ་ -ར་ བྱ་བ་ མེད་ ། །

source: When the victors awaken into awakening,
bo: རྒྱལ་བ་ -ས་ གང་ ཚེ་ བྱང་ཆུབ་ སངས་རྒྱས་ ནས་ ། །

source: They know the minds of all beings without exception.
bo: འགྲོ་བ་ -འི་ སེམས་ ནི་ མ་ ལུས་ རྣམ་པ་ -ར་ མཁྱེན་ ། །

source: “ ‘The thoughts, faculties, and conduct of beings Are not to be cognized consequently.
bo: བསམ་པ་ དབང་པོ་ སེམས་ཅན་ སྤྱོད་པ་ དང་ ། ། ཕྱིས་ ཡང་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མེད་ ། །

source: Remaining in order to act spontaneously, The victorious lords teach beings the Dharma.’
bo: ལྷུན་ གྱིས་ གྲུབ་པ་ -འི་ བྱ་བ་ -ར་ གནས་ ནས་ ནི་ ། ། རྒྱལ་བ་ -འི་ དབང་པོ་ འགྲོ་ ལ་ ཆོས་སྟོན་ ཏོ་ ། །

source: “Son of noble family, the meditative absorption of the tathāgatas does not deteriorate.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཉམས་པ་ མེད་ དོ་ ། །

source: It is the sameness of all phenomena, the fact that all phenomena are not not the same, and all phenomena as they really are.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ གང་ཡིན་པ་ དེ་ ནི་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དང་ ཆོས་ ཐམས་ཅད་ མི་མཉམ་པ་ མ་ཡིན་པ་ དང་ ། ཆོས་ ཐམས་ཅད་ ཇི་ལྟ་བ་ བཞིན་ ནོ་ ། །

source: Why does the meditative absorption of the tathāgatas not deteriorate?
bo: ཅིའི་ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཉམས་པ་ -ར་ མི་ འགྱུར་ ཞེ་ན་ །

source: What is equal to suchness is equal to absorption.
bo: དེ་བཞིན་ཉིད་ གང་ དང་ མཉམ་པ་ དེ་ དང་ ཏིང་ངེ་འཛིན་ དང་ མཉམ་ མོ་ ། །

source: What is equal to absorption is equal to the tathāgatas.
bo: ཏིང་ངེ་འཛིན་ གང་ དང་ མཉམ་པ་ དེ་ དང་ དེ་བཞིན་ གཤེགས་པ་ མཉམ་ སྟེ་ །

source: That is why it is called equipoise.
bo: དེ་ -འི་ ཕྱིར་ མཉམ་པ་ -ར་ གཞག་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: “What is equal to the extreme of attachment is equal to the extreme of the lack of attachment.
bo: འདོད་ཆགས་ ཀྱི་ མཐའ་ གང་ དང་ མཉམ་པ་ འདོད་ཆགས་ དང་ བྲལ་བ་ -འི་ མཐའ་ ཡང་ དེ་ དང་ མཉམ་ མོ་ ། །

source: What is equal to the extreme of aversion is equal to the extreme of the lack of aversion.
bo: ཞེ་སྡང་ གི་ མཐའ་ གང་ དང་ མཉམ་པ་ ཞེ་སྡང་ དང་ བྲལ་བ་ -འི་ མཐའ་ ཡང་ དེ་ དང་ མཉམ་ མོ་ ། །

source: What is equal to the extreme of delusion is equal to the extreme of the lack of delusion.
bo: གཏི་མུག་ གི་ མཐའ་ གང་ དང་ མཉམ་པ་ གཏི་མུག་ དང་ བྲལ་བ་ -འི་ མཐའ་ ཡང་ དེ་ དང་ མཉམ་ མོ་ ། །

source: What is equal to the extreme of the conditioned is equal to the extreme of the unconditioned.
bo: འདུས་བྱས་ ཀྱི་ མཐའ་ གང་ དང་ མཉམ་པ་ འདུས་མ་བྱས་ ཀྱི་ མཐའ་ ཡང་ དེ་ དང་ མཉམ་ མོ་ ། །

source: What is equal to the extreme of saṃsāra is equal to the extreme of nirvāṇa.
bo: འཁོར་བ་ -འི་ མཐའ་ གང་ དང་ མཉམ་པ་ མྱ་ངན་ ལས་ འདས་པ་ -འི་ མཐའ་ ཡང་ དེ་ དང་ མཉམ་ སྟེ་ །

source: Having settled evenly in these types of sameness is called equipoise.
bo: མཉམ་པ་ཉིད་ དེ་དག་ ལ་ སྙོམས་པར་ ཞུགས་པ་ -ས་ དེ་ -འི་ ཕྱིར་ མཉམ་པ་ -ར་ གཞག་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: Because the absorption of the tathāgatas is without deterioration.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཉམས་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because there is no deterioration in that sameness.
bo: མཉམ་པ་ཉིད་ དེ་ ལ་ ཉམས་པ་ མེད་ །

source: There is no deterioration at all.
bo: ཡོངས་སུ་ ཉམས་པ་ མེད་ དོ་ ། །

source: “The absorption of the tathāgatas does not involve the eyes, ear, nose, tongue, body, or mind, even though the tathāgatas have complete faculties.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ དེ་ཡང་ མིག་ དང་ ལྡན་པ་ མ་ ཡིན་ ། རྣ་བ་ དང་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ དང་ ། ཡིད་ དང་ ལྡན་པ་ མ་ ཡིན་མོད་ ཀྱི་ ། དེ་བཞིན་ གཤེགས་པ་ དབང་པོ་ མ་ཚང་བ་ ཡང་ མ་ ཡིན་ ནོ་ ། །

source: Their absorption does not settle in the earth element, in the water element, in the fire element, or in the wind element.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ནི་ ས་ -འི་ ཁམས་ ལ་ མི་ གནས་ སོ་ ། ། ཆུ་ -འི་ ཁམས་ ལ་མ་ ཡིན་ ། མེ་ -འི་ ཁམས་ ལ་མ་ ཡིན་ ཏེ་ ། རླུང་ གི་ ཁམས་ ལ་ ཡང་ མི་ གནས་ སོ་ ། །

source: It does not settle in the desire realm, in the form realm, or in the formless realm.
bo: འདོད་པ་ -འི་ ཁམས་ ལ་ མི་ གནས་ ། གཟུགས་ ཀྱི་ ཁམས་ ལ་ མི་ གནས་ ། གཟུགས་ མེད་པ་ -འི་ ཁམས་ ལ་ མི་ གནས་ །

source: It is not settled in this world or in the world beyond.
bo: འཇིག་རྟེན་ འདི་ ལ་ མི་ གནས་ ། འཇིག་རྟེན་ ཕ་རོལ་ ལ་ མི་ གནས་ སོ་ ། །

source: Since it does not settle, there is no deterioration.
bo: མི་ གནས་པ་ -འི་ ཕྱིར་ ཉམས་པ་ མེད་ དེ་ །

source: That is why it is said that the absorption of the tathāgatas is without deterioration.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཉམས་པ་ མེད་ ཅེས་ བྱ་ -འོ་ ། །

source: The tathāgatas teach the Dharma so that all sentient beings may also attain absorption.
bo: དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱང་ ཏིང་ངེ་འཛིན་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the twenty-fourth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ བཞི་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The buddhas are constantly in equipoise.
bo: སངས་རྒྱས་ རྟག་ ཏུ་ མཉམ་པ་ -ར་ གཞག་ །

source: Their absorption does not deteriorate.
bo: དེ་ ཡི་ ཏིང་འཛིན་ ཉམས་པ་ མེད་ ། །

source: The equality of all phenomena.
bo: ཆོས་ རྣམས་ ཀུན་ དང་ མཉམ་པ་ -ར་ ལྡན་ ། །

source: The buddhas are settled evenly in equality,
bo: སངས་རྒྱས་ མཉམ་ཉིད་ མཉམ་པ་ -ར་ གཞག་ །

source: In the earth, water, fire, or air element, Or in the realms of desire, form, or formlessness. “ ‘The concentration of the victors is not settled
bo: ས་ ཆུ་ མེ་ ལ་མ་ ཡིན་ ཏེ་ ། ། རླུང་ དང་ འདོད་གཟུགས་ གཟུགས་ མེད་ ལ་ ། ། རྒྱལ་བ་ གནས་ ཏེ་ བསམ་གཏན་ མིན་ ། །

source: Therefore, their absorption is without deterioration.’
bo: དེ་ -ས་ འདི་ ཏིང་འཛིན་ ཉམས་པ་ མེད་ ། །

source: “Furthermore, son of noble family, the insight of the tathāgatas is without deterioration.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཤེས་རབ་ ཉམས་པ་ མེད་ དོ་ ། །

source: What kind of insight is it?
bo: ཤེས་རབ་ གང་ཞེ་ན་ །

source: It is a thorough knowledge of all phenomena, a knowledge that does not depend on anything else.
bo: གང་ ཆོས་ ཐམས་ཅད་ རབ་ཏུ་ ཤེས་པ་ སྟེ་ ། གཞན་ གྱི་ དྲིང་ མི་ འཇོག་པ་ -འི་ ཤེས་པ་ -འོ་ ། །

source: They know how to teach the Dharma correctly to other beings and individuals.
bo: སེམས་ཅན་ གཞན་དག་ དང་ ། གང་ཟག་ གཞན་ རྣམས་ ལ་ ཆོས་ ཡང་དག་པ་ -ར་ སྟོན་པ་ -འི་ ཤེས་པ་ -འོ་ ། །

source: They are skilled in correct discrimination and know how to analyze words.
bo: སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ལ་ མཁས་པ་ -ས་ ཚིག་ རབ་ཏུ་ དབྱེ་བ་ ཤེས་པ་ -འོ་ ། །

source: They know how to teach so that the usage of a single word will prevail for a hundred thousand eons.
bo: ཚིག་ གཅིག་ ལ་ འཇུག་པ་ -ས་ བསྐལ་པ་ བརྒྱ་ སྟོང་ དུ་ གནས་ ཤིང་ སྟོན་པ་ ཤེས་པ་ -འོ་ ། །

source: They know how to eradicate doubts in accordance with the manner of the question.
bo: ཇི་ལྟར་ དྲིས་པ་ བཞིན་ དུ་ ཐེ་ཚོམ་ གཅོད་པ་ -འི་ ཤེས་པ་ -འོ་ ། །

source: They know how to be totally without attachment.
bo: ཐམས་ཅད་ དུ་ ཆགས་པ་ མེད་པ་ ཤེས་པ་ -འོ་ ། །

source: They know how to teach the arrangement of the three vehicles.
bo: ཐེག་པ་ གསུམ་ རྣམ་པ་ -ར་ དགོད་པ་ བསྟན་པ་ ཤེས་པ་ -འོ་ ། །

source: They know entirely the eighty-four thousand types of mental conduct of beings.
bo: སེམས་ཅན་ གྱི་ སེམས་ ཀྱི་ སྤྱོད་པ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོངས་སུ་ ཤེས་པ་ -འི་ ཤེས་པ་ -འོ་ ། །

source: They know how to teach the eighty-four thousand divisions of Dharma, each as is appropriate.
bo: ཆོས་ ཀྱི་ ཕུང་པོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ སོ་སོ་ ཅི་རིགས་པ་ -ར་ ཆོས་སྟོན་པ་ ཤེས་པ་ -འོ་ ། །

source: In this way, the insight of the tathāgatas has been shown to be limitless, infinite, inexhaustible, and immeasurable.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཤེས་རབ་ མཐའ་ཡས་པ་ ། ཐུག་པ་ མེད་པ་ ། ཟད་པ་ མེད་པ་ ། ཚད་ མེད་པ་ བསྟན་པ་ -འོ་ ། །

source: “Just as the tathāgatas are without deterioration and thoroughly without deterioration, so they teach the Dharma so that the insight of all sentient beings will be inexhaustible.
bo: ཇི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཉམས་པ་ མེད་ ཅིང་ ཡོངས་སུ་ ཉམས་པ་ མེད་པ་ དེ་ལྟར་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱང་ ཤེས་རབ་ མི་ཟད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏེ་ །

source: This is the twenty-fifth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ ལྔ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘With insight that perceives all aspects directly,
bo: ཤེས་རབ་ ཀྱིས་ ནི་ ཚུལ་ རྣམས་ མངོན་སུམ་ སྟེ་ ། །

source: The masters of correct discrimination have gone beyond.
bo: སོ་སོ་ ཡང་དག་ རིག་ དབང་ ཕ་རོལ་ སོན་ ། །

source: They teach the Dharma to beings, naturally responding to their thinking.
bo: བསམ་བཞིན་ རང་བྱུང་ སེམས་ཅན་ ཆོས་སྟོན་ ཏེ་ ། །

source: In a single syllable or word, limitless words are contained.
bo: འབྲུ་ གཅིག་ཚིག་ ལ་ མཐའ་ ཡས་ ཚིག་ རྣམས་ འཇུག་ །

source: “ ‘Aware of the infinite conduct of beings,
bo: འགྲོ་བ་ -འི་ སྤྱོད་པ་ ཐུག་མེད་ རབ་ ཤེས་ ནས་ ། །

source: They teach the eighty-four thousand Dharmas accordingly.
bo: དེ་བཞིན་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཆོས་སྟོན་ ཀྱང་ ། །

source: The insight of the sugatas never deteriorates.
bo: ནམ་ཡང་ བདེ་གཤེགས་ ཤེས་རབ་ ཉམས་ མེད་ དེ་ ། །

source: This activity of the ten strengths sets them apart from other beings.’
bo: སྟོབས་ བཅུ་ -འི་ ལས་ འདི་ འགྲོ་ ལས་ ཁྱད་པར་ འཕགས་ ། །

source: “Son of noble family, the liberation of the tathāgatas is without deterioration.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཉམས་པ་ མེད་ དོ་ ། །

source: What is the liberation of the tathāgatas?
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ རྣམ་པ་ -ར་ གྲོལ་བ་ གང་ཞེ་ན་ །

source: The liberation of śrāvakas conforms to words.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ གྲོལ་བ་ ནི་སྒྲ་ -འི་ རྗེས་སུ་ འགྲོ་བ་ -འོ་ ། །

source: The liberation of pratyekabuddhas consists of their comprehension of conditions.
bo: རང་ སངས་རྒྱས་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ གྲོལ་བ་ ནི་ རྐྱེན་ ཁོང་ དུ་ ཆུད་པ་ -འོ་ ། །

source: The liberation of buddhas is called liberation because it is free of all attachment and apprehending.
bo: སངས་རྒྱས་ རྣམས་ ཀྱི་ རྣམ་པ་ -ར་ གྲོལ་བ་ ནི་ ཆགས་པ་ དང་ ། འཛིན་པ་ ཐམས་ཅད་ དང་ བྲལ་བ་ -ས་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཞེས་ བྱ་ སྟེ་ །

source: They are not tied to the past, they are not projected into the future, and they do not abide in the present.
bo: སྔོན་ གྱི་ མཐའ་ -ར་ ཡང་ མ་ བཅིངས་ ། ཕྱི་མ་ -འི་ མཐའ་ -ར་ ཡང་ མི་ འཕོ་ ། ད་ལྟར་ བྱུང་བ་ ལ་ ཡང་ མི་ གནས་ སོ་ ། །

source: They are free from apprehending the eye and form as two, and from apprehending the ear and sound, the nose and smell, the tongue and taste, the body and tactile objects, and the mind and mental factors as two.
bo: མིག་ དང་ གཟུགས་ ལ་ གཉིས་ སུ་ འཛིན་པ་ ལས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འོ་ ། ། རྣ་བ་ དང་ ། སྒྲ་ དང་ ། སྣ་ དང་ ། དྲི་ དང་ ། ལྕེ་ དང་ ། རོ་ དང་ ། ལུས་ དང་ ། རེག་བྱ་ དང་ ། ཡིད་ དང་ ། ཆོས་ ལ་ གཉིས་ སུ་ འཛིན་པ་ ལས་ རྣམ་པ་ -ར་ གྲོལ་བ་ སྟེ་ །

source: They are free from apprehending and grasping.
bo: འཛིན་པ་ -ར་ མངོན་པར་ ཞེན་པ་ -འི་ གནས་ ལས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -འོ་ ། །

source: Likewise, they know the luminous nature of the mind.
bo: སེམས་ རང་བཞིན་ འོད་གསལ་བ་ དེ་བཞིན་ དུ་ ཤེས་པ་ སྟེ་ །

source: Therefore, they are called complete and perfect buddhas who have gained unsurpassed complete and perfect awakening through a single mental moment of insight.
bo: དེ་ -འི་ ཕྱིར་ སེམས་ ཀྱི་ སྐད་ཅིག་ གཅིག་ དང་ ལྡན་པ་ -འི་ ཤེས་རབ་ ཀྱིས་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཞེས་ བྱ་ -འོ་ ། །

source: “Just as the tathāgatas have attained complete and perfect buddhahood, so they teach the Dharma to other beings and individuals.
bo: ཇི་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ གཞན་དག་ དང་ ། གང་ཟག་ གཞན་ རྣམས་ ལ་ ཆོས་སྟོན་ ཏོ་ ། །

source: This is the twenty-sixth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ དྲུག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The liberation of śrāvakas conforms to words.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ རྣམ་གྲོལ་ སྒྲ་ རྗེས་འགྲོ་ ། །

source: That of pratyekabuddhas concerns dependent arising.
bo: རང་ སངས་རྒྱས་ ཀྱི་ བརྟེན་ ནས་ སྐྱེས་པ་ -འོ་ ། །

source: The liberation of the irreproachable buddhas
bo: སངས་རྒྱས་ མ་སྨད་ རྣམས་ ཀྱི་ རྣམ་གྲོལ་ ནི་ ། །

source: Transcends attachment and is immaculate like space.
bo: ཆགས་ ལས་ རབ་ འདས་ དྲི་མེད་ ནམ་མཁའ་ འདྲ་ ། །

source: “ ‘Their minds were not bound in the past;
bo: སེམས་ ནི་ སྔོན་ ནས་ བཅིངས་པ་ -ར་ མ་ གྱུར་ ཏེ་ ། །

source: Their mindstreams are naturally free.
bo: སེམས་རྒྱུན་ འདི་དག་ རང་བཞིན་ རྣམ་པ་ -ར་ གྲོལ་ ། །

source: Just as they are free, they know.
bo: ཇི་ལྟར་ རྣམ་གྲོལ་ དེ་ལྟར་ ཡང་དག་ ཤེས་ ། །

source: Knowing, their liberation never deteriorates.’
bo: ཤེས་ ནས་ རྣམ་གྲོལ་ ཉམས་པ་ གང་ཡང་ མེད་ ། །

source: “Son of noble family, all physical activities of the tathāgatas are preceded and accompanied by wisdom.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལུས་ ཀྱི་ ལས་ ཐམས་ཅད་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་ ཞིང་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འོ་ ། །

source: They tame sentient beings while they gaze, speak, remain silent, or eat.
bo: དེ་བཞིན་ གཤེགས་པ་ ལུས་ ཀྱི་ ལས་ དེ་ དང་ ལྡན་པ་ -ས་ ལྟ་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། སྨྲ་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། ཅང་ མི་སྨྲ་ བས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། ཟ་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ །

source: They tame them through their conduct.
bo: སྤྱོད་ལམ་ གྱིས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ །

source: They tame beings by means of their major marks and minor signs and by means of their invisible crown protuberance.
bo: མཚན་ དག་ གིས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། དཔེ་བྱད་ བཟང་པོ་ དག་ གིས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། སྤྱི་གཙུག་ བལྟ་ -ར་ མི་སྣང་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ །

source: They tame beings merely by their gaze and by emitting light.
bo: བལྟས་པ་ ཙམ་ གྱིས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། འོད་ གཏོང་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ །

source: They tame them as they walk about and while arriving at or departing from cities.
bo: གོམ་པ་ འདོར་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ། གྲོང་ཁྱེར་ དུ་ འཇུག་པ་ དང་ འབྱུང་བ་ -ས་ ཀྱང་ སེམས་ཅན་ རྣམས་ འདུལ་ ཏེ་ །

source: There is no manner of conduct of the blessed buddhas that does not tame sentient beings.
bo: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ སྤྱོད་ལམ་ གང་ སེམས་ཅན་ འདུལ་བ་ -ར་ མི་འགྱུར་བ་ དེ་ གང་ཡང་ མེད་ དོ་ ། །

source: That is why all physical activities of the tathāgatas are said to be preceded and accompanied by wisdom.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལུས་ ཀྱི་ ལས་ ཐམས་ཅད་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་ ཞིང་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: This is the twenty-seventh tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ ཉི་ཤུ་ རྩ་ བདུན་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The buddhas apply themselves to taming beings By displaying their conduct as guides As they walk about, arrive, and depart And by means of their major marks, minor signs, and crown protuberance.
bo: འདྲེན་པ་ རྣམས་ ཀྱི་ སྤྱོད་ལམ་ སྟོན་པ་ དང་ ། ། འགྲོ་ དང་ འཇུག་ དང་ དེ་བཞིན་ འབྱུང་བ་ དང་ ། ། དཔེ་བྱད་ བཟང་ དང་ མཚན་ དང་ སྤྱི་གཙུག་ གིས་ ། ། སངས་རྒྱས་ དག་ ནི་ སེམས་ཅན་ འདུལ་བ་ -ར་ སྦྱོར་ ། །

source: “ ‘The moment the guides emit their light,
bo: རྣམ་པ་ -ར་ འདྲེན་པ་ གང་ ཚེ་ འོད་ གཏོང་བ་ ། །

source: Many beings experience bliss.
bo: དེ་ ཚེ་ སྐྱེ་བོ་ དུ་མ་ བདེ་བ་ -ར་ གྱུར་ ། །

source: Touched by the light, they are tamed.
bo: འོད་ ཀྱིས་ རེག་ ནས་ འདུལ་བ་ -ར་ རབ་ཏུ་ འགྲོ་ ། །

source: This is the activity of venerable beings.’
bo: འདི་ ནི་ རྐང་ གཉིས་ དམ་པ་ རྣམས་ ཀྱི་ ལས་ ། །

source: “Son of noble family, all verbal activities of the tathāgatas are preceded and accompanied by wisdom.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ངག་གི་ལས་ ཐམས་ཅད་ ཡེ་ཤེས་ སྔོན་ དུ་ འགྲོ་ ཞིང་ ཡེ་ཤེས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ -འོ་ ། །

source: Why is that so?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The tathāgatas teach dharmas that give results, they communicate continuously, and the words they articulate are clearly defined.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ འབྲས་བུ་ ཡོད་པ་ -འི་ ཆོས་སྟོན་པ་ -འོ་ ། ། ཕྱད་པ་ -ར་ ལུང་སྟོན་པ་ -འོ་ ། ། ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ སྨྲ་བ་ -འོ་ ། །

source: The speech of the tathāgatas makes everything known.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ངག་ དེ་ཡང་ ཀུན་ཤེས་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: It generates cognition.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱེད་པ་ -འོ་ ། །

source: It is neither lofty nor sordid.
bo: མི་ མཐོ་བ་ -འོ་ ། ། མི་ དམའ་བ་ -འོ་ ། །

source: It is not crooked, unclear, or dishonest.
bo: མ་ ཡོ་བ་ -འོ་ ། ། ལྡབ་ལྡིབ་ ཅན་ མ་ཡིན་པ་ -འོ་ ། ། གྱ་གྱུ་ མ་ཡིན་པ་ -འོ་ ། །

source: It is not rough, harsh, or distorted.
bo: མི་ བརླང་བ་ -འོ་ ། ། མི་ རྩུབ་པ་ -འོ་ ། ། མ་ འཆལ་བ་ -འོ་ ། །

source: It is soft, pleasing, and flexible.
bo: འཇམ་པ་ -འོ་ ། ། མཉན་པ་ -འོ་ ། ། ལས་ སུ་ རུང་བ་ -འོ་ ། །

source: It is not inane or prattling, nor is it frantic, hasty, or hurried.
bo: ར་ར་པོ་ མ་ཡིན་པ་ -འོ་ ། ། བྱུང་རྒྱལ་ མ་ཡིན་པ་ -འོ་ ། ། བརྟབས་པ་ མ་ཡིན་པ་ -འོ་ ། ། རྣམ་པ་ -ར་ མྱུར་བ་ མ་ཡིན་པ་ -འོ་ ། ། རབ་ཏུ་ མྱུར་བ་ མ་ཡིན་པ་ -འོ་ ། །

source: It is distinct, and the words are clearly defined.
bo: ཤིན་ཏུ་ རྣམ་པ་ -ར་ ཕྱེ་བ་ -འོ་ ། ། ཤིན་ཏུ་ ངེས་པ་ -འི་ ཚིག་ གོ་ ། །

source: It is joyous, melodious, and lucid.
bo: ཤིན་ཏུ་ དགའ་བ་ སྐྱེད་པ་ -འོ་ ། ། ཤིན་ཏུ་ གདངས་ སྙན་པ་ -འོ་ ། ། ཤིན་ཏུ་ གསལ་བ་ -འོ་ ། །

source: It is unimpeded, perfect, and pleasant.
bo: ཐགས་ཐོགས་ མེད་པ་ -འོ་ ། ། རྫོགས་པ་ -འོ་ ། ། སྙན་པ་ -འོ་ ། །

source: It is relevant, renowned, honorable, and beautiful.
bo: འབྲེལ་བ་ -འོ་ ། ། བསྒྲགས་པ་ -འོ་ ། ། མཆོད་པ་ -ར་ གྱུར་པ་ -འོ་ ། ། མཛེས་པ་ -འོ་ ། །

source: It is flawless, impeccable, and pliant.
bo: རྡུལ་མེད་པ་ -འོ་ ། ། རྡུལ་ དང་ བྲལ་བ་ -འོ་ ། ། ཐ་བ་ མེད་པ་ -འོ་ ། །
