Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: when they see form with their eyes, they cling to its marks and characteristics, and when they hear sounds with their ears, experience smells with their noses, experience tastes with their tongues, feel sensations with their bodies, and notice phenomena with their mental faculties, they cling to their marks and characteristics.
bo: མིག་ གིས་ གཟུགས་ རྣམས་ མཐོང་ ནས་ མཚན་མ་ -ར་ འཛིན་ ཅིང་ མངོན་རྟགས་ སུ་ འཛིན་པ་ ཡིན་ ། རྣ་བ་ -ས་ སྒྲ་ ཐོས་ ། སྣས་ དྲི་ སྣམས་ ། ལྕེ་ -ས་ རོ་ མྱངས་ ། ལུས་ ཀྱིས་ རེག་བྱ་ རྣམས་ ལ་ རེག་ ། ཡིད་ ཀྱིས་ ཆོས་ རྣམས་ རྣམ་པ་ -ར་ ཤེས་ ནས་ མཚན་མ་ -ར་ འཛིན་ ཅིང་ མངོན་རྟགས་ སུ་ འཛིན་པ་ དག་ ཡིན་ ཏེ་ །

source: To help them abandon attachment to the six sense fields, I shall teach them the Dharma.
bo: སྐྱེ་མཆེད་ དྲུག་ གིས་ ཆགས་པ་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are overcome by pride, the pride of superiority, excessive pride, the pride that thinks “I am,” manifest pride, the inverted pride of self-abasement, and mistaken pride.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ང་རྒྱལ་ དང་ ། ལྷག་པ་ -འི་ ང་རྒྱལ་ དང་ ། ང་རྒྱལ་ ལས་ ཀྱང་ ང་རྒྱལ་ དང་ ། ང་ -འོ་ སྙམ་པ་ -འི་ ང་རྒྱལ་ དང་ ། མངོན་པ་ -འི་ ང་རྒྱལ་ དང་ ། ཆུང་ ཟད་ སྙམ་པ་ -འི་ ང་རྒྱལ་ དང་ ། ལོག་པ་ -འི་ ང་རྒྱལ་ གྱིས་ བཅོམ་པ་ -ས་ །

source: Since they are conceited about themselves, they think “We are greater than those who are inferior,” “We are greater than those who are our equals,” and “We are even greater than those who are greater.”
bo: ཆུང་ངུ་ དག་པ་ -ས་ བདག་ཅག་ ཆེ་ -འོ་ སྙམ་ དུ་ བདག་ ལ་ རློམ་སེམས་ སུ་ བྱེད་པ་ ། མཚུངས་པ་ དག་པ་ -ས་ ནི་ བདག་ཅག་ ཆེ་ -འོ་ སྙམ་ དུ་ བདག་ ལ་ རློམ་སེམས་ སུ་ བྱེད་པ་ དང་ ། ཆེས་ ཆེ་བ་ དག་པ་ -ས་ ཀྱང་ བདག་ཅག་ ཆེས་ ཆེ་ -འོ་ སྙམ་ དུ་ བདག་ ལ་ རློམ་སེམས་ སུ་ བྱེད་པ་ །

source: They take their five aggregates, from form to consciousness, as constituting I. They consider what has not been attained and think “I have attained it.”
bo: གཟུགས་ ལ་ བདག་ ཏུ་ ཁས་ལེན་པ་ ནས་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ བར་ ལ་ བདག་ ཏུ་ ཁས་ལེན་པ་ ། མ་ ཐོབ་པ་ -ར་ བདག་ ལ་ ཐོབ་པ་ སྙམ་ དུ་ ཤེས་པ་ །

source: They reflect upon themselves and think “We are superior.” And they believe that their wrong views are correct.
bo: བདག་ཅག་ ནི་ འཕགས་པ་ -འོ་ སྙམ་ དུ་ བདག་ ལ་ སེམས་པ་ ། ལོག་པ་ -འི་ ལྟ་བ་ ལ་ ཡང་དག་པ་ -འི་ ལྟ་བ་ -ར་ མོས་པ་ དག་ སྟེ

source: To help them abandon all forms of pride, I shall teach them the Dharma.
bo: ང་རྒྱལ་ གྱི་ རྣམ་པ་ ཐམས་ཅད་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings have followed evil paths and are separated from the noble path.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ལམ་ངན་པ་ -ར་ ཞུགས་པ་ ། འཕགས་པ་ -འི་ ལམ་ དང་ བྲལ་བ་ དག་ སྟེ

source: To help them abandon evil paths and find the noble path, I shall teach them the Dharma.
bo: ལམ་ངན་པ་ སྤང་ ཞིང་ འཕགས་པ་ -འི་ ལམ་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are the slaves of craving.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ སྲེད་པ་ -འི་ ཁོལ་པོ་

source: They are consumed by desire for wives, sons, and daughters.
bo: ཆུང་མ་ དང་ ། བུ་ ཕོ་ དང་ ། བུ་མོ་ ལ་ ཡོངས་སུ་ ཞེན་པ་ -ས་ སྦགས་པ་ །

source: They have no independence or self-assurance.
bo: རང་དབང་ མེད་པ་ -ས་ བདག་ ལ་ མི་ དཔོགས་པ་ དག་ སྟེ

source: To help them become independent, able to assert themselves, and dance with joy, I shall teach them the Dharma.
bo: རང་དབང་ ཡོད་ ཅིང་ བདག་ ལ་ དཔོགས་པ་ -ར་ བྱ་བ་ དང་ ། གར་ དགའ་བ་ -ར་ འགྲོ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are not in harmony with one another;
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ ཕན་ཚུན་ མི་ འཕྲོད་པ་ །

source: they are full of anger, hatred, and ill will.
bo: ཁྲོ་བ་ དང་ ། ཞེ་སྡང་ དང་ ། གནོད་སེམས་ མང་བ་ དག་ སྟེ

source: To help them abandon their anger, hatred, and ill will, I shall teach them the Dharma.
bo: ཁྲོ་བ་ དང་ ། ཞེ་སྡང་ དང་ ། གནོད་སེམས་ སྤང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings who are entangled with evil company and lack virtuous friends commit evil deeds.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ སྡིག་པ་ -འི་ གྲོགས་པོ་ -ས་ ཡོངས་སུ་ ཟིན་པ་ ། དགེ་བ་ -འི་ བཤེས་གཉེན་ དང་ བྲལ་བ་ ། སྡིག་པ་ -འི་ ལས་ བྱེད་པ་ དག་ སྟེ

source: In order for virtuous friends to take them on and to help them abandon evil companions, I shall teach them the Dharma.
bo: དགེ་བ་ -འི་ བཤེས་གཉེན་ གྱིས་ ཡོངས་སུ་ ཟིན་པ་ དང་ ། སྡིག་པ་ -འི་ གྲོགས་པོ་ ཡོངས་སུ་ སྤང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are overwhelmed by desire and attachment.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ བརྐམ་པ་ ། ཆགས་པ་ -ས་ ཟིལ་ གྱིས་ ནོན་པ་ །

source: They are discontent, and they are divorced from the state of the insight of the noble ones.
bo: ཆོག་ མི་ ཤེས་ ཤིང་ འཕགས་པ་ -འི་ ཤེས་རབ་ ཀྱི་ གནས་པ་ དང་ བྲལ་བ་ དག་ སྟེ

source: To help them abandon attachment and develop the knowledge of the noble ones, I shall teach them the Dharma.
bo: ཆགས་པ་ སྤངས་པ་ དང་ ། འཕགས་པ་ -འི་ ཤེས་རབ་ བསྐྱེད་པ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are entrenched in eternalistic and nihilistic views, and they think that actions do not have consequences.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ མེད་པ་ -ར་ ལྟ་ ཞིང་ རྟག་པ་ དང་ ཆད་པ་ ལ་ གནས་པ་ དག་ སྟེ

source: To guide them toward profound dependent arising and appropriate actions, I shall teach them the Dharma.
bo: རྟེན་ ཅིང་ འབྲེལ་བ་ -ར་ འབྱུང་བ་ ཟབ་མོ་ དང་ ། ལས་ དང་ ། བྱ་བ་ ལ་ གཟུད་པ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings who are blinded by ignorance and delusion cling to the notions of a self, a being, a life, a living being, an individual, and a person.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ མ་རིག་པ་ དང་ གཏི་མུག་ གིས་ ལྡོངས་པ་ ། བདག་ དང་ ། སེམས་ཅན་ དང་ ། སྲོག་ དང་ ། གསོ་བ་ དང་ ། སྐྱེས་བུ་ དང་ ། གང་ཟག་ ལ་ མངོན་པར་ ཞེན་པ་ དག་ སྟེ

source: To help them purify the eye of noble insight and abandon all views, I shall teach them the Dharma.
bo: འཕགས་པ་ -འི་ ཤེས་རབ་ ཀྱི་ མིག་ རྣམ་པ་ -ར་ དག་པ་ -ར་ བྱ་བ་ དང་ ། ལྟ་བ་ -ར་ གྱུར་པ་ ཐམས་ཅད་ སྤང་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings revel in saṃsāra and are captured by the executioner of the five aggregates.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ འཁོར་བ་ ལ་ མངོན་པར་ དགའ་བ་ ། ཕུང་པོ་ ལྔ་ -འི་ གཤེད་མ་ -ས་ ཡོངས་སུ་ ཟིན་པ་ དག་ སྟེ

source: In order to extricate them from all the three realms, I shall teach them the Dharma.
bo: ཁམས་ གསུམ་ ཐམས་ཅད་ ལས་ དབྱུང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings are tethered by Māra’s lasso and persist in cunning and conceit.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ བདུད་ ཀྱི་ ཞགས་པ་ -འི་ བཅིང་བ་ -ས་ བཅིངས་པ་ ། གཡོ་བ་ དང་ ། རློམ་སེམས་ ལ་ གནས་པ་ དག་ སྟེ

source: In order that they become liberated from all the tethers of Māra’s lasso and abandon cunning and conceit, I shall teach them the Dharma.
bo: བདུད་ ཀྱི་ ཞགས་པ་ -ས་ བཅིངས་པ་ ཐམས་ཅད་ ལས་ རྣམ་པ་ -ར་ དགྲོལ་བ་ དང་ ། གཡོ་ དང་ རློམ་སེམས་ སྤང་བ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “ ‘Alas, these beings have shut the gate to nirvāṇa and opened the gates to the evil destinies.
bo: ཀྱེ་མ་ སེམས་ཅན་ འདི་དག་ ནི་ མྱ་ངན་ ལས་ འདའ་བ་ -འི་ སྒོ་ བཅད་ ཅིང་ ། ངན་འགྲོ་ -འི་ སྒོ་ ཕྱེ་བ་ དག་ སྟེ

source: To help them open the gate to nirvāṇa and shut the gates to the evil destinies, I shall teach them the Dharma.’
bo: མྱ་ངན་ ལས་ འདའ་བ་ -འི་ སྒོ་ དབྱེ་བ་ དང་ ། ངན་འགྲོ་ -འི་ སྒོ་ བཅད་པ་ -འི་ ཕྱིར་ དེ་དག་ ལ་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་

source: “Son of noble family, great bodhisattva compassion for sentient beings arises in these sixteen ways.
bo: རིགས་ ཀྱི་ བུ་ རྣམ་པ་ བཅུ་དྲུག་པོ་ དེ་དག་ གིས་ སེམས་ཅན་ རྣམས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ སྐྱེ་ -འོ་ ། །

source: “Son of noble family, when bodhisattvas exert themselves in thirty-two distinct bodhisattva activities, they become performers of excellent conduct.
bo: རིགས་ ཀྱི་ བུ་ འདི་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ལས་མ་ འདྲེས་པ་ སུམ་ཅུ་རྩ་གཉིས་ ཏེ་ ། དེ་དག་ ལ་ བརྩོན་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ལེགས་པ་ -ར་ བྱེད་པ་ -འི་ ལས་ བྱེད་པ་ རྣམས་ ཡིན་ ནོ་ ། །

source: What are these thirty-two?
bo: སུམ་ཅུ་རྩ་གཉིས་ གང་ཞེ་ན་ །

source: “Seeing how sentient beings go astray due to the sleep of delusion, while they themselves are awakened through insight, bodhisattvas awaken beings through insight.
bo: སེམས་ཅན་ དག་ གཏི་མུག་ གི་ གཉིད་ ཀྱིས་ ལོག་པ་ དང་ ། བདག་ ཤེས་རབ་ ཀྱིས་ སད་པ་ མཐོང་ ནས་ ཤེས་རབ་ ཀྱིས་ སེམས་ཅན་ རྣམས་ སད་པ་ -ར་ བྱེད་པ་

source: This is the first distinct bodhisattva act.
bo: འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་མ་ འདྲེས་པ་ དང་པོ་ -འོ་ ། །

source: “Seeing how sentient beings aspire to the insignificant, while they themselves aspire to the vast, bodhisattvas establish beings in the Great Vehicle.
bo: སེམས་ཅན་ དག་ ཆུང་ངུ་ ལ་མོ་ -ས་པ་ དང་ ། བདག་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ -ར་ མཐོང་ ནས་ ཐེག་པ་ ཆེན་པོ་ ལ་ སེམས་ཅན་ རྣམས་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings desire what is not righteous, while they themselves abide in what is righteous, bodhisattvas establish beings in the desire for what is righteous.
bo: སེམས་ཅན་ དག་ ཆོས་མ་ ཡིན་པ་ འདོད་པ་ དང་ ། བདག་ ཆོས་ ལ་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཆོས་ འདོད་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing that the livelihoods of sentient beings are impure, while their own livelihoods are pure, bodhisattvas connect beings to pure livelihoods.
bo: སེམས་ཅན་ དག་ འཚོ་བ་ ཡོངས་སུ་ མ་ དག་པ་ དང་ ། བདག་ འཚོ་བ་ ཡོངས་སུ་ དག་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ འཚོ་བ་ ཡོངས་སུ་ དག་པ་ -ར་ སྦྱོར་བ་ དང་ །

source: “Seeing how sentient beings are sunk in views, while they establish themselves in correct views, bodhisattvas establish beings in the correct views of the noble ones.
bo: སེམས་ཅན་ དག་ ལྟ་བ་ -ར་ གྱུར་པ་ -ར་ བྱིང་བ་ དང་ ། བདག་ ཡང་དག་པ་ -འི་ ལྟ་བ་ -ར་ ཞུགས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ འཕགས་པ་ -འི་ ཡང་དག་པ་ -འི་ ལྟ་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing that sentient beings are ignorant and have amassed improper ways of thinking, yet cognizant that they themselves abide by proper mental activity that accords with reason, bodhisattvas establish beings in proper mental activity that accords with reason.
bo: སེམས་ཅན་ དག་མ་ རིག་པ་ -ར་ གྱུར་ ཅིང་ ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ བསགས་པ་ -ར་ མཐོང་ ཞིང་བདག་ རིག་པ་ -འི་ རྗེས་སུ་ འཐུན་པ་ -འི་ ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ ལ་ གནས་པ་ -ར་ རིག་ ནས་ སེམས་ཅན་ རྣམས་ རིག་པ་ -འི་ རྗེས་སུ་ འཐུན་པ་ -འི་ ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings have taken a stand on the wrong teachings, while they themselves have engaged the correct teachings, bodhisattvas teach beings the Dharma so that beings may practice these correct teachings.
bo: སེམས་ཅན་ དག་ ལོག་པ་ -འི་ ཆོས་ ལ་ གནས་པ་ དང་ ། བདག་ ཡང་དག་པ་ -འི་ ཆོས་ ལ་ ཞུགས་པ་ -ར་ མཐོང་ ནས་ ཡང་དག་པ་ -འི་ ཆོས་ བསྒྲུབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་པ་ དང་ །

source: “Seeing that sentient beings are stingy and possessive, while they themselves have renounced all possessions, bodhisattvas connect beings with the renunciation of all possessions.
bo: སེམས་ཅན་ དག་ སེར་སྣ་ ཅན་ དུ་ གྱུར་ ཏེ་ ཀུན་ ཏུ་ འཛིན་པ་ -འི་ སེམས་ དང་ ལྡན་པ་ དང་ ། བདག་ བདོག་པ་ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ བདོག་པ་ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ་ ལ་ སྦྱོར་བ་ དང་ །

source: “Seeing how sentient beings come to have evil characters and keep no moral commitments, while they themselves are established in pure morality, bodhisattvas establish beings in the commitments of morality.
bo: སེམས་ཅན་ དག་ ངང་ཚུལ་ ངན་པ་ ཅན་ དུ་ གྱུར་ ཏེསྡོམ་པ་ ལ་ མི་ གནས་པ་ དང་ ། བདག་ ཚུལ་ཁྲིམས་ ཡོངས་སུ་ དག་པ་ -ར་ གནས་ ནས་ ། སེམས་ཅན་ རྣམས་ ཚུལ་ཁྲིམས་ ཀྱི་ སྡོམ་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings harbor ill will and are very aggressive, while they themselves are established in the power of patience and love, bodhisattvas establish beings in the power of patience and benevolence.
bo: སེམས་ཅན་ དག་ གནོད་སེམས་ མང་ ཞིང་ ཁྲོ་བ་ ཤས་ ཆེ་བ་ དང་ ། བདག་ བཟོད་པ་ -འི་ སྟོབས་ དང་ ། བྱམས་པ་ ལ་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ བཟོད་པ་ -འི་ སྟོབས་ དང་ ། བྱམས་པ་ ལ་ གནས་པ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings are lazy and not very diligent, while they themselves are not lazy and apply themselves diligently, bodhisattvas connect beings with applying themselves diligently.
bo: སེམས་ཅན་ དག་ ལེ་ལོ་ ཅན་ དུ་ གྱུར་ ཏེབརྩོན་ འགྲུས་ ཆུང་བ་ དང་ ། བདག་ ལེ་ལོ་ མེད་ ཅིང་ བརྩོན་འགྲུས་ བརྩམས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ བརྩོན་འགྲུས་ རྩོམ་པ་ ལ་ སྦྱོར་བ་ དང་ །

source: “Seeing how sentient beings are distracted and how their mindfulness is weak, while they themselves have equipoise and are absorbed in concentration, bodhisattvas establish beings in a state where they are not distracted but are mindful and vigilant.
bo: སེམས་ཅན་ དག་ སེམས་ གཡེངས་ ཤིང་ དྲན་པ་ ཉམས་པ་ དང་ ། བདག་ མཉམ་པ་ -ར་ བཞག་ སྟེབསམ་ གཏན་ ལ་ བསམ་གཏན་ བྱེད་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ སེམས་ མི་ གཡེང་བ་ དང་ ། དྲན་པ་ དང་ ། ཤེས་བཞིན་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings’ understanding is impaired and how they are depraved and deluded, while they themselves are insightful and free of delusion, bodhisattvas establish beings in great wisdom and freedom from delusion.
bo: སེམས་ཅན་ དག་ ཤེས་རབ་ འཆལ་པ་ -ར་ གྱུར་ ཏེདམན་ ཞིང་ གཏི་མུག་ དང་ ལྡན་པ་ དང་ ། བདག་ ཤེས་རབ་ དང་ ལྡན་ ཞིང་ གཏི་མུག་ དང་ བྲལ་བ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཤེས་རབ་ ཆེན་པོ་ དང་ ། གཏི་མུག་ དང་ བྲལ་བ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings have fallen into the unsuitable and thus commit terrible deeds, while they themselves possess skillful means and perform correct deeds, bodhisattvas establish beings in skillful means and the performance of correct deeds.
bo: སེམས་ཅན་ དག་ རིགས་པ་ མ་ཡིན་པ་ -ར་ ལྷུང་ ཞིང་ ཡ་ང་བ་ -འི་ བྱེད་པ་ བརྩམས་པ་ དང་ ། བདག་ ཐབས་མཁས་པ་ དང་ ལྡན་ ཞིང་ ཡང་དག་པ་ -འི་ ལས་ བརྩམས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཐབས་མཁས་པ་ དང་ ། ཡང་དག་པ་ -འི་ ལས་རྩོམ་པ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings are overpowered by afflictive emotions and how their world thus consists in imagination, conceptualization, and reification, while they themselves have turned away from all afflictive emotions, bodhisattvas establish beings in the abandoning of all afflictive emotions.
bo: སེམས་ཅན་ དག་ ཉོན་མོངས་པ་ -ས་ བཅོམ་ ཞིང་ ཀུན་ ཏུ་ རྟོག་པ་ དང་ ། རྣམ་པ་ -ར་ རྟོག་པ་ དང་ ། ཡོངས་སུ་ རྟོག་པ་ -འི་ སྤྱོད་ཡུལ་པ་ -ར་ གྱུར་པ་ དང་ ། བདག་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ལས་ལོག་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཉོན་མོངས་པ་ ཐམས་ཅད་ སྤོང་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are fettered by the shackles of personalistic views and thus dwell in objectification, while they themselves have fully understood these personalistic views and thus become free from being fettered by objectification, bodhisattvas connect beings with fully understanding personalistic views and freedom from objectification.
bo: སེམས་ཅན་ དག་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ -འི་ བཅིང་བ་ -ས་ བཅིངས་ ཤིང་ དམིགས་པ་ ལ་ རབ་ཏུ་ གནས་པ་ དང་ ། བདག་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ ཡོངས་སུ་ ཤེས་པ་ དང་ ལྡན་ ཞིང་ དམིགས་པ་ -ས་ བཅིངས་པ་ ལས་ ཡོངས་སུ་ གྲོལ་བ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ འཇིག་ཚོགས་ ལ་ ལྟ་བ་ ཡོངས་སུ་ ཤེས་པ་ དང་ དམིགས་པ་ དང་ བྲལ་བ་ ལ་ སྦྱོར་བ་ དང་ །

source: “Seeing that sentient beings are undisciplined, immodest and unrefined, while they themselves are disciplined, modest, and refined, bodhisattvas establish beings in discipline, modesty, and refinement.
bo: སེམས་ཅན་ དག་མ་ དུལ་ ཞིང་ མ་ སྦ་ -ས་ ཏེ་ བྱང་བ་ མ་ཡིན་པ་ དང་ ། བདག་ དུལ་ ཞིང་ སྦ་ -ས་ ཏེ་ བྱང་བ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ དུལ་བ་ དང་ ། སྦས་པ་ དང་ ། བྱང་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings do not remember or acknowledge what has been done for them and destroy their roots of virtue, while they themselves remember and acknowledge what has been done for them and protect their roots of virtue, bodhisattvas establish beings in remembering and acknowledging what has been done for them and not letting their roots of virtue go to waste.
bo: སེམས་ཅན་ དག་ བྱས་པ་ མི་ གཟོ་ ཞིང་ བྱས་པ་ མི་ ཤེས་ ཏེདགེ་བ་ -འི་ རྩ་བ་ འཇོམས་པ་ དང་ ། བདག་ བྱས་པ་ གཟོ་ ཞིང་ བྱས་པ་ ཤེས་ ཏེ་ དགེ་བ་ -འི་ རྩ་བ་ བསྲུང་བ་ -ར་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ བྱས་པ་ གཟོ་བ་ དང་ ། བྱས་པ་ ཤེས་པ་ དང་ ། དགེ་བ་ -འི་ རྩ་བ་ ཆུད་ མི་ གཟོན་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings have fallen into the torrent and are under the influence of the desire to sin, while they themselves have crossed over all rivers, bodhisattvas connect beings to crossing over all rivers.
bo: སེམས་ཅན་ དག་ ཆུ་བོ་ -ར་ ལྷུང་ ཞིང་ སྡིག་པ་ འདོད་པ་ -འི་ དབང་ དུ་ སོང་བ་ དང་ ། བདག་ ཆུ་བོ་ ཐམས་ཅད་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཆུ་བོ་ ཐམས་ཅད་ ལས་ ཡང་དག་པ་ -ར་ འདའ་བ་ ལ་ སྦྱོར་བ་ དང་ །

source: “Seeing how sentient beings do not delight in and fail to comply with words of advice, while they themselves delight in and comply with words of advice, bodhisattvas establish beings in delighting in and complying with words of advice.
bo: སེམས་ཅན་ དག་ བཀའ་བློ་ མི་ བདེ་ ཞིང་ འཐུན་པ་ -ར་ འཛིན་པ་ མ་ཡིན་པ་ དང་ ། བདག་ བཀའ་བློ་ བདེ་ ཞིང་ འཐུན་པ་ -ར་ འཛིན་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ བཀའ་བློ་ བདེ་ ཞིང་ འཐུན་པ་ -ར་ འཛིན་པ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings are destitute and cling to what is ignoble, while they themselves are not destitute and dwell in deathless virtue, bodhisattvas connect beings with freedom from clinging and abiding by the roots of virtue.
bo: སེམས་ཅན་ དག་ ཕོངས་པ་ མང་ ཞིང་ དམ་པ་ མ་ཡིན་པ་ ལ་ ཡོངས་སུ་ ཞེན་པ་ དང་ ། བདག་ མ་ ཕོངས་པ་ མང་ ཞིང་ དགེ་བ་ བདུད་རྩི་ ལ་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཡོངས་སུ་ ཞེན་པ་ དང་ བྲལ་ ཞིང་ དགེ་བ་ -འི་ རྩ་བ་ ལ་ གནས་པ་ -ར་ སྦྱོར་བ་ དང་ །

source: “Seeing how sentient beings are poor and lack the wealth of the noble ones, while they themselves do not lack the wealth of the noble ones and are endowed with the seven riches, bodhisattvas establish beings in attaining the wealth of the noble ones.
bo: སེམས་ཅན་ དག་ དབུལ་ ཞིང་ འཕགས་པ་ -འི་ ནོར་ དང་ བྲལ་བ་ དང་ ། བདག་ འཕགས་པ་ -འི་ ནོར་ དང་ མ་ བྲལ་ ཞིང་ ནོར་ བདུན་ དང་ ལྡན་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ འཕགས་པ་ -འི་ ནོར་ ཐོབ་པ་ -ར་ བྱ་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are constantly ill and ensnared by the venomous snakes of the four elements, while they themselves are never ill and always healthy, bodhisattvas establish beings in abandoning all forms of illness.
bo: སེམས་ཅན་ དག་ རྟག་ ཏུ་ ན་ ཞིང་ཁམས་ རྣམ་པ་ བཞི་པོ་ -འི་ སྦྲུལ་ གདུག་པ་ -ས་ ཟིན་པ་ དང་ ། བདག་ ནད་མེད་ ཅིང་ བདེ་ ལ་ འགྱུར་བ་ མེད་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ནད་ ཐམས་ཅད་ སྤོང་བ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing that sentient beings are enveloped by the darkness of unknowing and lack the illumination of wisdom, while they themselves have attained the illumination of wisdom, bodhisattvas establish beings in the great illumination of wisdom.
bo: སེམས་ཅན་ དག་ མི་ ཤེས་པ་ -འི་ མུན་པ་ -ས་ ཀུན་ ཏུ་ གཏིབས་ ཤིང་ ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ དང་ བྲལ་བ་ དང་ ། བདག་ ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ ཐོབ་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ཡེ་ཤེས་ ཀྱི་ སྣང་བ་ ཆེན་པོ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are bound by attachment to the three realms and plunge into the five states of existence within the wheel of saṃsāra, while knowing that they themselves are skilled in the full understanding of the three realms, bodhisattvas establish beings in the skill of the full understanding of the three realms.
bo: སེམས་ཅན་ དག་ ཁམས་ གསུམ་ ལ་ ཆགས་པ་ -ས་ ཆགས་ ཤིང་ རྒྱུད་ ལྔ་ -འི་ འགྲོ་བ་ -འི་ འཁོར་བ་ -འི་ འཁོར་ལོ་ -འི་ རྗེས་སུ་ འཇུག་པ་ མཐོང་ ཞིང་བདག་ ཁམས་ གསུམ་ ཡོངས་སུ་ ཤེས་པ་ ལ་ མཁས་པ་ -ར་ ཤེས་ ནས་ སེམས་ཅན་ རྣམས་ ཁམས་ གསུམ་ ཡོངས་སུ་ ཤེས་པ་ ལ་ མཁས་པ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ དང་ །

source: “Seeing how sentient beings have embarked on wrong paths and diverged from the right path, while they themselves are established on the right path, bodhisattvas establish beings on the right path.
bo: སེམས་ཅན་ དག་ གཡོན་ཕྱོགས་ ཀྱི་ ལམ་ དུ་ ཞུགས་ཤིང་ གཡས་ཕྱོགས་ ཀྱི་ ལམ་ དང་ བྲལ་བ་ དང་ ། བདག་ གཡས་ཕྱོགས་ ཀྱི་ ལམ་ ལ་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ གཡས་ཕྱོགས་ ཀྱི་ ལམ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are attached to their bodies and lives and fail to perceive their faults, while they themselves pay no heed to their bodies and lives and see their own inadequacies, bodhisattvas establish beings in paying no attention to their bodies and lives and seeing their own inadequacies.
bo: སེམས་ཅན་ དག་ ལུས་ དང་ སྲོག་ ལ་ ཆགས་ ཤིང་ ཉེས་པ་ མ་ མཐོང་བ་ དང་ ། བདག་ ལུས་ དང་ སྲོག་ ལ་ མི་ ལྟ་ ཞིང་ ཉེས་པ་ མཐོང་བ་ ཡིན་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ལུས་ དང་ སྲོག་ ལ་ མི་ལྟ་བ་ དང་ ། ཉེས་པ་ མཐོང་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are separated from the Buddha, Dharma, and Saṅgha, while they themselves are immersed in the unbroken lineage of the Three Jewels, bodhisattvas lead beings into the unbroken lineage of the Three Jewels.
bo: སེམས་ཅན་ དག་ སངས་རྒྱས་ དང་ ། ཆོས་ དང་ ། དགེ་འདུན་ དང་ བྲལ་བ་ དང་ ། བདག་ དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ -ར་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ དཀོན་མཆོག་ གསུམ་ གྱི་ རིགས་ རྒྱུན་ མི་ གཅོད་པ་ ལ་ འཛུད་པ་ དང་ །

source: “Seeing how sentient beings fall away from the excellent Dharma, while they themselves persist in upholding the excellent Dharma, bodhisattvas establish beings in upholding the excellent Dharma.
bo: སེམས་ཅན་ རྣམས་ དམ་པ་ -འི་ ཆོས་ ལས་ ཉམས་པ་ དང་ ། བདག་ དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ འཛིན་པ་ -ར་ གནས་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ དམ་པ་ -འི་ ཆོས་ ཡོངས་སུ་ འཛིན་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings live far from precious teachers and lack the six recollections, while they themselves never give up the six recollections, bodhisattvas establish beings in cultivating the six recollections.
bo: སེམས་ཅན་ དག་ སྟོན་པ་ རིན་པོ་ཆེ་ དང་ རིང་ དུ་ གནས་ ཤིང་ ། རྗེས་སུ་ དྲན་པ་ དྲུག་ དང་ བྲལ་བ་ དང་ ། བདག་ རྗེས་སུ་ དྲན་པ་ དྲུག་ མ་ བཏང་བ་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ རྗེས་སུ་ དྲན་པ་ དྲུག་ བསྒོམ་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings are obscured by the veils of karma and afflictive emotions, while they themselves are free from karma and afflictive emotions, bodhisattvas establish beings in the freedom from karma and afflictive emotions.
bo: སེམས་ཅན་ དག་ ལས་ དང་ ཉོན་མོངས་པ་ -འི་ སྒྲིབ་པ་ -ས་ བསྒྲིབས་པ་ དང་ ། བདག་ ལས་ དང་ ཉོན་མོངས་པ་ དང་ བྲལ་བ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ ལས་ དང་ ཉོན་མོངས་པ་ དང་ བྲལ་བ་ ལ་ རབ་ཏུ་ འགོད་པ་ དང་ །

source: “Seeing how sentient beings possess all nonvirtuous qualities and have abandoned all virtuous qualities, while they themselves have abandoned all nonvirtuous qualities and possess all virtuous qualities, bodhisattvas establish beings in the abandoning of all nonvirtuous qualities and the perfection of all virtuous qualities.
bo: སེམས་ཅན་ དག་ མི་དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ དང་ ལྡན་ ཞིང་ དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ སྤངས་པ་ དང་ ། བདག་ མི་དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ སྤངས་ ཤིང་ ། དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ དང་ ལྡན་པ་ -ར་ མཐོང་ ནས་ སེམས་ཅན་ རྣམས་ མི་དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ སྤོང་བ་ དང་ ། དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་པ་ ལ་ རབ་ཏུ་ འགོད་པ་ སྟེ་ །

source: “Son of noble family, these thirty-two bodhisattva activities constitute the preeminence of bodhisattvas.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ སུམ་ཅུ་རྩ་གཉིས་པོ་ འདི་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཡང་དག་ ཕུལ་ ཡིན་ ཏེ་ །

source: Once bodhisattvas are established in these, they are agents of excellent deeds.
bo: དེ་དག་ ལ་ གནས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ལེགས་པ་ -ར་ བྱེད་པ་ -འི་ ལས་ བྱེད་པ་ རྣམས་ ཡིན་ ནོ་ ། །

source: “Son of noble family, the conduct of bodhisattvas is immeasurable.
bo: རིགས་ ཀྱི་ བུ་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ལས་ ནི་ ཚད་ མེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Son of noble family, as many possibilities of pollution as there are among sentient beings, bodhisattvas can accomplish that many possibilities of purification.
bo: རིགས་ ཀྱི་ བུ་ སེམས་ཅན་ རྣམས་ ཀྱི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ སྒོ་ ཇི་སྙེད་ པར་བྱང་ ཆུབ་ སེམས་དཔའ་ -ས་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ སྒོ་ ཡང་དག་པ་ -ར་ བསྒྲུབ་པ་ -ར་ བྱ་བ་ ཡང་ དེ་སྙེད་ དོ་ ། །
