Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: Then the light rays invited the bodhisattva Sovereign of Powerful Reverberating Sound to come. He resided in a buddhafield situated in the west, called Illuminated, of the Tathāgata Illuminator. As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: དེ་ནས་ ནུབ་ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ནས་ སྣང་བ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ དང་ ལྡན་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སྒྲ་ བསྒྲགས་པ་ -འི་ སྟོབས་ ཀྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of pearl necklaces.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ ནོར་བུ་ མུ་ཏིག་ གི་ དོ་ཤལ་ གྱི་ ཕྲེང་བ་ -འི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Your physical actions resemble the domain of space.
bo: ཁྱོད་ ཀྱི་ སྐུ་ ཡི་ འཕྲིན་ལས་ ནམ་མཁའ་ -འི་ ཁམས་ འདྲ་ ཞིང་ ། །

source: Your virtuous prayer is endowed with boundless purity.
bo: སྨོན་ལམ་ དགེ་བ་ -ས་ དག་པ་ བྱེ་བ་ ཕྲག་ མང་ ལྡན་ ། །

source: Since it is stainless, pure, and without defilements,
bo: དྲི་མེད་ རྣམ་པ་ -ར་ དག་ ཅིང་ ཟག་པ་ མེད་པ་ དེ་ -ས་ ། །

source: It purifies the inconceivable buddhafields of the ten directions.
bo: ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཞིང་ རྣམས་ བསམ་ གྱིས་ མི་ ཁྱབ་ གསལ་ ། །

source: “Your speech is steady, illuminating, and coherent.
bo: ཁྱོད་ ཀྱི་ ཚིག་ ནི་ རྒྱུན་ཆགས་ གསལ་ ཞིང་ མཚུངས་པ་ སྟེ་ ། །

source: It appeases the dispositions of beings with uniformity of thought.
bo: འགྲོ་བ་ བསམ་ དག་ བསམ་པ་ མཉམ་ཉིད་ ཡོངས་ ཚིམ་ བགྱིད་ ། །

source: Even though there is not the slightest mental movement or conception,
bo: སེམས་ ཀྱི་ རྒྱུ་ དང་ རྣམ་རྟོག་ གང་ཡང་ མི་ མངའ་ ཡང་ ། །

source: Victors arise in the minds of sentient beings.”
bo: སེམས་ཅན་ བསམ་པ་ རྣམས་ ལ་ རྒྱལ་བ་ དག་ གི་ འབྱུང་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the western corner of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ནུབ་ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Ocean of Supreme Intelligence to come. He resided in a buddhafield situated in the north, called Fully Adorned with Jewels, of the Tathāgata Countless Qualities Precious Courage.
bo: དེ་ནས་ བྱང་ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡས་ རིན་ཆེན་ སྤོབས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ་ ཐམས་ཅད་ ཀྱིས་ སྤྲས་པ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བློ་ མཆོག་ རྒྱ་མཚོ་ ཞེས་ བྱ་བ་

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of crystals and jewels.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ ནོར་བུ་ -འི་ དོ་ཤལ་ དང་ རིན་པོ་ཆེ་ -འི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Your golden body is like refined gold from the Jambu River.
bo: འཛམ་བུ་ -འི་ ཆུ་ གསེར་ བཙོ་མ་ ལྟ་བུ་ -ར་ སེར་བ་ -འི་ སྐུ་ ། །

source: Possessing the all-seeing eye, it shines throughout the ten directions.
bo: ཀུན་ ནས་ སྤྱན་ མངའ་ ཕྱོགས་ བཅུ་ དག་ ཏུ་ རྣམ་པ་ -ར་ མཛེས་ ། །

source: The beings who think of this unique form
bo: མཚུངས་མེད་ སྐུ་ ལ་ སེམས་ཅན་ གང་དག་ ངེས་ རྟོག་པ་ ། །

source: Will achieve flawless bliss and joy.
bo: དེ་དག་ སྐྱོན་མེད་ བདེ་ ཞིང་ དགའ་བ་ ཐོབ་པ་ -ར་ འགྱུར་ ། །

source: “Even when one gazes upon the Victor, The unique knower of the world, as tall as Mount Meru,
bo: གང་ གིས་ ལྷུན་པོ་ བརྩེགས་པ་ ལྟ་བུ་ -འི་ ཁྲུན་ ཙམ་ དུ་ ། ། འཇིག་རྟེན་ མཁྱེན་པ་ མཚུངས་མེད་ རྒྱལ་བ་ བལྟས་ ཀྱང་ ནི་ ། །

source: Because of the force of all his miraculous powers and the display of his energy One is unable to see this Victor’s crown protuberance.”
bo: དེ་ ཡི་ རྫུ་འཕྲུལ་ ཀུན་ གྱི་ སྟོབས་ དང་ བརྩོན་འགྲུས་ ཀྱི་ ། ། རྣམ་པ་ -ར་ སྤྲུལ་པ་ -ས་ རྒྱལ་བ་ -འི་ སྤྱི་གཙུག་ མཐོང་ མི་ ནུས་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northern corner of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ བྱང་ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Illuminator to come. He resided in a buddhafield situated in the southeast, called Sorrowless, of the Tathāgata Conqueror of All Sorrow.
bo: དེ་ནས་ ཤར་ དང་ ལྷོ་ -འི་ མཚམས་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་ ཐམས་ཅད་ བཅོམ་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་མེད་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ཀུན་ ནས་ སྣང་བ་ ཞེས་ བྱ་བ་ འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ །

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ་ །

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ ། དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of jewels.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ རིན་པོ་ཆེ་ -འི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Although each of your bodily hairs contains boundless buddhafields, Neither the beings nor the fields themselves are compressed.
bo: སྤུ་ ཡིས་ མཐའ་ དབུང་ མ་ མཆིས་པ་ ཡི་ ཞིང་ འཛིན་ ཀྱང་ ། ། སེམས་ཅན་ རྣམས་ ལ་ མི་ གནོད་ ཞིང་ ལ་ མི་ གནོད་པ་ -ས་ ། །

source: Hence those without eyes to see find it difficult to fathom the domain of the Victor.
bo: མིག་ མེད་ རྣམས་ ཀྱིས་ རྒྱལ་བ་ -འི་ སྤྱོད་ཡུལ་ འཚལ་བ་ -ར་ དཀའ་ ། །

source: The children of the Buddha know it correctly through the benevolence of the Victor.
bo: སངས་རྒྱས་ སྲས་ ནི་ རྒྱལ་བ་ -འི་ བྱིན་ གྱིས་ ཡང་དག་ འཚལ་ ། །

source: “The Buddha demonstrates a multiplicity of fields in the space of a single field.
bo: ཞིང་ གཅིག་ ཕྱོགས་ ལ་ ཞིང་ མང་ རབ་ འབྱམ་ སྟོན་ མཛད་ དེ་ ། །

source: Although he displays this, there is neither increase nor decrease.
bo: ཀུན་ ཏུ་ བསྟན་ ཀྱང་ རྣམ་པ་ -ར་ འཕེལ་ དང་ འགྲིབ་ མ་ མཆིས་ ། །

source: To those who are suited to it and whose intentions are great,
bo: བསམ་པ་ ཆེན་པོ་ དག་ ལྡན་ ཅི་འདྲ་ -ར་ གྱུར་ དེ་ ལ་ ། །

source: He demonstrates it through the display of his vast miraculous powers.”
bo: དཔག་མེད་ རྫུ་འཕྲུལ་ རྣམ་པ་ -ར་ སྤྲུལ་པ་ -ས་ དེ་ སྟོན་ ཏོ་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southeastern area of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ཤར་ དང་ ལྷོ་ -འི་ ཕྱོགས་མཚམས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Mind of Great Compassion to come. He resided in a buddhafield situated it the southwest, called Virtuous Eye, of the Tathāgata Gazing at All Beings with Great Compassion.
bo: དེ་ནས་ ལྷོ་ དང་ ནུབ་ ཀྱི་ མཚམས་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐུགས་རྗེ་ ཆེན་པོ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ གཟིགས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མིག་ བཟང་པོ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སྙིང་རྗེ་ ཆེན་པོ་ སེམས་པ་ ཞེས་ བྱ་བ་

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ་ །

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of fine robes.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ ན་བཟའ་ -འི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Just like a noble person who uses a flywhisk to chase away flies,
bo: སེམས་ཅན་ དམ་པ་ གཡག་རྔ་ ཐོགས་པ་ ཇི་བཞིན་ དུ་ ། །

source: The Buddha protects his stainless moral conduct as if it were a valuable jewel.
bo: ཚུལ་ཁྲིམས་ དྲི་མེད་ ནོར་བུ་ རིན་ཆེན་ འདྲ་བ་ སྲུང་ ། །

source: When the protector gazes at those without moral conduct, he feels compassion.
bo: ཚུལ་ཁྲིམས་ མེད་ གཟིགས་ མགོན་པོ་ ཤིན་ཏུ་ ཐུགས་རྗེ་ ཞིང་ ། །

source: He neither praises himself nor denigrates others.
bo: བདག་ ལ་ བསྟོད་པ་ མི་ མཛད་ གཞན་ ལ་ སྨོད་ མི་ མཛད་ ། །

source: “Like Meru, you are a stable, weighty, and vast support.
bo: ལྷུན་པོ་ ཇི་བཞིན་ ཁྱོད་ བརྟན་ བླ་མ་ རྒྱ་ ཆེན་ སྟེན་ ། །

source: Like the depths of the ocean, you are exceedingly difficult to fathom.
bo: ཆུ་གཏེར་ ཟབ་མོ་ བཞིན་ དུ་ ཤིན་ཏུ་ གཏིང་དཔག་ དཀའ་ ། །

source: You have cast aside the primeval fetters of existence.
bo: སྲིད་པ་ ཐོག་མ་ -ར་ བཅིངས་པ་ ཀུན་ ནས་ གྲོལ་བ་ སྟེ་ ། །

source: You have liberated multitudes of beings from the fetters brought about by great flaws.”
bo: སེམས་ཅན་ ཁྲག་ཁྲིག་ ཉེས་པ་ ཆེན་པོ་ -ས་ བཅིངས་ ལས་ གྲོལ་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the southwestern area of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ལྷོ་ དང་ ནུབ་ ཀྱི་ མཚམས་ ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Light-Web Bearer to come. He resided in a buddhafield situated in the northwest, called Free of Darkness, of the Tathāgata Sovereign Light Display. As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: དེ་ནས་ ནུབ་ དང་ བྱང་ གི་ མཚམས་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ བཀོད་པ་ -འི་ རྒྱལ་པོ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མུན་པ་ དང་ བྲལ་བ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ཟེར་ དྲ་བ་ ཅན་ ཞེས་ བྱ་བ་ འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ་ །

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of ornaments.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ རྒྱན་ གྱི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Because you understand the nature of existence to be the nature of a mirage,
bo: སྲིད་པ་ -འི་ རང་བཞིན་ སྒྱུ་མ་ -འི་ རང་བཞིན་ རྟོགས་ མཛད་ ནས་ ། །

source: You reveal that actions are like illusions and lack substance.
bo: བྱེད་པ་ སྒྱུ་མ་ ལྟ་བུ་ དངོས་པོ་ མེད་པ་ -ར་ སྟོན་ ། །

source: Even though you train the domains of beings, which are like a mirage,
bo: སྒྱུ་མ་ ལྟ་བུ་ སེམས་ཅན་ ཁམས་ ནི་ འདུལ་ མཛད་ ཀྱང་ ། །

source: Neither the domains nor the sentient beings exist for you.
bo: འདི་ ན་ སེམས་ཅན་ རང་བཞིན་ མ་ མཆིས་ ཁམས་ མ་ མཆིས་ ། །

source: “To give an analogy, in the dream of a sleeping person
bo: དཔེར་ན་ མི་ ཞིག་ གཉིད་ ཀྱིས་ ལོག་པ་ -འི་ རྨི་ལམ་ ན་ ། །

source: The perception that sees form is not true seeing.
bo: གཟུགས་ མཐོང་ ཡང་དག་ འདུ་ཤེས་ དེ་བཞིན་ མཐོང་ མ་ ལགས་ ། །

source: You teach that conditioned things lack substance, like a dream.
bo: འདུས་བྱས་ དངོས་པོ་ མ་ མཆིས་ རྨི་ལམ་ འདྲ་བ་ -ར་ གསུང་ ། །

source: Even though phenomena manifest, they do not come into being.”
bo: ཆོས་ རྣམ་སྣང་ ཡང་ འདི་ ན་ ཆོས་ ལ་ ཆགས་ མ་ མཆིས་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northwestern area of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ ། ནུབ་ དང་ བྱང་ གི་ མཚམས་ ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Immaculate Limitless Intelligence to come. He resided in a buddhafield situated in the northeast, called Pure Immaculate Dwelling, of the Tathāgata Immaculate Center of the Sky.
bo: དེ་ནས་ བྱང་ དང་ ཤར་ གྱི་ མཚམས་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ ནམ་མཁའ་ -འི་ དཀྱིལ་ དྲི་མ་ མེད་པ་ རྣམ་པ་ -ར་ སེམས་པ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོངས་ དག་ དྲི་མ་ མེད་པ་ -ར་ རབ་ཏུ་ གནས་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ བློ་ མཐའ་ ཡས་ དྲི་མེད་ ཅེས་བྱ་བ་

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ ། སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of continuously sounding cymbals.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ རྟག་ ཏུ་ སྒྲ་ འབྱུང་བ་ -འི་ སིལ་སྙན་ གྱི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “Skilled in profound Dharma and intent on peace,
bo: ཟབ་མོ་ -འི་ ཆོས་ ལ་ མཁས་ ཤིང་ རབ་ཏུ་ ཞི་ ལ་མོ་ -ས་ ། །

source: You know all phenomena to be empty and without conceptual signs.
bo: ཁྱོད་ ཀྱིས་ ཆོས་ ཀུན་ སྟོང་ ཞིང་ མཚན་མ་ མེད་པ་ -ར་ མཁྱེན་ ། །

source: No one in the world can discern the intent of your mind;
bo: ཁྱོད་ ཀྱི་ ཐུགས་ ཀྱི་ དགོངས་པ་ འཇིག་རྟེན་ ཀུན་ མ་འཚལ་ ། །

source: With vast intelligence, you understand the mind’s thought processes.
bo: མཐའ་ ཡས་ བློ་ མངའ་ སེམས་ ཀྱི་ བསམ་པ་ ཆོ་ག་ མཁྱེན་ ། །

source: “Just as you know the behavior of one being,
bo: སེམས་ཅན་ གཅིག་ གི་ སྤྱོད་ བཞིན་ སེམས་ཅན་ ཀུན་ གྱི་ སྤྱོད་ ། །

source: You know the behaviors of all beings within the three times.
bo: གང་དག་ དུས་གསུམ་ ལྡན་པ་ དེ་དག་ ཁྱོད་ ཀྱིས་ མཁྱེན་ ། །

source: Without entertaining the notion of a being, you have mastered the full knowledge
bo: སེམས་ཅན་ འདུ་ཤེས་ མི་ འཇུག་ སེམས་ ཀྱི་ འདུ་ཤེས་ མུན་ ། །

source: Of the perceptions of those whose mental perception is obscured.”
bo: འདུ་ཤེས་ ཡོངས་ཤེས་ མཁས་ ཤིང་ མཉམ་པ་ཉིད་ དང་ ལྡན་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the northeastern area of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ བྱང་ དང་ ཤར་ གྱི་ ཕྱོགས་མཚམས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Ornamental Display of Courage to come. He resided in a buddhafield situated in the nadir, called Appearing as Illumination, of the Tathāgata Glory of the Precious Red Lotus.
bo: དེ་ནས་ འོག་ གི་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ཨུཏྤ་ ལ་ དམར་པོ་ -འི་ དཔལ་ གྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་པ་ -ར་ སྣང་བྱེད་ དུ་ སྣང་བ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སྤོབས་པ་ -འི་ རྒྱན་ བཀོད་པ་ ཞེས་ བྱ་བ་

source: As the light rays reached him, bodhisattvas as numerous as sand grains in the ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: They circumambulated him ten thousand times and in worship draped the Blessed One with filigrees of garlands from the isle of precious jewels.
bo: བཅོམ་ལྡན་འདས་ ལ་ ལན་ ཁྲི་ བསྐོར་བ་ བྱས་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ མཆོད་པ་ -འི་ ལས་ བྱེད་ ཅིང་ ནོར་བུ་ རིན་པོ་ཆེ་ -འི་ གླིང་ གི་ ཕྲེང་ གི་ དྲ་བ་ -ས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བཀབ་ སྟེ་ །

source: Then they praised him with these words:
bo: ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “As many atoms as there are in the multitude of buddhafields,
bo: གལ་ཏེ་ ཁྲག་ཁྲིག་ ཞིང་ ན་ ཇི་སྙེད་ རྡུལ་ མཆིས་པ་ ། །

source: That many children of the tathāgatas have come together in front of the Victor.
bo: དེ་སྙེད་ བདེ་གཤེགས་ སྲས་པོ་ རྒྱལ་བ་ -འི་ དྲུང་ ལྷགས་ ཏེ་ ། །

source: With a single timely reply, he answers all the questions they pose
bo: བསྐལ་པ་ བྱེ་བ་ སྟོང་ མང་ ཞུ་བ་ ཞུས་པ་ དག་ །

source: In the course of millions of eons.
bo: དེ་དག་ ཐམས་ཅད་ ཚིག་ གཅིག་ དུས་ ཀྱིས་ གོ་བ་ -ར་ མཛད་ ། །

source: “You have accomplished intellectual skills and wisdom.
bo: བློ་ ལ་ མཁས་པ་ རབ་ རྫོགས་ ཤེས་རབ་ ཤིན་ཏུ་ རྫོགས་ ། །

source: Your retention, perfect absorption, and merit are vast.
bo: གཟུངས་ དང་ ཏིང་འཛིན་ རབ་ རྫོགས་ བསོད་ནམས་ མཐའ་ ཡས་ ཏེ་ ། །

source: Even if we were to articulate eulogies for a vast number of eons,
bo: བསྐལ་པ་ མང་པོ་ མཐའ་ ཡས་ བསྔགས་པ་ རབ་ བརྗོད་ ཀྱང་ ། །

source: They would be insufficient, just as the tip of a hair cannot hold an ocean.”
bo: སྐྲ་རྩེ་ -ས་ རྒྱ་མཚོ་ ཇི་བཞིན་ ཟད་པར་ མི་ ནུས་ སོ་ ། །

source: Once the bodhisattvas had praised the Blessed One with countless bodhisattva eulogies, they withdrew to the lower part of the pavilion and sat down upon seats created by their own miraculous power.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ བསྟོད་པ་ ཚད་ མེད་པ་ དག་ གིས་ བཅོམ་ལྡན་འདས་ ལ་ མངོན་པར་ བསྟོད་ ནས་ འོག་ གི་ ཕྱོགས་ ལོགས་ སུ་ གནས་ ཏེ་ ། རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ ཀྱིས་ སྤྲུལ་པ་ -འི་ རང་རང་ གི་ སྟན་ དག་ ལ་ འཁོད་ དོ་ ། །

source: Then the light rays invited the bodhisattva Sovereign Who Emanates All Phenomena to come. He resided in a buddhafield situated in the zenith, called Adorned by Ornaments, of the Tathāgata Sovereign of Supreme Reverberating Sound.
bo: དེ་ནས་ སྟེང་ གི་ ཕྱོགས་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྒྲ་ བསྒྲགས་ མཆོག་ གི་ རྒྱལ་པོ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྒྱན་ གྱིས་ བརྒྱན་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཐམས་ཅད་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ -འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་

source: As the light rays reached him, as many bodhisattvas as there are grains of sand in ten Ganges rivers surrounded and followed him in honor.
bo: འོད་ དེ་ -ས་ བསྐུལ་མ་ ཐག་ ཏུ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ ཀླུང་ བཅུ་ -འི་ བྱེ་མ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ མདུན་ དུ་ བདར་ ཏེ

source: They all left that buddhafield together and arrived in an instant in this world system of Endurance.
bo: ལྷན་ཅིག་ ཏུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ་ -ར་ གྱུར་ ནས་ སྐད་ཅིག་ ཐང་ ཅིག་ ཡུད་ཙམ་ དེ་ ལ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ -ར་ ཕྱིན་ ཏེ་ །

source: Once they had approached the Blessed One inside the pavilion Jeweled Array, they prostrated at his feet.
bo: འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ -ར་ བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ འདུག་ ནས་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །
