Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: And thus bring satisfaction to vast numbers of beings.
bo: སེམས་ཅན་ ཁྲག་ཁྲིག་ དག་ ནི་ ཚིམ་པ་ -ར་ བྱེད་ ། །

source: “ ‘Brave ones abiding in this dhāraṇī Turn the wheel of the sacred Dharma
bo: གཟུངས་ འདི་ ལ་ ནི་ གནས་པ་ -འི་ དཔའ་བོ་ དག་ ། འཁོར་ལོ་ དམ་པ་ རབ་ཏུ་ སྐོར་ བྱེད་ ཅིང་ ། །

source: And thus free beings from their sundry forms of suffering, Setting them in the excellent vehicle.
bo: སེམས་ཅན་ སྡུག་བསྔལ་ སྣ་ཚོགས་ རྣམས་ ལས་ འགྲོལ་ ། ། ཐེག་པ་ དམ་པ་ ལ་ ཡང་ འཇོག་པ་ -ར་ བྱེད་ ། །

source: “ ‘The great sages may, for many eons, Praise and extoll its qualities, But they will not manage to express The full extent of its qualities.’
bo: བསྐལ་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ མང་པོ་ -ར་ ནི་ ། ། བསྔགས་ དང་ ཡོན་ཏན་ ལེགས་པ་ བརྗོད་བྱ་ -ས་ ཀྱང་ ། ། དྲང་སྲོང་ ཆེན་པོ་ -ས་ དེ་ ཡི་ ཡོན་ཏན་ གྱི་ ། ། མཐའ་མ་ བརྗོད་ དུ་ ནུས་པ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: “As the Blessed Tathāgata Stainless Illumination gave this dhāraṇī teaching, thirty-two thousand bodhisattvas within the great bodhisattva assembly attained the dhāraṇī, among them the bodhisattva mahāsattva Glorious Light.
bo: རིགས་ ཀྱི་ བུ་ དེ་ལྟར་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ་ -ར་ སྣང་བ་ དེ་ -ས་ གཟུངས་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ འཁོར་ ཆེན་པོ་ དེ་ལས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྟོང་ཕྲག་ སུམ་ཅུ་རྩ་གཉིས་ ཀྱིས་ གཟུངས་ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ དཔལ་ གྱིས་ ནི་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ འདི་ ཐོབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: Dhāraṇīśvara­rāja, you may reflect or wonder, doubt, or regard with skepticism whether the bodhisattva of this period known as Glorious Light was someone else, but you should not!
bo: གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཁྱོད་ དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ ། བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ ཞེས་ བྱ་བ་ -ར་ གྱུར་པ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ དོགས་ ཤིང་ ཡིད་གཉིས་ སུ་ གྱུར་ ཏམ་ ། ཐེ་ཚོམ་ ཟ་བ་ ལྟ་ ན་ ། ཁྱོད་ ཀྱིས་ དེ་ལྟར་ མི་ བལྟ་ -འོ་ ། །

source: Why not?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because really you yourself were the bodhisattva of that period known as Glorious Light!
bo: ཁྱོད་ ཉིད་ དེ་ -འི་ ཚེ་ དེ་ -འི་ དུས་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ འོད་ དཔལ་ ཞེས་ བྱ་བ་ -ར་ གྱུར་ ཏེ་ །

source: Dhāraṇīśvara­rāja, you have requested countless tathāgatas since time immemorial for this analysis of dhāraṇī.
bo: གཟུངས་ ཀྱི་ དབང་ཕྱུག་ གི་ རྒྱལ་པོ་ ཁྱོད་ ཀྱིས་ དེ་ ཚུན་ཆད་ བགྲང་བ་ ལས་ འདས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ དག་ ལ་ གཟུངས་ རྣམ་པ་ -ར་ ངེས་པ་ འདི་ ཡོངས་སུ་ དྲིས་ སོ་ ། །

source: You have made such an inquiry.
bo: ཡོངས་སུ་ དྲི་བ་ བྱས་ སོ་ ། །

source: “That is why you again have made a request to the Tathāgata and have fearlessly delivered this dhāraṇī analysis.
bo: དེས་ན་ ཁྱོད་ ད་ལྟར་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཡོངས་སུ་ འདྲི་བ་ དེ་ལྟར་ འཇིགས་པ་ མེད་ ཅིང་ གཟུངས་ ཀྱི་ རྣམ་པ་ -ར་ ངེས་པ་ འདི་ -འང་ སྟོན་ ཏོ་ ། །

source: Since you have realized this Dharma with your all-seeing intelligence, with this discourse I declare you to be supreme among bodhisattvas endowed with mindfulness and among the bodhisattvas who have attained dhāraṇī.”
bo: ཁྱོད་ ཀུན་ དུ་ ལྟ་བ་ -འི་ བློ་ -ས་ ཆོས་ འདི་ མངོན་སུམ་ དུ་ གྱུར་པ་ -ས་ རྣམ་ གྲངས་ འདི་ -ས་ ན་ ངས་ ཁྱོད་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུངས་ཐོབ་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ དྲན་པ་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ མཆོག་ ཏུ་ བསྟན་ ཏོ་ ། །

source: At this point, a bodhisattva known as Prajñākūṭa, who was present in that assembly, asked,
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ ཞེས་ བྱ་བ་ འཁོར་ དེ་ཉིད་ དུ་ འདུག་པ་ -ར་ གྱུར་པ་ དེ་ -ས་ ། བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “How, Blessed One, do bodhisattvas attain this jewel lamp dhāraṇī?
bo: བཅོམ་ལྡན་འདས་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ སྒྲོན་མ་ -འི་ གཟུངས་ འདི་ རབ་ཏུ་ ཐོབ་ ཅིང་ །

source: And having attained it, how do they avoid losing it?
bo: ཐོབ་ ནས་ ཀྱང་ ཆབ་ འཚལ་བ་ -ར་ མི་ བགྱིད་པ་ དང་ ། འདི་ལྟ་སྟེ་ །

source: And having generated the power of the dhāraṇī, how do they sustain all sentient beings?”
bo: གཟུངས་ ཀྱི་ སྟོབས་ བསྐྱེད་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཉེ་བར་ འཚོ་བ་ ལགས་ །

source: The Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “Son of noble family, when bodhisattvas abide by the sources of insight and perform the functions of insight, they will attain this dhāraṇī.
bo: རིགས་ ཀྱི་ བུ་ གང་ གི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ ལ་ གནས་པ་ -ར་ གྱུར་པ་ དང་ ། ཤེས་རབ་ ཀྱི་ ལས་ བྱེད་པ་ -ར་ གྱུར་པ་ དེ་ -འི་ ཚེ་ གཟུངས་ འདི་ རབ་ཏུ་ འཐོབ་བོ་ ། །

source: There is no doubt about it.
bo: ཆུད་ ཟ་བ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: They will nurture all beings.”
bo: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉེ་བར་ འཚོ་བ་ -ར་ ཡང་ འགྱུར་ རོ་ ། །

source: Prajñākūṭa asked in turn,
bo: བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Blessed One, what are the sources and functions of insight? Please explain it to me.”
bo: བཅོམ་ལྡན་འདས་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ ནི་ གང་ ལགས་ ། ཤེས་རབ་ ཀྱི་ ལས་ ནི་ གང་ ལགས་ ། དེ་བཞིན་ གཤེགས་པ་ -ས་ ལེགས་པ་ -ར་ བཤད་ དུ་ གསོལ་ །

source: The Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: “Because of your request, son of noble family, listen carefully and bear in mind what I tell you. These are the sources of insight and their corresponding functions:
bo: དེ་ -འི་ ཕྱིར་ རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཤིན་ཏུ་ ལེགས་པ་ -ར་ ཉོན་ ལ་ ཡིད་ ལ་ ཟུང་ ཤིག་ དང་ ། ངས་ ཁྱོད་ ལ་ བཤད་པ་ -ར་ བྱ་ -འོ་ ། །

source: Son of noble family, listening to teachings not yet heard is a source of insight.
bo: རིགས་ ཀྱི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ མ་ ཐོས་པ་ -འི་ ཆོས་ ཉན་པ་ གང་ཡིན་པ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to teach others the Dharma one has heard in detail.
bo: ཇི་ལྟར་ ཐོས་པ་ -འི་ ཆོས་ གཞན་དག་ ལ་ རྒྱ་ ཆེ་ -ར་ ཡང་དག་པ་ -ར་ སྟོན་པ་ གང་ཡིན་པ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Investigation is a source of insight.
bo: དཔྱོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to teach others what one has investigated.
bo: གང་ དཔྱད་པ་ གཞན་དག་ ལ་ཉེ་ བར་སྟོན་པ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Proper discernment is a source of insight.
bo: ཚུལ་བཞིན་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to establish beings in what is appropriate.
bo: སེམས་ཅན་ རྣམས་ ཚུལ་བཞིན་ ལ་ རབ་ཏུ་ དགོད་པ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Application is a source of insight.
bo: ཡང་དག་པ་ -ར་ སྦྱོར་བ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to accomplish.
bo: ཡང་དག་པ་ -ར་ སྒྲུབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Thinking decisively about mind is a source of insight.
bo: སེམས་ ལ་ ངེས་པར་ སེམས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to teach decisive thinking about mind.
bo: སེམས་ ལ་ ངེས་པར་ སེམས་པ་ ཡང་དག་པ་ -ར་ སྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Dwelling in solitude is a source of insight.
bo: རབ་ཏུ་ དབེན་པ་ -ར་ གནས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know how to isolate body and mind.
bo: ལུས་ དང་སེམས་ དབེན་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Delighting in solitude is a source of insight.
bo: གཅིག་པུ་ -ར་ དགའ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to accomplish a solitary path.
bo: གཅིག་པུ་ -ར་ བགྲོད་པ་ -འི་ ལམ་ སྒྲུབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Cultivating tranquil abiding and special insight is a source of insight.
bo: ཞི་གནས་ དང་ ལྷག་མཐོང་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to attain awareness and liberation.
bo: རིག་པ་ དང་ རྣམ་པ་ -ར་ གྲོལ་བ་ འཐོབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Cultivating the three liberations is a source of insight.
bo: རྣམ་པ་ -ར་ ཐར་པ་ གསུམ་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to realize threefold awareness.
bo: རིག་པ་ གསུམ་ མངོན་སུམ་ དུ་ བྱེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Cultivating the application of mindfulness is a source of insight.
bo: དྲན་པ་ ཉེ་བར་ གཞག་པ་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is the absence of mindfulness and mental activity.
bo: དྲན་པ་ མེད་ ཅིང་ ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Cultivating abandonment is a source of insight.
bo: ཡང་དག་པ་ -ར་ སྤོང་བ་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know all phenomena to be naturally abandoned.
bo: ཆོས་ ཐམས་ཅད་ རང་བཞིན་ གྱིས་ སྤངས་པ་ -ར་ རབ་ཏུ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Cultivating the bases of miraculous powers is a source of insight.
bo: རྫུ་འཕྲུལ་ གྱི་ རྐང་པ་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to attain miraculous power without manifestation.
bo: མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ རྫུ་འཕྲུལ་ ཐོབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Confidence with faithful devotion is a source of insight.
bo: དད་པ་ -ས་ མོས་ ཏེ་ ཡིད་ཆེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to transcend all attachments.
bo: ཆགས་པ་ ཐམས་ཅད་ ལས་ ཡང་དག་པ་ -ར་ འདའ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Dauntlessness is a source of insight.
bo: སེམས་ མི་ འཇུམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to be well trained in body and mind.
bo: ལུས་ དང་སེམས་ ཤིན་ཏུ་ སྦྱངས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Mindfulness and introspection are sources of knowledge.
bo: དྲན་པ་ དང་ ཤེས་བཞིན་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Their function is to attend to what is to be recollected.
bo: དྲན་པ་ -ར་ བྱ་བ་ རྗེས་སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Gaining realization in the levels of meditative absorption is a source of insight.
bo: ཏིང་ངེ་འཛིན་ རིམ་གྱིས་ རྗེས་སུ་ རྟོགས་པ་ -ར་ བྱེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to attain constant presence in equipoise.
bo: རྟག་ ཏུ་ མཉམ་པ་ -ར་ བཞག་པ་ -ར་ གནས་པ་ འཐོབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Relying on the faculty of insight is itself a source of insight.
bo: ཤེས་རབ་ ཀྱི་ དབང་པོ་ ལ་ སྟེན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know which faculties are best and which are not.
bo: དབང་པོ་ མཆོག་ དང་ མཆོག་མ་ ཡིན་པ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Knowing the five strengths is a source of insight.
bo: སྟོབས་ ལྔ་ -འི་ གནས་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is not to be crushed by evil and afflictive emotions.
bo: བདུད་ དང་ ཉོན་མོངས་པ་ -ས་ མི་ རྫི་བ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Harmoniously accepting the factors of awakening is a source of insight.
bo: བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ རྗེས་སུ་ འཐུན་པ་ -འི་ བཟོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to harmoniously realize the nature of all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ རང་བཞིན་ རྗེས་སུ་ རྟོགས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Practicing the branches of the path is a source of insight.
bo: ལམ་ གྱི་ ཡན་ལག་ ཡང་དག་པ་ -ར་ སྒྲུབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is not to be partisan toward Dharma or non-Dharma by understanding that all teachings are like rafts.
bo: ཆོས་ ཐམས་ཅད་ གཟིངས་ ལྟ་བུ་ -ར་ ཤེས་ ནས་ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ ལ་ མི་ གནས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Familiarizing oneself with suffering and its origin, cessation, and the path is a source of insight.
bo: སྡུག་བསྔལ་ དང་ ། ཀུན་འབྱུང་བ་ དང་ ། འགོག་པ་ དང་ ། ལམ་ སྒོམ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to actualize cessation.
bo: འགོག་པ་ མངོན་སུམ་ དུ་ བྱེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Mastering the sūtras of provisional meaning is a source of insight.
bo: དྲང་བ་ -འི་ དོན་ གྱི་ མདོ་སྡེ་ ཀུན་ ཆུབ་པ་ -ར་ བྱེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to rely on the sūtras of definitive meaning.
bo: ངེས་པ་ -འི་ དོན་ གྱི་ མདོ་སྡེ་ ལ་ རྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Retaining everything that one has learned is a source of insight.
bo: ཐོས་པ་ ཐམས་ཅད་ འཛིན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to rely on the meaning.
bo: དོན་ ལ་ རྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Investigating consciousness is a source of insight.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ ལ་སོ་ སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to rely on wisdom.
bo: ཡེ་ཤེས་ ལ་ རྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Not clinging to the words of an individual is a source of insight.
bo: གང་ཟག་ གི་ སྒྲ་ ལ་ མངོན་པར་ ཞེན་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to rely on the nature of reality.
bo: ཆོས་ཉིད་ ལ་ རྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Discerning that all karmic formations are impermanent is a source of insight.
bo: འདུ་བྱེད་ ཐམས་ཅད་ མི་རྟག་པ་ -ར་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know fundamental nonorigination.
bo: གདོད་མ་ ནས་ མ་ སྐྱེས་པ་ -ར་ རབ་ཏུ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Comprehending analytically that all formations are painful is a source of insight.
bo: འདུ་བྱེད་ ཐམས་ཅད་ སྡུག་བསྔལ་ བར་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know that all phenomena are not actually conditioned.
bo: ཆོས་ ཐམས་ཅད་ མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Discerning that phenomena are selfless is a source of insight.
bo: ཆོས་ ཐམས་ཅད་ ལ་ བདག་མེད་པ་ -ར་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know that beings are primordially pure.
bo: སེམས་ཅན་ གཟོད་མ་ ནས་ རྣམ་པ་ -ར་ དག་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Discerning that nirvāṇa is peace is a source of insight.
bo: མྱ་ངན་ ལས་ འདས་པ་ ལ་ ཞི་བ་ -ར་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know that all phenomena are nirvāṇa by nature.
bo: ཆོས་ ཐམས་ཅད་ རང་བཞིན་ གྱིས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Being unintimidated when one hears the truth is a source of insight.
bo: དོན་ ཐོས་ ནས་ སྐྲག་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to have special awareness of the truth.
bo: དོན་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being unintimidated when one hears of the nature of reality is a source of insight.
bo: ཡང་དག་པ་ -འི་ ཆོས་ཉིད་ ཐོས་ ནས་ སྐྲག་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to have special awareness of all phenomena.
bo: ཆོས་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ རིག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being unintimidated by any etymologies is a source of insight.
bo: ངེས་པ་ -འི་ ཚིག་ ཐམས་ཅད་ ལ་ སྐྲག་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to have special awareness of etymologies.
bo: ངེས་པ་ -འི་ ཚིག་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being unintimidated when one hears the Buddha’s eloquence is a source of insight.
bo: སངས་རྒྱས་ ཀྱི་ སྤོབས་པ་ ཐོས་ ནས་ སྐྲག་པ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to have special awareness of eloquence.
bo: སྤོབས་པ་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Feeling love toward beings and phenomena is a source of insight.
bo: སེམས་ཅན་ ལ་ དམིགས་པ་ དང་ ། ཆོས་ ལ་ དམིགས་པ་ -འི་ བྱམས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to experience nonreferential love.
bo: དམིགས་པ་ མེད་པ་ -འི་ བྱམས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Acting compassionately toward oneself and others is a source of insight.
bo: བདག་ ལ་ བྱེད་པ་ དང་ ། གཞན་ ལ་ བྱེད་པ་ ལ་ སྙིང་རྗེ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to experience great compassion that dissolves duality.
bo: མཐའ་ གཉི་ག་ བསལ་བ་ -འི་ སྙིང་རྗེ་ ཆེན་པོ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Delighting in cultivating supreme joy when attending to the Dharma is a source of insight.
bo: ཆོས་ ལ་ སེམས་པ་ ལ་ མཆོག་ ཏུ་ དགའ་བ་ -ར་ བྱེད་པ་ -འི་ དགའ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to be without acceptance and rejection.
bo: བླང་བ་ མེད་པ་ དང་ དོར་བ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being impartial, free from attachment or aversion, is a source of insight.
bo: རྗེས་སུ་ ཆགས་པ་ དང་ ། ཁོང་ཁྲོ་བ་ དང་ བྲལ་བ་ -འི་ བཏང་སྙོམས་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to be free from duality.
bo: གཉིས་ དང་ བྲལ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting the Buddha is a source of insight.
bo: སངས་རྒྱས་ རྗེས་སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know dharmakāya.
bo: ཆོས་ ཀྱི་ སྐུ་ རབ་ཏུ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting the Dharma is a source of insight.
bo: ཆོས་རྗེ་ -ས་ སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know the nature of reality beyond attachment.
bo: འདོད་ཆགས་ དང་ བྲལ་བ་ -འི་ ཆོས་ཉིད་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting the Saṅgha is a source of insight.
bo: དགེ་འདུན་ རྗེས་སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to comprehend it analytically as being unconditioned.
bo: འདུས་མ་བྱས་ སུ་ སོ་སོ་ -ར་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting generosity is a source of insight.
bo: གཏོང་བ་ རྗེས་སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to let go of all afflictive emotions.
bo: ཉོན་མོངས་པ་ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting moral conduct is a source of insight.
bo: ཚུལ་ཁྲིམས་ རྗེས་སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know that moral conduct is not actually something to be accumulated.
bo: ཚུལ་ཁྲིམས་ མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Recollecting the gods is a source of insight.
bo: ལྷ་རྗེ་ -ས་ སུ་ དྲན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is the pure nature of reality.
bo: རྣམ་པ་ -ར་ དག་པ་ -འི་ ཆོས་ཉིད་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Comprehending what one has learned is a source of insight.
bo: ཐོས་པ་ ལ་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to comprehend all worlds.
bo: འཇིག་རྟེན་ ཐམས་ཅད་ ལ་ རྟོག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Performing deeds to be done is a source of insight.
bo: མ་ བྱས་པ་ -འི་ ལས་ བྱེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know the maturation of actions to be nonexistent.
bo: ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ མེད་པ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being without pride is a source of insight.
bo: ང་རྒྱལ་ མེད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to attain great wisdom.
bo: ཡེ་ཤེས་ ཆེན་པོ་ ཐོབ་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Benefiting oneself is a source of insight.
bo: བདག་ གི་ དོན་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to benefit both oneself and others.
bo: གཉི་ག་ -འི་ དོན་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Upholding the eighty-four thousand Dharma teachings is a source of insight.
bo: ཆོས་ ཀྱི་ ཕུང་པོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཀུན་ དུ་ འཛིན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to know the eighty-four thousand Dharma teachings.
bo: ཆོས་ ཀྱི་ ཕུང་པོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ ཡོངས་སུ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Knowing Dharma teachings is a source of insight.
bo: ཆོས་ བསྟན་པ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to teach Dharma successfully.
bo: འབྲས་བུ་ ཡོད་པ་ -འི་ ཆོས་སྟོན་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Inspiring beings to embrace awakening is a source of insight.
bo: སེམས་ཅན་ རྣམས་ བྱང་ཆུབ་ ཡང་དག་པ་ -ར་ འཛིན་ དུ་ འཇུག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to place beings on the level of nonregression through the perfection of insight and skillful means.
bo: ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ ཐབས་མཁས་པ་ -ས་ སེམས་ཅན་ རྣམས་ ཕྱིར་ མི་ ལྡོག་པ་ -འི་ ས་ ལ་ རབ་ཏུ་ དགོད་པ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Being apprehensive of any birth as a being in worldly existence is a source of insight.
bo: སྲིད་པ་ -ར་ འགྲོ་བ་ -ར་ སྐྱེ་བ་ ཐམས་ཅད་ ཀྱིས་ སྐྲག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to be born according to one’s intentions.
bo: བསམས་ བཞིན་ དུ་ སྐྱེ་བ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Acceptance that accords with language is a source of insight.
bo: སྒྲ་ -འི་ རྗེས་སུ་ འགྲོ་བ་ -འི་ བཟོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is acceptance that rises from cultivation.
bo: བསྒོམ་པ་ ལས་ བྱུང་བ་ -འི་ བཟོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: “Understanding decay is a source of insight.
bo: ཟད་པ་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to understand nonorigination.
bo: མི་ སྐྱེ་བ་ -ར་ ཤེས་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Willing acceptance is a source of insight.
bo: རྗེས་སུ་ འཐུན་པ་ -འི་ བཟོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to accept the unborn nature of phenomena.
bo: མི་ སྐྱེ་བ་ -འི་ ཆོས་ ལ་ བཟོད་པ་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: The level of nonregression is a source of insight.
bo: ཕྱིར་ མི་ ལྡོག་པ་ -འི་ ས་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is the level of empowerment.
bo: དབང་ བསྐུར་བ་ -འི་ ས་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: Sitting down on the seat of awakening is a source of insight.
bo: བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ ལ་ འདུག་པ་ ནི་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ -འོ་ ། །

source: Its function is to perfectly awaken to unsurpassed complete and perfect awakening through insight that thinks, in a single moment, of everything whatsoever that is to be known, learned, realized, and perfectly awakened to.”
bo: གང་ཅི་ ཤེས་པ་ -ར་ བྱ་བ་ དང་ ། ཐོས་པ་ -ར་ བྱ་བ་ དང་ ། རྟོགས་པ་ -ར་ བྱ་བ་ དང་ ། མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ -ར་ བྱ་བ་ ། དེ་ ཐམས་ཅད་ སེམས་ ཀྱི་ སྐད་ཅིག་ གཅིག་ དང་ ལྡན་པ་ -འི་ ཤེས་རབ་ ཀྱིས་ ། བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ལས་ སོ་ ། །

source: As this account of the sources and functions of insight was delivered, the countless unfathomable buddhafields of the ten directions trembled six times, as did the pavilion made of jewels.
bo: ཤེས་རབ་ ཀྱི་ རྩ་བ་ དང་ལས་ བསྟན་པ་ འདི་ བཤད་པ་ ན་ ། ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་ ། དཔག་ ཏུ་ མེད་པ་ དག་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་པ་ -ར་ གྱུར་ ཏོ་ ། ། འཁོར་ གྱི་ ཁྱམས་ རིན་པོ་ཆེ་ བཀོད་པ་ ཡང་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་ སོ་ ། །

source: Prajñākūṭa asked the Blessed One,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “What has caused these countless, unfathomable buddhafields of the ten directions, as well as this pavilion hovering in the sky, to tremble six times?”
bo: བཅོམ་ལྡན་འདས་ གང་ གིས་ ། ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་ མ་ མཆིས་ ། དཔག་ ཏུ་ མ་ མཆིས་པ་ འདི་དག་ རབ་ཏུ་གཡོ་ -ས་པ་ -ར་ གྱུར་པ་ དང་ ། ནམ་མཁའ་ ལ་ གནས་པ་ -འི་ འཁོར་ གྱི་ ཁྱམས་ འདི་ ཡང་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་པ་ -ར་ གྱུར་པ་ -འི་ རྒྱུ་ གང་ ལགས་ ། རྐྱེན་ གང་ ལགས་ །

source: The Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: “Son of noble family, when the tathāgatas of the past previously explained this Dharma discourse on the sources and functions of insight, upon your request and inquiry, son of noble family, it caused the great world to tremble and the earth to quake in the very space that holds it.”
bo: རིགས་ ཀྱི་ བུ་ ཤེས་རབ་ ཀྱི་ རྩ་བ་ དང་ ། ལས་ བསྟན་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ། འདས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱིས་ སྔོན་ བཤད་པ་ ན་ ། རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཉིད་ ཀྱིས་ ནམ་མཁའ་ ཡོངས་སུ་ འཛིན་པ་ འདི་ཉིད་ དུ་ ། དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ལ་ ཡོངས་སུ་ དྲིས་ ཤིང་ ཡོངས་སུ་ དྲི་བ་ བྱས་ ཏེ་ ། ས་ ཆེན་པོ་ གཡོས་པ་ འཇིག་རྟེན་ དུ་ བྱུང་བ་ -འི་ རྒྱུ་ ནི་ འདི་ ཡིན་ ནོ་ ། ། རྐྱེན་ ནི་ འདི་ ཡིན་ ནོ་ ། །

source: Then a bodhisattva called Prati­bhāna­pratisaṃvid asked the Blessed One,
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སོ་སོ་ ཡང་དག་པ་ -ར་ རིག་པ་ ལ་ སྤོབས་པ་ ཞེས་ བྱ་བ་ -ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Blessed One, why is the bodhisattva Prajñākūṭa called Prajñākūṭa?”
bo: བཅོམ་ལྡན་འདས་ ཅིའི་སླད་དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཤེས་རབ་ བརྩེགས་ ལ་ ཤེས་རབ་ བརྩེགས་ ཞེས་ བགྱི་ །

source: The Blessed One replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །
