Repository: OpenPecha-Data/8dec69d62bfd479db29e3b49bceb85cf
Catalog: *.po
Languages: bo

source: “ ‘The victors observe those who hear the guiding Dharma and apply themselves correctly, Becoming noble, cool, and free of illness and reaching a state of peace; Hearing the Dharma, they think, “I will also cross the ocean of existence And arrive at the state of transcendent bliss.”
bo: གང་དག་ འདྲེན་པ་ -འི་ ཆོས་ ཐོས་ ནས་ ནི་ ཚུལ་བཞིན་ རབ་ སྦྱོར་བ་ ། ། དམ་པ་ བསིལ་བ་ -ར་ གྱུར་པ་ རིམས་ མེད་ ཞི་བ་ -འི་ གནས་ ལ་ རེག་ ། གང་ཡང་ བདག་ ཀྱང་ ཆོས་ ཐོས་ ནས་ ནི་ སྲིད་པ་ -འི་ རྒྱ་མཚོ་ ལས་ ། ། བརྒལ་ ཏེ་ བདེ་བ་ ཕ་རོལ་ ཕྱིན་པ་ དེ་དག་ རྒྱལ་བ་ -ས་ གཟིགས་ ། །

source: “ ‘The tathāgatas’ pure and unstained divine vision Observes all beings present in very subtle bodies As well as the endless masses of beings invisible to the divine vision Of guhyakas, śrāvakas, pratyekabuddhas, and bodhisattvas.
bo: གསང་བ་པ་ དང་ ཉན་ཐོས་ རང་རྒྱལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡི་ ། ། ལྷ་ མིག་ལམ་ དུ་མ་ གྱུར་ སེམས་ཅན་ ཁམས་ ནི་ མཐའ་ ཡས་ གང་ ། ། དེ་བཞིན་ གཤེགས་པ་ -འི་ ལྷ་ མིག་ རྣམ་དག་ དྲི་མ་ མེད་པ་ ཡིས་ ། ། སེམས་ཅན་ ཀུན་ གྱི་ ལུས་ཕྲ་ ཤིན་ཏུ་ གནས་པ་ རྣམས་ ཀྱང་ གཟིགས་ ། །

source: “ ‘The victors observe the subtle realms of beings in Jambudvīpa,
bo: གང་ཡང་ ཕང་ལོ་ ཙམ་ ལ་ སེམས་ཅན་ ཁམས་ ཕྲ་ རྒྱལ་བ་ -ས་ གཟིགས་ ། །

source: Those whom the various beings, god or human, in the great many trichiliocosms do not see.
bo: དེ་ ནི་ ཆེས་ མང་ སྟོང་གསུམ་ ལྷ་ མི་ སྐྱེ་དགུ་ དེ་ལྟ་ མིན་ ། །

source: They know the endless cycling of the mass of beings through vast destinies, Yet beings do not have any conception of their all-encompassing vision.
bo: འགྲོ་བ་ ཡངས་པ་ དག་ ན་ སེམས་ཅན་ ཁམས་ འཁོར་མཐའ་ ཡས་པ་ ། ། རབ་ཏུ་ ཤེས་ ཀྱང་ ཐམས་ཅད་ གཟིགས་ ལ་ སེམས་ཅན་ འདུ་ཤེས་ མེད་ ། །

source: “ ‘Even though the world protectors teach the supreme Dharma Before those tathāgatas’ trainees who have sharp faculties, Beings in other crowds do not see the tathāgatas at all.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ འདུལ་བ་ -འི་ སེམས་ཅན་ དབང་པོ་ རྣོ་བ་ གང་ ། ། དེ་ ཡི་ མདུན་ ན་ འཇིག་རྟེན་ མགོན་པོ་ ཆོས་མཆོག་ གསུང་ ཡང་ ནི་ ། ། སེམས་ཅན་ ཚོགས་ གཞན་ གང་ གིས་ ཀྱང་ ནི་ དེ་བཞིན་ གཤེགས་ མི་ མཐོང་ ། །

source: This is the activity of the power of the guides’ divine vision.’
bo: འདི་ ནི་ འདྲེན་པ་ -འི་ ལྷ་ ཡི་ མིག་ གི་ སྟོབས་ ཀྱི་ འཕྲིན་ལས་ ཡིན་ ། །

source: “Son of noble family, the tathāgatas have accomplished perfection. Through their own superknowledge they have actualized the nonexistence of contaminants and the liberation of their minds: ‘Due to the depletion of all contaminants, rebirth has come to an end. I have relied on pure conduct and done what had to be done, and I will not know any other existence after this one.’
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ ཟག་པ་ ཐམས་ཅད་ ཟད་པ་ -ས་ བདག་ སྐྱེ་བ་ ནི་ ཟད་ ། ཚངས་པ་ -ར་ སྤྱོད་པ་ ནི་ བསྟེན་ ། བྱ་བ་ ནི་ བྱས་ ཏེ་ ། འདི་ ལས་ སྲིད་པ་ གཞན་ མི་ ཤེས་ སོ་ ཞེས་ ཟག་པ་ མེད་པ་ ། སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ ། རང་ གི་ མངོན་པར་ ཤེས་པ་ -ས་ མངོན་སུམ་ དུ་ བྱས་ ནས་ རྫོགས་པ་ -ར་ བྱས་ ཏེ་ གནས་ སོ་ ། །

source: “The tathāgata knowledge of the depletion of contaminants is pure, stainless, completely pure, luminous, and destroys all karmic traces.
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཟག་པ་ ཟད་པ་ མཁྱེན་པ་ དེ་ ནི་ དག་པ་ ། དྲི་མ་ མེད་པ་ ། ཡོངས་སུ་ དག་པ་ ། འོད་གསལ་བ་ ། བག་ཆགས་ ཀྱིས་ མཚམས་ སྦྱོར་བ་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་པ་ -འོ་ ། །

source: The śrāvaka depletion of contaminants is limited and does not destroy the karmic traces.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ ཟག་པ་ ཟད་པ་ ནི་ ཚད་ ཡོད་པ་ -འི་ བག་ཆགས་ ལེགས་པ་ -ར་ མ་ བཅོམ་པ་ -འོ་ ། །

source: The pratyekabuddha depletion of contaminants is also limited and is lacking in great compassion and courage.
bo: རང་ སངས་རྒྱས་ རྣམས་ ཀྱི་ ཟག་པ་ ཟད་པ་ ནི་ ཚད་ ཡོད་པ་ ། སྙིང་རྗེ་ ཆེན་པོ་ དང་ བྲལ་བ་ ། སྤོབས་པ་ དང་ བྲལ་བ་ -འོ་ ། །

source: “The tathāgata depletion of contaminants is supreme in every respect.
bo: དེ་བཞིན་ གཤེགས་པ་ -འི་ ཟག་པ་ ཟད་པ་ ནི་ རྣམ་པ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ དང་ ལྡན་པ་ དང་ །

source: It destroys all karmic traces.
bo: བག་ཆགས་ ཀྱིས་ མཚམས་ སྦྱོར་བ་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་པ་ །

source: It is sustained by great compassion.
bo: སྙིང་རྗེ་ ཆེན་པོ་ -ས་ ཀུན་ དུ་ བཟུང་བ་ །

source: It is not lacking in fearlessness or courage.
bo: མི་ འཇིགས་པ་ དང་ སྤོབས་པ་ དང་ མ་ བྲལ་བ་ །

source: It is unsurpassed in all worlds.
bo: འཇིག་རྟེན་ ཐམས་ཅད་ ཀྱི་ ཟིལ་ གྱིས་ མི་ ནོན་པ་ སྟེ་ །

source: It consists of a single mental moment.
bo: སེམས་ ཀྱི་ སྐད་ཅིག་ གཅིག་ དང་ ལྡན་པ་ -འོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: For the tathāgatas, there are no karmic traces of actions, afflictive emotions, or deluded conduct.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ལས་ ཀྱི་ བག་ཆགས་ མེད་ ། ཉོན་མོངས་པ་ -འི་ བག་ཆགས་ མེད་ ། སྤྱོད་ལམ་ འཁྲུལ་པ་ -འི་ བག་ཆགས་ མེད་ དོ་ ། །

source: To illustrate, since space is pure by nature, it is impossible for dust particles and smoke to coexist with it.
bo: འདི་ལྟ་སྟེ་ ། དཔེར་ན་ ནམ་མཁའ་ རང་བཞིན་ གྱིས་ ཡོངས་སུ་ དག་པ་ -ས་ རྡུལ་ དང་ དུ་བ་ དང་ ལྷན་ཅིག་ མི་ གནས་པ་

source: In the same way, it is impossible for the tathāgata knowledge of the depletion of contaminants to coexist with the karmic traces of actions or afflictive emotions.
bo: དེ་བཞིན་ དུ་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ ཟག་པ་ ཟད་པ་ མཁྱེན་པ་ དེ་ཡང་ ལས་ དང་ ཉོན་མོངས་པ་ -འི་ བག་ཆགས་ ཐམས་ཅད་ དང་ ལྷན་ཅིག་ མི་ གནས་ སོ་ ། །

source: Thus, as soon as the knowledge of the depletion of contaminants is present, they teach the Dharma to afflicted and grasping sentient beings so that they in turn will give up their grasping, and so that their defilements will be depleted:
bo: དེ་ ཟག་པ་ ཟད་པ་ མཁྱེན་པ་ དེ་ འདི་ ལྟ་བུ་ ལ་ རབ་ཏུ་ གནས་མ་ ཐག་ ཏུ་ ཟག་པ་ དང་ བཅས་པ་ ལེན་པ་ དང་ བཅས་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལ་ ཟག་པ་ ཟད་པར་ བྱ་བ་ དང་ ། ལེན་པ་ སྤང་བ་ -འི་ ཕྱིར་ ཆོས་སྟོན་ ཏོ་ ། །

source: ‘Alas, you sentient beings who come to be through unreal conceptualization, you should understand contaminants and grasping in accordance with reality!’
bo: ཀྱེ་མ་ སེམས་ཅན་ ཡང་དག་པ་ མ་ཡིན་པ་ ཀུན་ དུ་ རྟོག་པ་ ལས་ ཀུན་ དུ་ བྱུང་བ་ དག་ ཁྱེད་ ཟག་པ་ དང་ལེན་པ་ དེ་དག་ ལ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སོ་སོ་ -ར་ རྟོགས་ ཤིག་ ཅེས་

source: In this manner, the tathāgatas make them know in accordance with reality that contaminants are not real.
bo: དེ་དག་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཅི་ ནས་ ཀྱང་ ཟག་པ་ རྣམས་ ཡང་དག་པ་ མ་ཡིན་པ་ -ར་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ རབ་ཏུ་ ཤེས་པ་ -ར་ འགྱུར་བ་ དང་ །

source: And having known that, they do not cling to any phenomenon.
bo: རབ་ཏུ་ ཤེས་ ནས་ ཀྱང་ ཆོས་ གང་ཡང་ མི་ ལེན་ ཏེ

source: Due to their lack of clinging, they pass completely beyond sorrow.
bo: དེ་དག་ མི་ ལེན་པ་ -ས་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ འགྱུར་བ་ དེ་ལྟ་

source: In this way, they teach the Dharma through well-conceived illustrations.
bo: དེ་ལྟར་ དཔེ་ ཉེ་བར་ བཀོད་པ་ -འི་ དཔེ་ རྣམས་ ཀྱིས་ ཆོས་སྟོན་ ཏེ་ །

source: Son of noble family, this is the tenth tathāgata activity of the tathāgatas.
bo: རིགས་ ཀྱི་ བུ་ འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The guides’ knowledge of the depletion of contaminants Is exceedingly vast, unobscured, and limitless.
bo: འདྲེན་པ་ -འི་ ཟག་པ་ ཟད་པ་ མཁྱེན་པ་ ནི་ ། ། ཤིན་ཏུ་ རྒྱ་ ཆེ་ མ་ བསྒྲིབས་ ཚད་ མེད་ ལྡན་ ། །

source: Through the strength of the ten strengths, The peace of supreme awakening is realized and fully discerned.
bo: སྟོབས་ བཅུ་ སྟོབས་ ནི་ དེ་ ཡིས་ བྱང་ཆུབ་ མཆོག་ ། ཞི་བ་ འདི་ ནི་ རྟོགས་ ཤིང་ རབ་ཏུ་ ཕྱེ་ ། །

source: “ ‘The śrāvakas’ knowledge of the depletion of contaminants Does not destroy karmic traces and is limited.
bo: ཉན་ཐོས་ རྣམས་ ཀྱི་ ཟག་ཟད་ ཤེས་པ་ ནི་ ། ། བག་ཆགས་ མ་ བཅོམ་ ཚད་ དང་ ལྡན་པ་ ཡིན་ ། །

source: But the knowledge of the supreme guides, excellent among humans, Destroys karmic traces and is unlimited.
bo: མི་ ཡི་ མཆོག་ གི་ རབ་མཆོག་ འདྲེན་པ་ ཡི་ ། ། བག་ཆགས་ བཅོམ་ ཞིང་ ཚད་ དང་ ལྡན་ མ་ ཡིན་ ། །

source: “ ‘Likewise, for pratyekabuddhas who reach their awakening
bo: དེ་བཞིན་ གང་དག་ རང་རྒྱལ་ བྱང་ཆུབ་ རེག་ །

source: With no great compassion or courage,
bo: དེ་ ལ་ སྙིང་རྗེ་ ཆེ་ དང་ སྤོབས་པ་ མེད་ ། །

source: Once their contaminants have been completely depleted,
bo: ཟག་པ་ དག་ ནི་ ཡོངས་སུ་ ཟད་ གྱུར་ ནས་ ། །

source: Their great compassion and courage will also be limitless.
bo: སྙིང་རྗེ་ ཆེ་ དང་ སྤོབས་པ་ ཚད་ ཀྱང་ མེད་ ། །

source: “ ‘Once the buddha knowledge of the depletion of contaminants is present, They come to know that the contaminants of beings are unreal.
bo: སངས་རྒྱས་ ཟག་ཟད་ མཁྱེན་ ལ་ གནས་ ནས་ ནི་ ། ། འགྲོ་བ་ -འི་ ཟག་པ་ ཡང་དག་ མ་ ཡིན་ མཁྱེན་ ། །

source: By not knowing this crucial point, Those sentient beings get it all wrong.
bo: རིགས་པ་ -འི་ གནས་ ཀྱི་ ཚུལ་ འདི་ མ་ ཤེས་པ་ -ས་ ། ། སེམས་ཅན་ འདི་དག་ ཐམས་ཅད་ ལོག་པ་ -ར་ སྦྱོར་ ། །

source: “ ‘The victors engendered inexhaustible compassion toward them,
bo: དེ་ ལ་ རྒྱལ་བ་ -ས་ སྙིང་རྗེ་ མི་ཟད་ བསྐྱེད་ ། །

source: Teaching that phenomena are impermanent, empty, and selfless:
bo: མི་རྟག་ སྟོང་པ་ བདག་མེད་ ཆོས་ ཀྱང་ སྟོན་ ། །

source: “Understand these phenomena to be unreal and illusory
bo: ཆོས་ འདི་ དངོས་མེད་ སྒྱུ་མ་ ལྟ་བུ་ -ར་ ནི་ ། ། རྟོགས་ ལ་

source: And truly attain supreme peace!”
bo: ཞི་ མཆོག་ ཡང་དག་ ཐོབ་པ་ -ར་ གྱིས་ ། །

source: “ ‘Even though there are no creatures, Individuals, human beings, humankind, or agents of actions, All these beings cling to what is completely wrong—
bo: འདི་ ནི་ སྲོག་ དང་ གང་ཟག་ ཤེད་ སྐྱེས་ དང་ ། ། ཤེད་བུ་ དེ་བཞིན་ བྱེད་པ་པོ་ མེད་ ཀྱང་ ། ། སེམས་ཅན་ འདི་ ཀུན་ ལོག་པ་ -ར་ ཞེན་པ་ -ས་ ན་ ། །

source: Thus the teachers who engender compassion explain liberation.
bo: སྙིང་རྗེ་ བསྐྱེད་པ་ སྟོན་པ་ ཐར་པ་ -ར་ འཆད་ ། །

source: “ ‘The sugatas never grow weary.
bo: བདེ་བ་ -ར་ གཤེགས་ ལ་ ཡོངས་སུ་ སྐྱོ་མེད་ ཅིང་ ། །

source: Knowing reality, they are never wrong.
bo: ཡང་དག་ ཤེས་ ལ་ ནམ་ཡང་ ཉེས་པ་ མེད་ ། །

source: Therefore, the victors are always diligently engaged, Teaching the Dharma to benefit beings.
bo: དེ་ -ས་ ནི་ རྒྱལ་བ་ རྟག་ ཏུ་ རྣལ་འབྱོར་ བརྩོན་ ། ། འགྲོ་ ལ་ ཕན་ ཕྱིར་ ཆོས་ ཀྱང་ རབ་ཏུ་ སྟོན་ ། །

source: “ ‘Subduing opponents completely Is an action in line with the victory of possessing the ten strengths.
bo: འདི་ ནི་ ཕ་རོལ་ རྒོལ་བ་ རབ་ འདུལ་བ་ ། ། སྟོབས་ བཅུ་ ལྡན་ གྱི་ རྒྱལ་ དང་ འཐུན་པ་ -འི་ ལས་ ། །

source: Dwelling in the power of possessing the ten strengths, They fully turn the incomparable noble wheel.’
bo: སྟོབས་ བཅུ་ མངའ་བ་ སྟོབས་ དེ་ -ར་ གནས་ ནས་ ནི་ ། ། མཚུངས་མེད་ འཁོར་ལོ་ དམ་པ་ རབ་ཏུ་ བསྐོར་ །། །།

source: “Son of noble family, the tathāgatas dwell in the tathāgatas’ four types of fearlessness.
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ མི་ འཇིགས་པ་ བཞི་པོ་ དག་ ལ་ རབ་ཏུ་ གནས་ ཏེ་ །

source: No one in the world with its gods can reasonably reprove the tathāgatas, saying, ‘You have not become completely and perfectly awakened regarding phenomena,’ in response to their proclamation, ‘We perform awakened deeds and have become completely and perfectly awakened.’
bo: འཕྲིན་ལས་ མཛད་ ཅིང་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ སོ་ ཞེས་ བདག་ཉིད་ ཞལ་ གྱིས་ འཆེ་བ་ དེ་ ལ་ ལྷ་ དང་ བཅས་པ་ -འི་ འཇིག་རྟེན་ གང་ གིས་ ཀྱང་ ཁྱོད་ ཀྱིས་ ཆོས་ འདི་དག་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་ མ་ རྒྱས་ སོ་ ཞེས་ ཆོས་ དང་ འཐུན་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ རྒོལ་ མི་ ནུས་ སོ་ ། །

source: “Why is it that tathāgatas declare that they are completely and perfectly awakened?
bo: ཅིའི་ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཞེས་ བྱ་ ཞེ་ན་

source: The tathāgatas are completely and perfectly awakened to the fact that all phenomena are equal.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཐམས་ཅད་ མི་མཉམ་པ་ མེད་པ་ -ར་ ཡང་དག་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: They are completely and perfectly awakened to the fact that the phenomena of ordinary people, those engaged in learning, those in a state of no more learning, pratyekabuddhas, bodhisattvas, and buddhas are all equal.
bo: སོ་སོ་ -འི་ སྐྱེ་བོ་ -འི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དང་ ། སློབ་པ་ -འི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དང་ ། མི་སློབ་པ་ -འི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དང་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དང་ ། སངས་རྒྱས་ ཀྱི་ ཆོས་ རྣམས་ གང་ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མཉམ་པ་ཉིད་ དུ་ ཡང་དག་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: They are completely and perfectly awakened to the fact that mundane, supramundane, flawed, unflawed, contaminated, uncontaminated, conditioned, and unconditioned phenomena are all equal.
bo: འཇིག་རྟེན་པ་ དང་ ། འཇིག་རྟེན་ ལས་ འདས་པ་ དང་ ། ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ་ དང་ ། ཁ་ན་མ་ཐོ་བ་ མེད་པ་ དང་ ། ཟག་པ་ དང་ བཅས་པ་ དང་ ། ཟག་པ་ མེད་པ་ དང་ ། འདུས་བྱས་ དང་ འདུས་མ་བྱས་ ཀྱི་ ཆོས་ གང་ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ མཉམ་པ་ཉིད་ དུ་ ཡང་དག་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: “How are they equal?
bo: དེ་ ལ་ མཉམ་པ་ཉིད་ གང་ཞེ་ན་ །

source: In terms of the essential view, they are equal in their emptiness.
bo: ལྟ་བ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ སྟོང་པ་ཉིད་ དུ་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential sign, they are equal in being signless.
bo: མཚན་མ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ མཚན་མ་ མེད་པ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of the three realms, they are equal in being wishless.
bo: ཁམས་ གསུམ་པ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ སྨོན་པ་ མེད་པ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of birth, they are equal in being unborn.
bo: སྐྱེ་བ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ མི་ སྐྱེ་བ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of conditioning, they are equal being without conditioning.
bo: མངོན་པར་ འདུ་བྱེད་པ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of origination, they are equal in being without origination.
bo: འབྱུང་བ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ འབྱུང་བ་ མེད་པ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of the substratum consciousness, they are equal in having no substratum consciousness.
bo: ཀུན་གཞི་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ ཀུན་གཞི་ མེད་པ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of the three times, they are equal in accordance with reality.
bo: དུས་གསུམ་ གྱི་ ངོ་བོ་ ཉིད་ ཀྱིས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of ignorance, becoming, and craving, they are equal in being knowledge and liberation.
bo: མ་རིག་པ་ དང་ ། སྲིད་པ་ དང་ ། སྲེད་པ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ རིག་པ་ དང་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ར་ མཉམ་པ་ཉིད་ དོ་ ། །

source: In terms of the essential nature of saṃsāra, they are equal in being nirvāṇa.
bo: འཁོར་བ་ -འི་ ངོ་བོ་ ཉིད་ ཀྱིས་ མྱ་ངན་ ལས་ འདས་པ་ -ར་ མཉམ་པ་ཉིད་ དེ་ །

source: Thus, the tathāgatas are completely and perfectly awakened to the equality of all phenomena, and that is why they declare, ‘We are completely and perfectly awakened.’
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ -ས་ དེ་ -འི་ ཕྱིར་ཡང་ དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཞེས་ བྱ་ -འོ་ ། །

source: “Just as the tathāgatas have become completely and perfectly awakened with regard to those phenomena, in the same way they abide in great compassion.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ཇི་ལྟར་ ཆོས་ དེ་དག་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ དེ་བཞིན་ དུ་ ཐུགས་རྗེ་ ཆེན་པོ་ ལ་ གནས་ ཏེ་

source: They teach other people and beings by means of various Dharmas, discourses, and circumstances.
bo: བསྟན་པ་ སྣ་ཚོགས་ དང་ ། རྣམ་ གྲངས་ སྣ་ཚོགས་ དང་ ། རྐྱེན་ སྣ་ཚོགས་ རྣམས་ ཀྱིས་ སེམས་ཅན་ གཞན་དག་ དང་ གང་ཟག་ གཞན་ རྣམས་ ལ་ ཡང་དག་པ་ -ར་ རབ་ཏུ་ སྟོན་ ཏེ

source: Their Dharma arises for the sake of eliminating created suffering.
bo: དེ་ -འི་ ཆོས་ དེ་ཡང་ དེ་ བྱེད་པ་ -འི་ སྡུག་བསྔལ་ ཡང་དག་པ་ -ར་ ཟད་པར་ བྱ་བ་ -འི་ ཕྱིར་ ངེས་པར་ འབྱུང་ ངོ་ ། །

source: “This tathāgata fearlessness overpowers and annuls allegations such as ‘They say they are teachers when they are not’ and ‘They say they are completely and perfectly awakened when they are not.’
bo: གང་དག་ སྟོན་པ་ མ་ཡིན་པ་ -ར་ སྟོན་པ་ -འོ་ ཞེས་ ཁ་ -ས་ འཆེ་བ་ དང་ ། ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ མ་ཡིན་པ་ -ར་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ སོ་ ཞེས་ ཁ་ -ས་ འཆེ་བ་ དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ -འི་ མི་ འཇིགས་པ་ འདི་ -ས་ ཟིལ་ གྱིས་ ནོན་པ་ -ར་ འགྱུར་ ཞིང་ མེད་པ་ -ར་ ཡང་ འགྲོ་བ་ -ར་ འགྱུར་ ཏེ

source: This is the eleventh tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་གཅིག་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The spontaneously arisen ones Have realized all phenomena to be equal.
bo: རང་བྱུང་ གིས་ ནི་ ཆོས་ རྣམས་ ཀུན་ ། ། མཉམ་པ་ཉིད་ དུ་ རྗེས་ རྟོགས་པ་ -ས་ ། །

source: Therefore they are completely and perfectly awakened.
bo: དེས་ན་ ཡང་དག་ རྫོགས་ སངས་རྒྱས་ ། །

source: The tathāgatas see equality.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ མཉམ་པ་ -ར་ གཟིགས་ ། །

source: “ ‘The phenomena of ordinary people,
bo: སོ་སོ་ -འི་ སྐྱེ་བོ་ -འི་ ཆོས་ རྣམས་ དང་ ། །

source: The phenomena of those engaged in learning or no more learning,
bo: སློབ་ དང་ མི་ སློབ་ ཆོས་ རྣམས་ དང་ ། །

source: And the phenomena of pratyekabuddhas
bo: རང་རྒྱལ་ ཆོས་ རྣམས་ གང་ཡིན་པ་ ། །

source: Are all equal to the phenomena of buddhas.
bo: དེ་དག་ སངས་རྒྱས་ ཆོས་ དང་ མཉམ་ ། །

source: “ ‘The mundane and, likewise, The supramundane, As well as virtue and nonvirtue, Are similar and equal to nirvāṇa.
bo: འཇིག་རྟེན་པ་ དང་ དེ་བཞིན་ དུ་ ། ། འཇིག་རྟེན་ ལས་ ནི་ འདས་པ་ དང་ ། ། དགེ་ དང་ མི་དགེ་ གང་ཡིན་པ་ ། ། མྱ་ངན་ འདས་ དང་ མཚུངས་ ཤིང་ འདྲ་ ། །

source: “ ‘Empty, signless, Wishless, unborn, And unconditioned, They are all seen to be equal.
bo: སྟོང་པ་ མཚན་མ་ མེད་པ་ དང་ ། ། སྨོན་པ་ རྣམ་པ་ -ར་ སྤངས་པ་ དང་ ། ། སྐྱེ་ མེད་ མངོན་པར་ འདུ་ མི་ བྱེད་ ། ། ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ གཟིགས་ ། །

source: “ ‘Having realized those, They teach beings with compassion.
bo: དེ་དག་ རྟོགས་ ནས་ ཐུགས་རྗེ་ ཡིས་ ། ། སེམས་ཅན་ རྣམས་ ལ་ རབ་ སྟོན་ ཏོ་ ། །

source: Therefore beings are liberated.
bo: དེས་ན་ སེམས་ཅན་ རྣམ་པ་ -ར་ འགྲོལ་ ། །

source: This is the supreme activity of the capable ones.’
bo: འདི་ ནི་ ཐུབ་པ་ -འི་ ལས་ ཀྱི་ མཆོག་ །

source: “Son of noble family, no one in the world with its gods can reasonably reprove the tathāgatas, saying, ‘You have not eliminated those contaminants’ in response to their proclamation, ‘We have eliminated contaminants.’
bo: རིགས་ ཀྱི་ བུ་ གཞན་ ཡང་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ང་ ཟག་པ་ ཟད་ དོ་ ཞེས་ བདག་ཉིད་ ཞལ་ གྱིས་ འཆེ་བ་ དེ་ ལ་ ལྷ་ དང་ བཅས་པ་ -འི་ འཇིག་རྟེན་ གང་ གིས་ ཀྱང་ ཁྱོད་ ཟག་པ་ འདི་དག་ མ་ཟད་ དོ་ ཞེས་ ཆོས་ དང་ འཐུན་པ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ ལ་ རྒོལ་ མི་ ནུས་ སོ་ ། །

source: “The tathāgatas’ depletion of contaminants occurs in the following manner:
bo: དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཟག་པ་ ཟད་པ་ ནི་ འདི་ ཡིན་ ཏེ་ །

source: Since the minds of tathāgatas are freed from the contaminants of desire, they have destroyed all karmic traces that partake of attachment.
bo: འདོད་པ་ -འི་ ཟག་པ་ རྣམས་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ འདོད་ཆགས་ ལ་ སྤྱོད་པ་ -འི་ བག་ཆགས་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་ མོ་ ། །

source: Since the minds of tathāgatas are freed from the contaminants of becoming, they have destroyed all karmic traces that partake of anger.
bo: སྲིད་པ་ -འི་ ཟག་པ་ རྣམས་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ ཞེ་སྡང་ ལ་ སྤྱོད་པ་ -འི་ བག་ཆགས་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་ མོ་ ། །

source: Since the minds of tathāgatas are freed from the contaminant of ignorance, they have destroyed all karmic traces that partake of delusion.
bo: མ་རིག་པ་ -འི་ ཟག་པ་ རྣམས་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ གཏི་མུག་ ལ་ སྤྱོད་པ་ -འི་ བག་ཆགས་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་ མོ་ ། །

source: Since the minds of tathāgatas are freed from the contaminants of views, they have destroyed all karmic traces that partake of afflictive emotion.
bo: ལྟ་བ་ -འི་ ཟག་པ་ རྣམས་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སེམས་ རྣམ་པ་ -ར་ གྲོལ་བ་ -ས་ ཉོན་མོངས་པ་ ལ་ སྤྱོད་པ་ -འི་ བག་ཆགས་ ཐམས་ཅད་ ལེགས་པ་ -ར་ བཅོམ་ སྟེ་ །

source: “Therefore, from a conventional worldly point of view, the tathāgatas are said to have depleted the contaminants.
bo: དེ་ -འི་ ཕྱིར་ འཇིག་རྟེན་ གྱི་ ཀུན་རྫོབ་ ཉེ་བར་ བཟུང་ ནས་ དེ་བཞིན་ གཤེགས་པ་ ཟག་པ་ ཟད་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: However, ultimately, from the perspective of the insight and wisdom of the noble ones, phenomena that are to be known, abandoned, cultivated, or realized are never established.
bo: དོན་དམ་པ་ -ར་ ན་ ནི་ འཕགས་པ་ -འི་ ཤེས་རབ་ དང་ ཡེ་ཤེས་ ཀྱི་ མདུན་ ན་ གང་ ཡོངས་སུ་ ཤེས་པ་ -ར་ བྱ་བ་ -འམ་ སྤང་བ་ -ར་ བྱ་བ་ -འམ་ ། བསྒོམ་པ་ -ར་ བྱ་བ་ -འམ་ མངོན་སུམ་ དུ་ བྱ་བ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ གང་ཡང་ མི་ གནས་ སོ་ ། །

source: “Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The ‘depleted’ are never not depleted.
bo: གང་ ཟད་པ་ ཞེས་ བྱ་བ་ དེ་ ནི་ ནམ་ དུ་ ཡང་ མི་ཟད་པ་ ཡིན་ ནོ་ ། །

source: They are totally depleted, but they are not ‘depleted by means of an antidote.’
bo: དེ་ ནི་ ཤིན་ཏུ་ ཟད་པ་ ཉིད་ ཡིན་ གྱི་ གཉེན་པོ་ -ས་ ཟད་པ་ ཞེས་ ནི་ མི་ བྱ་ སྟེ་ །

source: Their depletion accords with reality.
bo: དེ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཟད་པ་ -འོ་ ། །

source: That depletion that accords with reality is devoid of anything depleted.
bo: ཇི་ལྟ་བ་ བཞིན་ དུ་ ཟད་པ་ གང་ཡིན་པ་ དེ་ ལ་ ཟད་པ་ གང་ཡང་ མེད་ དོ་ ། །

source: That which is devoid of anything anywhere depleted is called unconditioned.
bo: གང་ ལ་ ཟད་པ་ གང་ཡང་ མེད་པ་ དེ་ འདུས་མ་བྱས་པ་ -འོ་ ། །

source: The unconditioned is unborn, does not endure, and does not deteriorate.
bo: འདུས་མ་བྱས་པ་ གང་ཡིན་པ་ དེ་ ལ་ སྐྱེ་བ་ མེད་ ། འཇིག་པ་ མེད་ ། གནས་པ་ མེད་ དེ་ །

source: “Therefore, whether tathāgatas appear or not, that which is the nature of reality and the realm of phenomena prevails.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ བྱུང་ ཡང་ རུང་ ། མ་ བྱུང་ ཡང་ རུང་ སྟེ་ ། ཆོས་ཉིད་ དང་ ཆོས་ ཀྱི་ དབྱིངས་ དེ་ ནི་ གནས་པ་ ཉིད་ དོ་ ། །

source: Just as the realm of phenomena prevails, in the same way wisdom prevails within it.
bo: ཆོས་ ཀྱི་ དབྱིངས་ དེ་ ཇི་ལྟར་ གནས་པ་ དེ་བཞིན་ དུ་ དེ་ ལ་ ཡེ་ཤེས་ ཞུགས་ ཏེ་ །

source: Just as it is without engagement or withdrawal, wisdom prevails in the same manner.
bo: ཇི་ལྟར་ འཇུག་པ་ མེད་པ་ དང་ ། ལྡོག་པ་ མེད་པ་ དེ་ལྟར་ ཞུགས་ སོ་ ། །

source: “The tathāgatas, who, in accordance with the way of the Dharma, do not objectify the contaminants or their abandonment, are settled in great compassion and teach the Dharma to sentient beings so that they may abandon their contaminants.
bo: དེ་ལྟ་ བུ་ -འི་ ཆོས་ ཀྱི་ ཚུལ་ གྱིས་ ཟག་པ་ དང་ ། ཟག་པ་ སྤོང་བ་ མི་ དམིགས་ ཏེ་ ། དེ་བཞིན་ གཤེགས་པ་ ནི་ ཐུགས་རྗེ་ ཆེན་པོ་ ལ་ གནས་ ནས་ སེམས་ཅན་ རྣམས་ ཀྱི་ ཟག་པ་ སྤང་བ་ -འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་ ཏེ་ །

source: This is the twelfth tathāgata activity of the tathāgatas.
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ འཕྲིན་ལས་ བཅུ་གཉིས་པ་ -འོ་ ། །

source: About this it has been proclaimed:
bo: དེ་ ལ་ འདི་སྐད་ ཅེས་ བྱ་ -འོ་ ། །

source: “ ‘The victors have abandoned the contaminants of desire,
bo: རྒྱལ་བ་ -ས་ འདོད་པ་ -འི་ ཟག་པ་ སྤངས་པ་ -ས་ ན་ །

source: Thus they have no further karmic traces of attachment.
bo: འདོད་ཆགས་ བག་ཆགས་ ཕྱིས་ ནི་ ཡོད་ མ་ ཡིན་ ། །

source: The lords of humans are freed from all further becoming,
bo: མི་དབང་ སྲིད་པ་ ཀུན་ ལས་ རྣམ་གྲོལ་ བས་ ། །

source: Thus all faults without exception are cut off.
bo: དེ་ ཡི་ ཉེས་པ་ མ་ ལུས་ ཡང་དག་ འཆད་ ། །

source: “ ‘The sugatas are established in knowledge of all kinds,
bo: བདེ་གཤེགས་ རིག་པ་ ཀུན་ ལ་ གནས་པ་ -ས་ ན་ ། །

source: Thus they are free of any residual delusion.
bo: དེ་ ཡི་ གཏི་མུག་ ལྷག་མ་ མ་ ལུས་ བྲལ་ ། །

source: The lions among humans are free from any view,
bo: མི་ ཡི་ སེང་གེ་ ལྟ་བ་ ཀུན་ དང་ བྲལ་ ། །

source: Thus they are without any karmic traces that partake of afflictive emotions.
bo: དེ་ -ས་ ནི་ ཉོན་མོངས་ སྤྱོད་པ་ -འི་ བག་ཆགས་ མེད་ ། །

source: “ ‘In order that all attain the depletion of contaminants,
bo: ཀུན་ གྱིས་ ཟག་པ་ ཟད་པ་ འཐོབ་ འགྱུར་བ་ -ར་ ། །

source: The victorious ones teach the Dharma at the conventional level.
bo: རྒྱལ་བ་ ཀུན་རྫོབ་ ཏུ་ ནི་ ཆོས་སྟོན་ ཏོ་ ། །

source: Phenomena that increase or are depleted
bo: གང་ཞིག་ འཕེལ་བ་ དང་ ནི་ ཟད་ འགྱུར་བ་ ། །

source: Do not exist ultimately.
bo: ཆོས་ དེ་ དམ་པ་ -འི་ དོན་ དུ་ཡོད་ མ་ ཡིན་ ། །

source: “ ‘For them, depletion is not depletion by means of an antidote,
bo: ཟད་པ་ གཉེན་པོ་ -ས་ ཟད་པ་ མ་ ཡིན་ ཏེ་ ། །
